Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: Refresh your browser to change your language preference.
es: Actualice su navegador para cambiar su preferencia de idioma.
fr: Actualisez votre navigateur pour modifier votre préférence de langue.
hi: अपनी भाषा पसंद बदलने के लिए अपने ब्राउज़र को रिफ़्रेश करें।
ja: 言語を変えるには、ブラウザをこうしんしてください。
mr: अपनी भाषा बदलने के लिए अपने ब्राउज़र को रीफ़्रेश करें
pt: Atualize a página do seu navegador para mudar as preferências de idioma
te: మీ భాషా ఇచ్చేందుకు మీ బ్రౌజర్‌ను రిఫ్రెష్ చేయండి
tr: dil tercihinizi değiştirmek için tarayıcınızı yenileyin
ur: اپنی زبان کی ترجیح کو تبدیل کرنے کے لئے اپنے براؤزر کو تازہ دم کری۔
zh_cn: 刷新你的浏览器以更改语言偏好。

source: Music Blocks is already set to this language.
es: Music Blocks ya estï¿½ configurado en este idioma.
fr: Music Blocks est déjà configuré sur cette langue.
hi: म्यूजिक ब्लॉक्स पहले से ही इस भाषा पर सेट है।
ja: Music Blocksは既にこの言語に設定されています。
mr: म्युझिक ब्लॉक्स आधीच या भाषेत सेट आहे.
pt: O Music Blocks já está configurado para este idioma.
te: మ్యూజిక్ బ్లాక్స్ ఇప్పటికే ఈ భాషకు సెట్ అయింది.
tr: music blocks zaten bu dile ayarlanmış
ur: میوزک بلاکس پہلے ہی اس زبان پر سیٹ ہے.
zh_cn: Music Blocks 已经设置为此语言

source: project undefined
es: El proyecto no está definido.
fr: projet indéfini
hi: परियोजना अपरिभाषित
ja: プロジェクト未定義
mr: प्रोजेक्ट अपरिभाषित
pt: projeto indefinido
te: ప్రాజెక్టు అప్రసరిపబ్ధం
tr: proje tanımsız
ur: پروجیکٹ غیر طے شدہ
zh_cn: 项目未定义

source: action
es: acción
hi: क्रिया
ja: アクション
mr: क्रिया
pt: ação
te: చర్య
tr: eylem
ur: کارروائی
zh_cn: 動作

source: duck
es: pato
fr: cane
hi: बतख
ja: あひる
mr: बत्तख
pt: pato
te: డక్
tr: ördek
ur: بتھ
zh_cn: 鸭子

source: Music Blocks is already set to this theme.
tr: music blocks zaten bu temaya ayarlanmış
ur: میوزک بلاکس پہلے ہی اس تھیم پر قائم ہیں
zh_cn: Music Blocks 已经设置为此主题。

source: Music Blocks Project
es: Proyecto de Bloques de Música
fr: Projet de blocs musicaux
hi: संगीत ब्लॉक्स परियोजना
ja: ミュージック・ブロックスのプロジェクト
mr: म्युझिक ब्लॉक्स प्रोजेक्ट
pt: Projeto Music Blocks
te: మ్యూజిక్ బ్లాక్స్ ప్రాజెక్ట్
tr: müzik blokları projesi
ur: میوزک بلاکس پروجیکٹ
zh_cn: Music Blocks 项目

source: This project was created in Music Blocks
es: Este proyecto fue creado en Bloques de Música
fr: Ce projet a été créé dans Music Blocks
hi: यह परियोजना म्यूज़िक ब्लॉक्स में बनाई गई थी
ja: このプロジェクトは、ミュージック・ブロックスで作成されました。
mr: हा प्रोजेक्ट म्युझिक ब्लॉक्स मध्ये तयार करण्यात आला होता
pt: Este projeto foi criado no Music Blocks
te: ఈ ప్రాజెక్టును మ్యూజిక్ బ్లాక్స్‌లో సృష్టించబడింది
tr: bu proje müzik bloklarında oluşturuldu
ur: یہ پروجیکٹ میوزک بلاکس میں تخلیق کیا گیا تھا
zh_cn: 此项目是在 Music Blocks 中创建的

source: Music Blocks is a Free/Libre Software application.
es: Bloques de Música es una aplicación de Software Libre
fr: Music Blocks est une application logicielle gratuite/libre
hi: म्यूज़िक ब्लॉक्स एक मुक्त/स्वतंत्र सॉफ़्टवेयर अनुप्रयोग है।
ja: ミュージック・ブロックスは、音楽のちしきを楽しみながら身につけることのできる、オープンソースのソフトです。
mr: म्युझिक ब्लॉक्स एक फ्री/लिब्रे सॉफ्टवेअर अनुप्रयोग आहे.
pt: O Music Blocks é Software Livre e gratuito.
te: మ్యూజిక్ బ్లాక్స్ ఉచిత/స్వతంత్ర సాఫ్ట్‌వేర్ అప్లికేషన్.
tr: music blocks ücretsiz/libre bir yazılım uygulamasıdır
ur: میوزک بلاکس ایک مفت/آزاد سافٹ ویئر ایپلیکیشن ہے
zh_cn: Music Blocks 是一个自由/开源软件应用程序。

source: The source code can be accessed at
es: Se puede acceder al código fuente en
fr: Le code source est accessible à l'adresse
hi: स्रोत कोड को इस पर पहुँचा जा सकता है
ja: ミュージック・ブロックスのソースコードは、こちらのURLから見ることができます。
mr: स्रोत कोड येथे प्रवेश केला जाऊ शकतो
pt: O código fonte pode ser acessado em
te: మూల కోడ్‌ను అంగీకరించవచ్చు
tr: kaynak koduna şu adresten erişilebilir
ur: سورس کوڈ یہاں سے حاصل کیا جا سکتا ہے
zh_cn: 源代码可在以下位置访问

source: For more information, please consult the
es: Para más información, consulte el
fr: Pour plus d'informations, veuillez consulter le
hi: अधिक जानकारी के लिए कृपया संपर्क करें
ja: もっと詳しく知りたい場合は、ミュージック・ブロックスのガイドを参照してください。
mr: अधिक माहितीसाठी, कृपया सल्ला घ्या
pt: Para mais informações, consulte por favor
te: మరికొందరు సమాచారానికి, దయచేసి అనుసరించండి
tr: daha fazla bilgi için lütfen
ur: مزید معلومات کے لیے، براہ کرم رجوع کریں
zh_cn: 如需更多信息，请查阅

source: Music Blocks Guide
es: Guía de Bloques de Música
fr: Guide des blocs musicaux
hi: म्यूजिक ब्लॉक्स मार्गदर्शिका
ja: ミュージック・ブロックスガイド
mr: म्युझिक ब्लॉक्स मार्गदर्शक
pt: Guia do Music Blocks
te: మ్యూజిక్ బ్లాక్‌ల మార్గదర్శిక
tr: müzik blokları kılavuzu
ur: میوزک بلاکس گائیڈ
zh_cn: Music Blocks 指南

source: Alternatively, open the file in Music Blocks using the Load project button.
es: Alternativamente, abra el archivo en Bloques de Música usando el botón Cargar proyecto.
fr: Vous pouvez également ouvrir le fichier dans Music Blocks à l'aide du bouton Charger le projet.
hi: विकल्प के रूप में, फ़ाइल को लोड परियोजना बटन का उपयोग करके म्यूज़िक ब्लॉक्स में खोलें।
ja: 「ファイルからプロジェクトを読みこむ」ボタンをおして、ファイルをひらいてください。
mr: पर्यायीपणे, प्रोजेक्ट लोड बटण वापरून फाईल म्युझिक ब्लॉक्समध्ये उघडा.
pt: Alternativamente, abra o arquivo no Music Blocks usando o botão Carregar projeto
te: లేదా, ప్రాజెక్ట్ బటన్ నొక్కి Music Blocksలో ఫైల్‌ను తెరవండంలో.
tr: alternatif olarak
ur: متبادل کے طور پر، میوزک بلاکس میں فائل کو لوڈ پروجیکٹ بٹن استعمال کرکے کھولیں.
zh_cn: 或者，使用“加载项目”按钮在 Music Blocks 中打开该文件

source: Project Code
es: Código de proyecto
fr: Code du projet
hi: परियोजना कोड
ja: プロジェクトのコード
mr: प्रोजेक्ट कोड
pt: Código do Projeto
te: ప్రాజెక్ట్ కోడ్
tr: proje kodu
ur: پروجیکٹ کوڈ
zh_cn: 项目代码

source: This code stores data about the blocks in a project.
es: Este código almacena datos sobre los bloques en un proyecto.
fr: Ce code stocke des données sur les blocs d'un projet
hi: यह कोड परियोजना में ब्लॉक्स के बारे में डेटा स्टोर करता है।
ja: このコードは、がいとうする場合、へんしゅうされたバージョンのプロジェクトといっしょに、プロジェクトの中のブロックに関するデータをほぞんします。
mr: हा कोड प्रोजेक्टमधील ब्लॉक्सबद्दल डेटा संग्रहित करतो.
pt: Este código contém dados sobre os blocos de um projeto.
te: ఈ కోడ్ ప్రాజెక్ట్లో ఉన్న బ్లాక్‌ల గురించి డేటాను భద్రపరచిస్తుంది.
tr: bu kod bir projedeki bloklar hakkında veri depolar
ur: یہ کوڈ پروجیکٹ میں بلاکس کے ڈیٹا کو محفوظ کرتا ہے
zh_cn: 此代码用于存储项目中模块的数据

source: Show
es: Mostrar
fr: Montrer
hi: दिखाएँ
ja: プロジェクトのコードを表示する
mr: दाखवा
pt: Mostrar
te: చూపించు
tr: Göster
ur: دکھائیں
zh_cn: 显示

source: Hide
es: Ocultar
fr: Cacher
hi: छुपाएँ
ja: プロジェクトのコードを非表示にする
mr: लपवा
pt: Ocultar
te: దాచు
tr: Gizle
ur: چھپائیں
zh_cn: 隐藏

source: My Project
es: Mi proyecto
fr: Mon projet
hi: मेरा परियोजना
ja: 自分のプロジェクト
mr: माझा प्रोजेक्ट
pt: Meu projeto
te: నా ప్రాజెక్ట్
tr: benim projem
ur: میرا پروجیکٹ
zh_cn: 我的项目

source: No description provided
es: Ninguna descripción provista
fr: Aucune description fournie
hi: कोई विवरण उपलब्ध नहीं है
ja: 記入がありません
mr: कोणतेही वर्णन प्रदान केलेले नाही
pt: Sem descrição fornecida
te: వివరణ అంగీకృతం కాదు
tr: açıklama yapılmadı
ur: کوئی تفصیل فراہم نہیں کی گئی
zh_cn: 未提供描述

source: Your recording is in progress.
es: Tu grabación está en curso.
fr: Votre enregistrement est en cours.
hi: आपका रिकॉर्डिंग प्रगति में है।
ja: 録音中
mr: तुमची रेकॉर्डिंग सुरू आहे.
te: మీ రికార్డింగ్ ప్రగతిలో ఉంది.
tr: Kaydınız devam ediyor
ur: آپ کی ریکارڈنگ جاری ہے
zh_cn: 您的录音正在进行中

source: File name
es: Nombre del archivo
fr: Titre du projet
hi: फ़ाइल का नाम
ja: ファイル名
mr: फाईलचे नाव
pt: Nome do arquivo
te: ఫైల్ పేరు
tr: dosya adı
ur: فائل کا نام
zh_cn: 文件名

source: Project title
es: Título del proyecto
hi: परियोजना का शीर्षक
ja: 曲名
mr: प्रोजेक्ट शीर्षक
pt: Título do projeto
te: ప్రాజెక్ట్ టైటిల్
tr: proje başlığı
ur: پروجیکٹ کا عنوان
zh_cn: 项目标题

source: Project author
es: Autor del Proyecto
fr: Auteur du projet
hi: परियोजना का लेखक
ja: 作曲家
mr: प्रोजेक्ट लेखक
pt: Autor do projeto
te: ప్రాజెక్ట్ రచయిత
tr: proje yazarı
ur: پروجیکٹ کا مصنف
zh_cn: 项目作者

source: Include MIDI output?
es: Incluye MIDI?
fr: Inclure une sortie MIDI ?
hi: MIDI आउटपुट शामिल करें?
ja: MIDIのアウトプットがくふにもまとめましょうか？
mr: MIDI आउटपुट समाविष्ट करा?
pt: Incluir saida de MIDI?
te: MIDI ఔట్పుట్ చేయవాలా?
tr: midi çıkışını dahil et?
ur: کیا MIDI آؤٹ پٹ شامل کریں؟
zh_cn: 包含 MIDI 输出？

source: Include guitar tablature output?
es: Incluye tablatura de guitarra
fr: Inclure la sortie de tablature de guitare ?
hi: गिटार टैब्लेचर आउटपुट शामिल करें?
ja: ギターのTABもがくふにまとめましょうか？
mr: गिटार टॅब्लेचर आउटपुट समाविष्ट करा?
pt: Incluir saida de tablatura de guitarra?
te: గిటార్ టాబ్లేచర్ ఔట్పుట్ చేయవాలా?
tr: gitar tablature çıktısını dahil et?
ur: کیا گٹار ٹیبلچر آؤٹ پٹ شامل کریں؟
zh_cn: 包含吉他六线谱输出？

source: Save as Lilypond
es: Guardar como lilypond
fr: Enregistrer sous Lilypond
hi: लिलीपॉंड के रूप में सहेजें
ja: Lilypondがくふのフォーマットでほぞん
mr: लिलीपॉन्ड म्हणून जतन करा
pt: Salvar como Lilypond
te: Lilypondలో గీత పత్రంగా భద్రపరచు
tr: lilypond olarak kaydet
ur: للیپونڈ کے طور پر محفوظ کریں
zh_cn: 另存为 Lilypond 文件

source: Mr. Mouse
es: Sr. Ratón
fr: Monsieur Souris
hi: श्री माउस
ja: ミスター・マウス
mr: श्री. माउस
pt: Sr. Ratinho
te: శ్రీమతి మౌస్
tr: bay fare
ur: مسٹر ماؤس
zh_cn: 先生.Mouse

source: The Lilypond code is copied to clipboard. You can paste it here:
es: El código de Lilypond se copia al portapapeles. Puedes pegarlo aquí:
fr: Le code Lilypond est copié dans le presse-papiers. Vous pouvez le coller ici :
hi: लिलीपॉंड कोड को क्लिपबोर्ड पर कॉपी किया गया है। आप इसे यहाँ पेस्ट कर सकते हैं:
ja: Lilypondがくふのフォーマットはクリップボードにコピーしてある。次のウェブサイトに貼り付けると楽譜が見られます。。
mr: लिलीपॉन्ड कोड क्लिपबोर्डवर कॉपी केला आहे. तुम्ही ते येथे पेस्ट करू शकता:
te: Lilypond కోడ్ క్లిప్‌బోర్డ్‌కు కాపీ అయింది. మీరు ఇక్కడ పేస్ట్ చేయవచ్చు:
ur: للیپونڈ کوڈ کلپ بورڈ میں کاپی کیا گیا ہے۔ آپ اسے یہاں چسپاں کر سکتے ہیں:
zh_cn: Lilypond 代码已复制到剪贴板。你可以将其粘贴到此处：

source: Search for blocks
es: Buscar bloques
fr: Recherche de blocs
hi: ब्लॉक्स के लिए खोजें
ja: ブロックを検索
mr: ब्लॉक्स शोधा
te: బ్లాక్‌లను శోధించండి
tr: blokları ara
ur: بلاکس کی تلاش کریں
zh_cn: 搜索模块

source: Are you sure you want to clear the workspace?
tr: çalışma alanını temizlemek istediğinizden emin misiniz?
ur: کیا آپ کو یقین ہے کہ آپ ورک اسپیس کو صاف کرنا چاہتے ہیں؟
zh_cn: 您确定要清空工作区吗？

source: Enter file name
tr: dosya adını girin
ur: فائل کا نام درج کریں
zh_cn: 输入文件名

source: File save canceled
tr: dosya kaydetme iptal edildi
ur: فائل محفوظ منسوخ
zh_cn: 文件保存已取消

source: Click on stop saving
tr: kaydetmeyi durdur üzerine tıklayın
ur: اسٹاپ سیونگ پر کلک کریں
zh_cn: 点击“停止保存”

source: Catching mice
es: atrapar ratones
fr: Attraper des souris
hi: चूहों को पकड़ना
ja: ネズミをつかまえているよ
mr: उंदरांना पकडत आहे
te: ఎలుకులను పట్టుకోవడం
tr: fare yakalamak
ur: چوہوں کو پکڑنے
zh_cn: 捉老鼠

source: Cleaning the instruments
es: limpiar los instrumentos
fr: Nettoyage des instruments
hi: उपकरणों की सफाई
ja: 楽器のおていれをしているよ
mr: वाद्ये स्वच्छ करत आहे
te: యంత్రాలను శుభ్రపరచడం
tr: aletlerin temizlenmesi
ur: آلات کی صفائی
zh_cn: 清洁乐器

source: Testing key pieces
es: probando piezas clave
fr: Tester les pièces clés
hi: मुख्य हिस्से का परीक्षण
ja: キーボードの音をたしかめているよ
mr: की पीसेसची चाचणी करत आहे
te: కీ భాగాలను పరీక్షించడం
tr: kilit parçaların test edilmesi
ur: کلیدی ٹکڑوں کی جانچ کرنا
zh_cn: 测试关键部件

source: Sight-reading
es: lectura a primera vista
fr: Lecture à vue
hi: साइट-रीडिंग
ja: がくふをよみこんでいるよ
mr: साइट-वाचन
te: దృష్టికావలి
ur: سخت پڑھنا
zh_cn: 视奏

source: Combining math and music
es: combinando matemáticas y música
fr: Combiner les mathématiques et la musique
hi: गणित और संगीत को मिलाकर
ja: 音楽と算数をくっつけているよ
mr: गणित आणि संगीत एकत्र करत आहे
te: గణితం మరియు సంగీతంను కలిపివచ్చడం
tr: matematik ve müziği birleştirmek
ur: ریاضی اور موسیقی کا امتزاج
zh_cn: 将数学与音乐相结合

source: Generating more blocks
es: generando más bloques
fr: Générer plus de blocs
hi: और ब्लॉक्स उत्पन्न करना
ja: ブロックをたくさんつくっているよ
mr: अधिक ब्लॉक्स तयार करत आहे
te: మరిన్ని బ్లాక్‌లను ఉత్పత్తించడం
tr: daha fazla blok üretmek
ur: مزید بلاکس پیدا کرنا
zh_cn: 生成更多模块

source: Tuning string instruments
es: afinar instrumentos de cuerda
fr: Accorder des instruments à cordes
hi: स्ट्रिंग उपकरणों को स्वर समर्पित करना
ja: 楽器のチューニングをしているよ
mr: तंतुवाद्यांची ट्यूनिंग करत आहे
te: కట్టుగాయలను కలిసివేయడం
tr: yaylı çalgıların akort edilmesi
ur: تار تار کے آلات
zh_cn: 调音弦乐器

source: Pressing random keys
es: presionando teclas aleatorias
fr: Appuyer sur des touches aléatoires
hi: यादृच्छिक कुंजियाँ दबाना
ja: キーボードでおんがくをつくっているよ
mr: रँडम की प्रेस करत आहे
te: యాదృచ్ఛికంగా కీలను నొక్కడం
tr: rastgele tuşlara basma
ur: بے ترتیب چابیاں دبانا
zh_cn: 随机按键

source: plugins will be removed upon restart.
es: los plugins se eliminarán al reiniciar.
fr: les plugins seront supprimés au redémarrage.
hi: प्लगइन्स को पुनरारंभ पर हटा दिया जाएगा।
ja: プラグインは再起動時に削除されます。
mr: प्लगइन्स रिस्टार्ट केल्यानंतर काढले जातील.
te: ప్లగిన్‌లు పునఃప్రారంభించాక తొలగించబడతాయి.
tr: eklentiler yeniden başlatıldığında kaldırılacaktır
ur: دوبارہ شروع کرنے پر پلگ ان کو ہٹا دیا جائے گا
zh_cn: 插件将在重启后被移除

source: show Cartesian
es: Mostrar Cartesiano
fr: montrer cartésien
hi: कार्टेशियन दिखाएँ
ja: ほうがん（ざひょう）を表示
mr: कार्टेशियन दाखवा
pt: mostrar Cartesiano
te: కార్టీషియన్ చూపు
tr: kartezyen göster
ur: کارٹیسیان دکھائیں
zh_cn: 显示笛卡尔坐标系

source: scale degree
es: grado de escala
fr: degré d'échelle
hi: स्केल डिग्री
ja: 音度
mr: पैमाने की डिग्री
pt: escala de graus
te: స్కేల్ డిగ్రీ
tr: ölçek derecesi
ur: پیمانے کی ڈگری
zh_cn: 音级

source: voice name
es: nombre de voz
fr: nom de la voix
hi: आवाज का नाम
ja: 音名
mr: आवाज का नाम
pt: nome da voz
te: ధ్వని పేరు
tr: ses adı
ur: آواز کا نام
zh_cn: 声部名称

source: invert mode
es: modo invertido
fr: mode inverse
hi: मोड उलटें
ja: モードを反転させる
mr: उलटा मोड
pt: modo inverso
te: మోడు పేరు
tr: ters çevirme modu
ur: الٹا موڈ
zh_cn: 反转模式

source: output tools
es: herramientas de producción
fr: outils de sortie
hi: आउटपुट टूल्स
ja: 出力ツール
mr: आउटपुट साधने
te: ఔట్‌పుట్ సాధనాలు
tr: çıktı araçları
ur: آؤٹ پٹ ٹولز
zh_cn: 输出工具

source: custom note
es: nota personalizada
fr: note personnalisée
hi: कस्टम नोट
ja: カスタムノート
mr: सानुकूल नोट
te: విశేష గానం
tr: özel not
ur: کسٹم نوٹ
zh_cn: 自定义音符

source: accidental name
es: nombre accidental
fr: nom accidentel
hi: आकस्मिक नाम
ja: 偶然の名前
mr: आकस्मिक नाव
te: అక్సిడెంటల్ పేరు
tr: kazara isim
ur: حادثاتی نام
zh_cn: 升降音符名称

source: east indian solfege
fr: Solfège des Indes orientales
hi: पूर्व भारतीय सोलफेज
ja: 東インドのソルフェージュ
mr: पूर्व भारतीय सोलफेज
te: తూర్పు భారత సొల్ఫేజ్
tr: doğu hint solfeji
ur: مشرق ہندوستانی سولفیج
zh_cn: 东印度首调系统

source: note name
es: nombre de la nota
fr: nom de la note
hi: नोट का नाम
ja: 音名
mr: नोटचे नाव
te: గానం పేరు
tr: nota adı
ur: نوٹ نام
zh_cn: 音符名称

source: temperament name
es: nombre de temperamento
fr: nom du tempérament
hi: स्वभाव नाम
ja: 気質名
mr: स्वभावाचे नाव
te: ముఖ్యమైన పేరు
tr: mizaç adı
ur: مزاج کا نام
zh_cn: 音律名称

source: mode name
es: nombre de modo
fr: nom du mode
hi: मोड का नाम
ja: モード名
mr: मोडचे नाव
pt: nome do modo
tr: mod adı
ur: موڈ نام
zh_cn: 调式名称

source: chord name
es: nombre de achorde
fr: nom de l'accord
hi: छोड़ का नाम
mr: तारांचे नाव
te: కార్డు పేరు
tr: akor adı
ur: راگ نام
zh_cn: 和弦名称

source: interval name
es: nombre de intervalo
fr: nom de l'intervalle
hi: अंतराल का नाम
ja: 音程名
mr: अंतरालाचे नाव
pt: nome do intervalo
te: వింతనపేరు
tr: aralık adı
ur: وقفہ نام
zh_cn: 音程名称

source: filter type
es: tipo de filtro
fr: type de filtre
hi: फ़िल्टर का प्रकार
ja: フィルターの種類
mr: फिल्टर प्रकार
te: ఫిల్టర్ రకం
tr: filtre türü
ur: فلٹر کی قسم
zh_cn: 滤波器类型

source: oscillator type
es: tipo de oscilador
fr: type d'oscillateur
hi: ऑस्किलेटर का प्रकार
ja: 発振器の種類
mr: ऑसिलेटर प्रकार
te: ఆస్కిలేటర్ రకం
tr: osilatör tipi
ur: آسکیلیٹر قسم
zh_cn: 振荡器类型

source: audio file
es: archivo de audio
fr: fichier audio
hi: ऑडियो फ़ाइल
ja: オーディオファイル
mr: ऑडिओ फाइल
te: ఆడియో ఫైల్
tr: ses dosyası
ur: آڈیو فائل
zh_cn: 音频文件

source: noise name
es: nombre de ruido
fr: nom du bruit
hi: शोर का नाम
ja: ノイズ名
mr: आवाजाचे नाव
te: సంతోషం పేరు
tr: gürültü adı
ur: شور کا نام
zh_cn: 噪声名称

source: drum name
es: nombre del tambor
fr: nom du tambour
hi: ढोल का नाम
ja: ドラム名
mr: ड्रमचे नाव
te: డ్రమ్ పేరు
tr: davul adı
ur: ڈھول کا نام
zh_cn: 鼓名称

source: effects name
es: nombre de efectos
fr: nom des effets
hi: प्रभाव का नाम
ja: エフェクト名
mr: प्रभावाचे नाव
te: ప్రభావాల పేరు
tr: efekt adı
ur: اثرات کا نام
zh_cn: 效果名称

source: wrap mode
es: modo de envoltura
fr: mode enveloppe
hi: रैप मोड
ja: ラップモード
mr: रॅप मोड
te: అంగడి మోడ్
tr: sarma modu
ur: ریپ موڈ
zh_cn: 包装模式

source: load file
es: cargar archivo
fr: charger le fichier
hi: फ़ाइल लोड करें
ja: ロード ファイル
mr: फाइल लोड करा
te: ఫైల్ లోడ్ చేయి
tr: dosya yükle
ur: لوڈ فائل
zh_cn: 加载文件

source: This block is deprecated.
es: Este bloque está en desuso.
fr: Ce bloc est obsolète.
hi: यह ब्लॉक पुराना हो गया है।
ja: このブロックはもうありません。
mr: हा ब्लॉक अप्रचलित आहे.
pt: Este bloco está descontinuado
te: ఈ బ్లాక్ అనుకరణాత్మకంగా చేర్చబడింది.
tr: bu blok kullanımdan kaldırılmıştır
ur: یہ بلاک فرسودہ ہے
zh_cn: 此模块已弃用

source: Block cannot be found.
es: Este bloque no se puede encontrar.
fr: Le bloc ne peut pas être trouvé.
hi: ब्लॉक नहीं मिल सकता है।
ja: ブロックが見つかりません。
mr: ब्लॉक सापडत नाही.
pt: O bloco não foi encontrado.
te: బ్లాక్ కనిపించడానికి అవసరం లేదు.
tr: blok bulunamıyor
ur: بلاک نہیں مل سکتا
zh_cn: 无法找到模块

source: Saving block artwork
es: Guardar ilustraciones de bloques
fr: Sauvegarde de l'illustration du bloc
hi: ब्लॉक कला सहेज रहा हूँ
ja: ブロックのアートを保存中
mr: ब्लॉक कलाकृती जतन करत आहे
te: బ్లాక్ ఆర్ట్‌వర్క్ నివేదిస్తోంది
tr: blok resmi kaydetme
ur: بلاک آرٹ ورک کی بچت
zh_cn: 保存模块艺术作品

source: Copy
es: Copiar
fr: Copie
hi: नक़ल
ja: コピー
mr: कॉपी
pt: Copiar
te: కాపీ
tr: Kopya
ur: کاپی
zh_cn: 复制

source: Erase
es: Borrar
fr: Effacer
hi: मिटाएँ
ja: 消す
mr: मिटवा
te: తొలగించు
tr: Silme
ur: مٹانا
zh_cn: 擦除

source: Play
es: Tocar
fr: Jouer
hi: बजाएं
ja: 実行
mr: चलायें
pt: Executar
te: ప్లే
ur: کھیلیں
zh_cn: 播放

source: Stop
es: Detener
fr: Arrêter
hi: रुकें
ja: 停止
mr: थांबवा
pt: Parar
te: నిలిపివేయి
tr: Durdur
ur: رکو
zh_cn: 停止

source: Paste
es: Pegar
fr: Coller
hi: चिपकाएँ
ja: 貼り付け
mr: पेस्ट
pt: Colar
te: అతికించు
tr: Yapıştır
ur: پیسٹ
zh_cn: 貼上

source: Save block help
es: Guardar ayuda de bloque
fr: Enregistrer l'aide au bloc
hi: ब्लॉक सहायता सहेजें
ja: ブロックの ヘルプを 保存
mr: ब्लॉक सहायता सहेजें
te: బ్లాక్ సహాయాన్ని భద్రపరచు
tr: blok yardımını kaydet
ur: بلاک مدد کو بچائیں
zh_cn: 保存模块帮助

source: Jumping to the bottom of the page.
es: Saltando al final de la página
fr: Aller en bas de la page.
hi: पृष्ठ के नीचे जाना।
ja: 画面の下にジャンプしています
mr: पृष्ठ के नीचे कूद रहा है।
te: పేజీలోని కొనసాగిస్తోంది.
tr: sayfanın en altına atlamak
ur: صفحے کے نیچے کودنا۔
zh_cn: 跳转到页面底部

source: Scrolling up.
es: Desplazarse hacia arriba
fr: Défilement vers le haut.
hi: ऊपर स्क्रोल कर रहा है।
ja: 上にスクロールしています
mr: ऊपर स्क्रॉल कर रहा है।
te: పైకి స్క్రోల్ చేస్తోంది.
tr: yukarı kaydırmak
ur: سکرولنگ
zh_cn: 向上滚动

source: Scrolling down.
es: Desplazarse hacia abajo
fr: Défilement vers le bas.
hi: नीचे स्क्रोल कर रहा है।
ja: 下にスクロールしています
mr: नीचे स्क्रॉल कर रहा है।
te: క్రిందకు స్క్రోల్ చేస్తోంది.
tr: aşağı kaydırmak
ur: نیچے سکرولنگ۔
zh_cn: 向下滚动

source: Extracting block
es: Bloque de extracción
fr: Extraction du bloc
hi: ब्लॉक निकाल रहा है
ja: ブロックを取り出しています
mr: ब्लॉक निकालना
te: బ్లాక్ నుండి ప్రత్యేకిస్తోంది.
tr: blok çıkarma
ur: بلاک نکالنا
zh_cn: 提取模块

source: Moving block up.
es: Mover bloque hacia arriba
fr: Déplacement du bloc vers le haut.
hi: ब्लॉक को ऊपर मोव कर रहा है।
ja: ブロックを上に動かしています
mr: ब्लॉक को ऊपर ले जाना।
te: బ్లాక్ పైకి చెల్లిపోస్తోంది.
tr: bloğu yukarı taşımak
ur: بلاک اپ منتقل کرنا۔
zh_cn: 将模块向上移动

source: Moving block down.
es: Mover bloque hacia abajo
fr: Déplacement du bloc vers le bas.
hi: ब्लॉक को नीचे मोव कर रहा है।
ja: ブロックを下に動かしています
mr: ब्लॉक को नीचे ले जाना।
te: బ్లాక్ క్రిందకు చెల్లిపోస్తోంది.
tr: bloğu aşağı taşımak
ur: بلاک نیچے منتقل کرنا۔
zh_cn: 将模块向下移动

source: Moving block left.
es: Mover bloque a la izquierda
fr: Déplacement du bloc vers la gauche.
hi: ब्लॉक को बाएँ मोव कर रहा है।
ja: ブロックを左に動かしています
mr: ब्लॉक को बाईं ओर ले जाना।
te: బ్లాక్ ఎడమకు చెల్లిపోస్తోంది.
tr: blok sola hareket ediyor
ur: بلاک بائیں طرف منتقل کرنا۔
zh_cn: 将模块向左移动

source: Moving block right.
es: Mover bloque a la derecha
fr: Déplacement du bloc vers la droite.
hi: ब्लॉक को दाएँ मोव कर रहा है।
ja: ブロックを右に動かしています
mr: ब्लॉक को दाईं ओर ले जाना।
te: బ్లాక్ కుడికి చెల్లిపోస్తోంది.
tr: blok sağa hareket ediyor
ur: دائیں بلاک منتقل کرنا۔
zh_cn: 将模块向右移动

source: Jump to home position.
es: Saltar a la posición inicial
fr: Aller à la position initiale.
hi: होम स्थिति पर जाएँ।
ja: まんなかにジャンプする
mr: मुख्य स्थिति पर कूदें।
te: హోమ్ స్థానానికి చెల్లిపోస్తోంది.
tr: ana konuma atla
ur: گھر کی پوزیشن پر جائیں۔
zh_cn: 跳转到首页位置

source: Hide blocks
es: Ocultar bloques
fr: Masquer les blocs
hi: ब्लॉक छुपाएँ
ja: ブロックを非表示
mr: ब्लॉक छुपाएं
te: బ్లాక్‌లను దాచు
tr: blokları gizle
ur: بلاکس چھپائیں
zh_cn: 隐藏模块

source: Trash can is empty.
tr: çöp kutusu boş
ur: کوڑے دان خالی ہے۔
zh_cn: 垃圾桶是空的

source: Item restored from the trash.
es: Objeto recuperado de la basura.
fr: Élément restauré de la corbeille.
mr: आइटम को ट्रैश से पुनर्स्थापित किया गया।
tr: öğe çöp kutusundan geri yüklendi
ur: آئٹم کوڑے دان سے بحال ہوا۔
zh_cn: 项目从垃圾桶中恢复

source: Restore last item
tr: son öğeyi geri yükle
ur: آخری آئٹم کو بحال کریں
zh_cn: 恢复最后一个项目

source: Restore all items
tr: tüm öğeleri geri yükle
ur: تمام اشیاء کو بحال کریں
zh_cn: 恢复所有项目

source: Click the run button to run the project.
es: Haga clic en el botón ejecutar para ejecutar el proyecto.
fr: Cliquez sur le bouton exécuter pour lancer le projet.
hi: परियोजना चलाने के लिए रन बटन पर क्लिक करें।
ja: プロジェクトを再生するため、再生のボタンをクリックしてください。
mr: प्रोजेक्ट चलाने के लिए रन बटन पर क्लिक करें।
te: ప్రాజెక్ట్‌ను అమలు చేయడానికి రన్ బటన్‌ను క్లిక్ చేయండి.
tr: Projeyi çalıştırmak için çalıştır düğmesine tıklayın
ur: پروجیکٹ کو چلانے کے لئے رن بٹن پر کلک کریں۔
zh_cn: 点击运行按钮以运行项目

source: Home
es: Casa
fr: Accueil
hi: होम
ja: ホーム
mr: मुख्य पृष्ठ
pt: Início
te: హోమ్
tr: Ana Sayfa
ur: ہوم
zh_cn: 主页

source: Show/hide blocks
es: Mostrar u ocultar los bloques.
fr: Afficher/masquer les blocs
hi: ब्लॉक्स दिखाएँ/छुपाएँ
ja: ブロックを表示する／かくす
mr: ब्लॉक दिखाएं/छुपाएं
pt: Mostrar/ocultar blocos
te: బ్లాక్‌లను చూపుము/దాచుము
tr: blokları göster/gizle
ur: بلاکس دکھائیں / چھپائیں
zh_cn: 顯示/隱藏區塊

source: Expand/collapse blocks
es: Expandir / Contraer bloques
fr: Développer/réduire les blocs
hi: ब्लॉक विस्तार करें/संकुचित करें
ja: ブロックを広げる/折りたたむ
mr: ब्लॉकों को विस्तारित/संक्षिप्त करें
pt: Expandir/recolher blocos
te: బ్లాక్‌లను విస్తరించు/కుడిచిపోయేందుకు
tr: blokları genişletme/daraltma
ur: / کولے جانے والے بلاکس کو بڑھاو /
zh_cn: 展开/折叠模块

source: Decrease block size
es: Disminuir el tamaño de los bloques
fr: Réduire la taille des blocs
hi: ब्लॊक का आकार घटाएं
ja: ブロックの表示を小さくする
mr: ब्लॉक का आकार घटाएं
pt: Diminuir o tamanho do bloco
te: బ్లాక్‌ల పరిమాణాన్ని తగ్గించండి
tr: blok boyutunu azalt
ur: بلاک سائز کو کم کریں
zh_cn: 减小模块大小

source: Increase block size
es: Incrementar tamaño de bloques
fr: Augmenter la taille des blocs
hi: ब्लॊक का आकार बढ़ाएं
ja: ブロックの表示を大きくする
mr: ब्लॉक का आकार बढ़ाएं
pt: Aumentar o tamanho do bloco
te: బ్లాక్‌ల పరిమాణాన్ని పెంచుకోండి
tr: blok boyutunu artır
ur: بلاک سائز میں اضافہ کریں
zh_cn: 增加模块大小

source: Could not parse JSON input.
es: No se pudo analizar la entrada de JSON.
fr: Impossible d'analyser l'entrée JSON.
hi: JSON इनपुट को पार्स नहीं कर सका।
ja: JSONのインプットのパースができません。
mr: JSON इनपुट को पार्स नहीं कर सका।
pt: Não foi possível analisar a entrada JSON.
te: JSON ఇన్‌పుట్‌ను విశ్లేషించలేకపోయింది.
tr: json girdisini ayrıştıramadı
ur: JSON ان پٹ کو پارس نہیں کرسکا۔
zh_cn: 无法解析 JSON 输入

source: Select is enabled.
es: Seleccionar está habilitado.
fr: La sélection est activée.
mr: चयन सक्षम है।
tr: select etkinleştirildi
ur: منتخب فعال ہے۔
zh_cn: 选择已启用

source: Select is disabled.
es: Seleccionar está deshabilitado.
fr: La sélection est désactivée.
mr: चयन अक्षम है।
tr: seçme devre dışı bırakıldı
ur: منتخب غیر فعال ہے۔
zh_cn: 选择已禁用
