Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Hertz block (in combination with a Number block) will play a sound at the specified frequency.
es: El bloque Hertz (en combinación con un bloque numérico) reproducirá un sonido a la frecuencia especificada.
fr: Le bloc Hertz (en combinaison avec un bloc Nombre) jouera un son à la fréquence spécifiée.
hi: हर्ट्ज ब्लॉक (नंबर ब्लॉक के साथ मेल करके) निर्दिष्ट ताक़त पर ध्वनि बजाएगा।
ja: <h2>ヘルツブロック</h2><br>音の高さをヘルツ（周波数の単位）でせっていする。「すうちブロック」を組み合わせて使う。<br><br>★ヘルツとは<br>音の高さを表す周波数。<br>★周波数とは<br>音が１秒間に何回しんどうするかを表すすうち。周波数が高い（すうちが大きい）ほど、音が高くなる。<br><br>
mr: हर्ट्झ ब्लॉक (नंबर ब्लॉकसह) निर्दिष्ट वारंवारतेवर ध्वनी वाजवेल.
pt: O bloco Hertz (em combinação com um bloco Número) reproduzirá um som na freqüência especificada.
te: హెర్ట్జ్ బ్లాక్ (నంబర్ బ్లాక్ తో కలిసి) ప్రత్యామ్నాయం చేస్తుంది చేయడానికి అనుమతిస్తుంది.
tr: hertz bloğu (bir sayı bloğu ile birlikte) belirtilen frekansta bir ses çalacaktır
ur: ہرٹز بلاک (نمبر بلاک کے ساتھ مل کر) مخصوص فریکوئنسی پر آواز چلائے گا۔
zh_cn: 赫兹块（与数字块结合使用）将在指定频率播放声音。

source: The Pitch Number block will play a pitch associated by its number, e.g. 0 for C and 7 for G.
es: El bloque de número de tono reproducirá un tono asociado por su número, p. 0 para C y 7 para G.
fr: Le bloc Numéro de hauteur jouera une hauteur associée par son numéro, par exemple 0 pour C et 7 pour G.
hi: पिच नंबर ब्लॉक उसकी संख्या से जुड़े एक पिच को बजाएगा, उदाहरण के लिए सी के लिए 0 और जी के लिए 7।
mr: पिच नंबर ब्लॉक त्याच्या नंबरशी संबंधित पिच वाजवेल, उदा. C साठी 0 आणि G साठी 7.
te: పిచ్ నంబర్ బ్లాక్ ఒక సంఖ్య ద్వారా అనుసంధానించబడిన ఒక పిచ్‌ను ప్రదర్శించడానికి, ఉదాహరణకు C కోసం 0 మరియు G కోసం 7 ఉంటుంది.
tr: perde numarası bloğu
ur: پچ نمبر بلاک اپنے نمبر سے منسلک ایک پچ کھیلے گا، جیسے C کے لیے 0 اور G کے لیے 7۔
zh_cn: 音高编号块将播放与其数字对应的音高，例如0代表C，7代表G。

source: nth modal pitch
es: nth tono modal
fr: nième hauteur modale
hi: एनथ मोडल पिच
ja: ピッチ度
mr: एनथ मोडल पिच
te: మోడల్ పిచ్ యొక్క సంఖ్యాత్మక మ్యాపింగ్
tr: n'inci modal perde
ur: نویں موڈل پچ
zh_cn: 第n阶音高

source: nth Modal Pitch takes the pattern of pitches in semitones for a mode and makes each point a degree of the mode,
es: Nth Modal Pitch toma el patrón de tonos en semitonos para un modo y hace que cada punto sea un grado del modo,
fr: La nième hauteur modale prend le motif des hauteurs en demi-tons pour un mode et fait de chaque point un degré du mode,
mr: एनथ मोडल पिच मोडसाठी सेमीटोनमध्ये पिचेसचा नमुना घेतो आणि प्रत्येक बिंदू मोडची डिग्री बनवतो,
tr: n'inci modal perde
ur: nth Modal Pitch ایک موڈ کے لیے سیمیٹونز میں پچز کا پیٹرن لیتی ہے اور ہر پوائنٹ کو موڈ کی ڈگری بناتی ہے،
zh_cn: 第n阶调式音高采用模式中以半音为单位的音高模式，并将每个点视为该模式的一个阶。

source: starting from 1 and regardless of tonal framework (i.e. not always 8 notes in the octave)
es: comenzando desde 1 e independientemente del marco tonal (es decir, no siempre 8 notas en la octava)
fr: en commençant par 1 et indépendamment du cadre tonal (c'est-à-dire pas toujours 8 notes dans l'octave)
hi: 1 से शुरू होकर और स्वर संरचना की परवाह किए बिना (अर्थात हमेशा ऑक्टेव में 8 नोट्स नहीं होतीं)
mr: 1 पासून सुरू होत आहे आणि टोनल फ्रेमवर्कच्या बाबतीत काहीही नाही (म्हणजे ऑक्टेव्हमध्ये नेहमी 8 नोट्स नसतात)
te: 1 ను నుంచి మరియు టోనల్ ఫ్రేమ్వర్క్ కొరకు (అందుకే సదాగా ఒక్కసారైనా 8 నోట్లు కాదు) అనేకమందికి విషయం లేదు.
tr: den başlayarak ve tonal çerçeveden bağımsız olarak (yani her zaman oktavda 8 nota değil) (Bağlam: 1
ur: 1 سے شروع ہو رہا ہے اور ٹونل فریم ورک سے قطع نظر (یعنی آکٹیو میں ہمیشہ 8 نوٹ نہیں)
zh_cn: 从1开始，不考虑音调框架（即不总是八度内有8个音符）

source: Nth Modal Pitch takes a number as an input as the nth degree for the given mode. 0 is the first position, 1 is the second, -1 is the note before the first etc.
es: Nth modal tono un número como entrada como el nth grado para el modo dado. 0 es la primera posición, 1 es la segunda, -1 es la nota anterior a la primera, etc.
fr: La nième hauteur modale prend un nombre comme entrée en tant que nième degré pour le mode donné. 0 est la première position, 1 est la seconde, -1 est la note avant la première, etc.
mr: एनथ मोडल पिच दिलेल्या मोडसाठी एनथ डिग्री म्हणून इनपुट म्हणून एक संख्या घेतो. 0 हे पहिले स्थान आहे, 1 हे दुसरे आहे, -1 हे पहिल्या आधीचे नोट इत्यादी.
ur: Nth Modal Pitch دیئے گئے موڈ کے لیے nth ڈگری کے طور پر ایک نمبر کو بطور ان پٹ لیتی ہے۔ 0 پہلی پوزیشن ہے، 1 دوسری ہے، -1 پہلے سے پہلے کا نوٹ ہے وغیرہ۔
zh_cn: 第n阶调式音高以数字作为输入，表示给定模式的第n个阶。0表示第一个位置，1表示第二个，-1表示第一个之前的音符，依此类推。

source: The pitches change according to the mode specified without any need for respellings.
es: Los tonos cambian según el modo especificado sin necesidad de grafías.
fr: Les hauteurs changent selon le mode spécifié sans aucun besoin de réécriture.
hi: नोट्स दुबारा लिखने की आवश्यकता के बिना जिस प्रकार के मोड ने निर्दिष्ट किया है, उसके अनुसार बदल जाते हैं।
mr: निर्दिष्ट मोडनुसार पिचेस बदलतात आणि पुनर्लेखनाची गरज नाही.
te: పిచ్లు పునర్వ్యాఖ్యానం కోరకు స్పష్టంగా మారిపోతాయి.
tr: perdeler
ur: پچز مخصوص موڈ کے مطابق بدلتی ہیں بغیر کسی ری اسپیلنگ کی ضرورت کے۔
zh_cn: 音高根据指定的调式变化，无需重新拼写。

source: Scale Degree is a common convention in music. Scale Degree offers seven possible positions in the scale (1-7) and can be modified via accidentals.
es: El grado de escala es una convención común en la música. El grado de ecala ofrece siete posiciones posibles en la escala (1-7) y puede modificarse mediante alteraciones.
fr: Le degré de l'échelle est une convention courante en musique. Le degré de l'échelle offre sept positions possibles dans l'échelle (1-7) et peut être modifié via des altérations.
hi: स्केल डिग्री संगीत में एक सामान्य सम्मिलन है। स्केल डिग्री स्केल में सात संभावित स्थान (1-7) प्रदान करती है और एक्सीडेंटल्स के माध्यम से संशोधित की जा सकती है।
mr: स्केल डिग्री संगीतामध्ये एक सामान्य पद्धत आहे. स्केल डिग्री स्केलमध्ये सात संभाव्य स्थान (1-7) ऑफर करते आणि अॅक्सिडेंटल्सद्वारे सुधारित केली जाऊ शकते.
te: స్కేల్ డిగ్రీ సంగీతంలో సామాన్యంగా ఒక అభ్యంతరము. స్కేల్ డిగ్రీ స్కేల్ లో ఏడు సాధ్యమైన స్థానాలను నిల్వ చేస్తుంది (1-7) మరియు అక్షరాల ద్వారా మార్పుల ద్వారా సవరించగలది.
ur: اسکیل ڈگری موسیقی میں ایک عام کنونشن ہے۔ اسکیل ڈگری اسکیل (1-7) میں سات ممکنہ پوزیشنیں پیش کرتی ہے اور حادثاتی طور پر اس میں ترمیم کی جاسکتی ہے۔
zh_cn: 音阶度数是音乐中的常用约定。音阶度数提供音阶中的七个可能位置（1-7），并可通过临时升降记号进行修改。

source: Scale Degree 1 is always the first pitch in a given scale, regardless of octave.
es: El grado de la escala de 1 es siempre el primer tono de una escala determinada, independientemente de la octava.
fr: Le degré de l'échelle 1 est toujours la première hauteur dans une échelle donnée, quelle que soit l'octave.
hi: स्केल डिग्री 1 हमेशा एक दिए गए स्केल में पहला पिच है, ऑक्टेव की परवाह किए बिना।
mr: स्केल डिग्री 1 नेहमी दिलेल्या स्केलमधील पहिले पिच असते, ऑक्टेव्हच्या बाबतीत काहीही नाही.
te: స్కేల్ డిగ్రీ 1 సదాగా ఒక ఇచ్చిన స్కేల్ లో మొదటి పిచ్ గా, ఆక్టేవ
tr: Skala derecesi 1
ur: سکیل ڈگری 1 ہمیشہ دیے گئے پیمانے میں پہلی پچ ہوتی ہے، قطع نظر آکٹیو۔
zh_cn: 音阶度数1始终是给定音阶中的第一个音高，不论其所在的八度。

source: scalar step
es: paso escalar
fr: pas scalaire
hi: स्केलर स्टेप
ja: 音階内を上る／下りる
mr: स्केलर स्टेप
pt: passo escalar
te: స్కాలర్ స్టెప్
tr: skaler adım
ur: اسکیلر قدم
zh_cn: 音阶步长

source: The Scalar Step block (in combination with a Number block) will play the next pitch in a scale,
es: El bloque Paso escalar (en combinación con un bloque numérico) reproducirá el siguiente tono en una escala,
fr: Le bloc Pas scalaire (en combinaison avec un bloc Nombre) jouera la prochaine hauteur dans une échelle,
hi: स्केलर स्टेप ब्लॉक (नंबर ब्लॉक के साथ मेल करके) स्केल में अगला पिच बजाएगा,
ja: <h2>音階内を上る／下りるブロック</h2><br>音階内を順番に（ある一定のかんかくで）上りながら、または下りながら音をえんそうする。すうちをせっていすることで、次の音は前の音といくつちがうかが決まる。<br>たとえば、すうちを１にせっていした場合、ソの次にはラ（ソの１音上）、ファの次にはソ（ファの１音上）がえんそうされる。<br><br>★音階とは<br>順番に並んだ音のまとまり。
mr: स्केलर स्टेप ब्लॉक (नंबर ब्लॉकसह) स्केलमधील पुढील पिच वाजवेल,
pt: O bloco Passo Escalar (em combinação com um bloco Número) reproduzirá o próximo tom em uma escala,
te: స్కాల్లో తర్వాత పిచ్ ప్రదర్శించడానికి, స్కాలర్ స్టెప్ బ్లాక్ (నంబర్ బ్లాక్ తో కలిసి) ఉపయోగించబడుతుంది,
tr: skaler adım bloğu (bir sayı bloğu ile birlikte) bir skaladaki bir sonraki perdeyi çalacaktır
ur: اسکیلر اسٹیپ بلاک (نمبر بلاک کے ساتھ) اگلی پچ کو اسکیل میں کھیلے گا،
zh_cn: 音阶步长块（与数字块结合使用）将播放音阶中的下一个音高，

source: eg if the last note played was sol, Scalar Step 1 will play la.
es: por ejemplo, si la última nota tocada fue sol, el paso escalar 1 tocará la.
fr: par exemple si la dernière note jouée était sol, Pas scalaire 1 jouera la.
hi: उदाहरण के लिए अगर आखिरी बजाए गए नोट सोल
ja: <br><br>たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。<br>
mr: उदा. जर शेवटची वाजवलेली नोट सोल होती, तर स्केलर स्टेप 1 ला वाजवेल.
pt: Por exemplo, se a última nota tocada for sol, o Passo Escalar 1 tocará la.
te: ఉదాహరణకు, చివరి ప్రదర్శించిన నోట్ సోల్ ఉండిగా, స్కాలర్ స్టెప్ 1 కు లా ప్రదర్శించబడుతుంది.
tr: örneğin çalınan son nota sol ise
ur: مثال کے طور پر اگر آخری نوٹ sol تھا، تو اسکیلر مرحلہ 1 لا کھیلے گا۔
zh_cn: 例如，如果上一个播放的音符是sol，音阶步长1将播放la。

source: The Pitch block specifies the pitch name and octave of a note that together determine the frequency of the note.
fr: Le bloc Hauteur spécifie le nom de la hauteur et l'octave d'une note qui déterminent ensemble la fréquence de la note.
ja: <h2>音の高さブロック</h2><br>音の高さをせっていする。名前とオクターヴの高さを決めて使う。音の周波数も同時に決まる。<br><br>★周波数とは<br>音が１秒間に何回しんどうするかを表すすうち。周波数が高い（すうちが大きい）ほど、音が高くなる。<br>★オクターヴの高さとは<br>同じ名前でも高さがちがう音を表すすうち。<br><br>
mr: पिच ब्लॉक नोटचे पिच नाव आणि ऑक्टेव्ह निर्दिष्ट करतो जे एकत्रितपणे नोटची वारंवारता ठरवतात.
pt: O bloco Tom especifica o nome do tom e a oitava de uma nota que juntos determinam a frequência da nota.
te: పిచ్ బ్లాక్ నోట్ యొక్క ఫ్రిక్వెన్సీని నిర్ధారించడానికి ఒక నోట్ యొక్క పిచ్ పేరు మరియు ఆక్టేవ్ ను నిర్దిష్టించేది.
tr: perde bloğu
ur: پچ بلاک ایک نوٹ کے پچ کا نام اور آکٹیو کی وضاحت کرتا ہے جو مل کر نوٹ کی فریکوئنسی کا تعین کرتے ہیں۔
zh_cn: 音高块指定一个音符的音名和八度，这两者共同决定该音符的频率。

source: Oscillator
es: Oscilador
fr: Oscillateur
hi: ऑस्सिलेटर
ja: オシレータ―
mr: ऑस्सिलेटर
pt: Oscilador
te: ఆస్కిలేటర్
tr: Osilatör
ur: آسکیلیٹر
zh_cn: 振荡器

source: type
es: typo
hi: प्रकार
ja: 種類
mr: प्रकार
pt: tipo
te: రకము
tr: tip
ur: قسم
zh_cn: 类型

source: partials
es: parciales
fr: partiels
hi: अंश
ja: 倍音
mr: आंशिक
pt: parciais
te: పార్షల్స్
tr: partialler
ur: جزوی
zh_cn: 部分谐波

source: You are adding multiple oscillator blocks.
es: Está agregando varios bloques de oscilador.
fr: Vous ajoutez plusieurs blocs d'oscillateur.
hi: आप कई ऑस्किलेटर ब्लॉक जोड़ रहे हैं।
ja: 複数のオシレーターブロックを追加しています。
mr: आपण एकाधिक ऑस्सिलेटर ब्लॉक्स जोडत आहात.
pt: Você está adicionando vários blocos do oscilador.
te: మీరు అనేక ఆసిలేటర్ బ్లాక్లను జోడిస్తున్నారు.
tr: birden fazla osilatör bloğu ekliyorsunuz
ur: آپ متعدد آسکیلیٹر بلاکس شامل کر رہے ہیں۔
zh_cn: 您正在添加多个振荡器块。

source: duo synth
es: duo sintetizador
fr: synthé duo
hi: ड्यूओ सिंथ
ja: シーケンサー込みシンセ
mr: डुओ सिंथ
pt: duo sintetizador
te: డ్యూవో సింథ్
ur: جوڑی synth

source: The Duo synth block is a duo-frequency modulator used to define a timbre.
es: El bloque Sintetizador Duo es un modulador de frecuencia doble usado para definir un timbre.
fr: Le bloc Synthé duo est un modulateur de fréquence duo utilisé pour définir un timbre.
hi: ड्यूओ सिंथ ब्लॉक एक ड्यूओ-फ़्रीक्वेंसी मॉड्युलेटर है जिसे एक टिम्बर को परिभाषित करने के लिए उपयोग किया जाता है।
mr: डुओ सिंथ ब्लॉक एक डुओ-फ्रीक्वेंसी मॉड्युलेटर आहे जो टिंबर परिभाषित करण्यासाठी वापरला जातो.
pt: O bloco sintetizador Duo é um modulador de frequência dupla usado para definir um timbre.
te: డ్యూవో సింథ్ బ్లాక్ ఒక డ్యూవో-ఫ్రిక్వెన్సీ మాడ్యులేటర్, ఒక టింబర్ ని వ్యాఖ్యానిస్తుంది.
ur: ڈوو سنتھ بلاک ایک جوڑی فریکوئنسی ماڈیولیٹر ہے جو ٹمبر کی وضاحت کے لیے استعمال ہوتا ہے۔
zh_cn: Duo synth块是一个双频率调制器，用于定义音色。

source: vibrato rate
es: velocidad del vibrato
fr: taux de vibrato
hi: विब्रेटो दर
ja: ビブラートエフェクタのレート
mr: वायब्रेटो दर
pt: taxa de vibrato
te: విబ్రాటో వేగం
tr: vibrato oranı
ur: کمپن کی شرح
zh_cn: 颤音速率

source: vibrato intensity
es: intensidad de vibrato
fr: intensité du vibrato
hi: विब्रेटो तीव्रता
ja: ビブラートエフェクタの強度
mr: वायब्रेटो तीव्रता
pt: intensidade de vibrato
te: విబ్రాటో కఠినత
tr: vibrato yoğunluğu
ur: کمپن کی شدت
zh_cn: 颤音强度

source: The AM synth block is an amplitude modulator used to define a timbre.
es: El bloque Sintetizador AM es un modulador de amplitud usado para definir un timbre.
fr: Le bloc Synthé AM est un modulateur d'amplitude utilisé pour définir un timbre.
hi: ए.एम. सिंथ ब्लॉक एक एम्प्लीट्यूड मॉड्युलेटर है जिसे एक टिम्बर को परिभाषित करने के लिए उपयोग किया जाता है।
mr: एएम सिंथ ब्लॉक एक अँप्लिट्यूड मॉड्युलेटर आहे जो टिंबर परिभाषित करण्यासाठी वापरला जातो.
pt: O bloco sintetizador AM é um modulador de amplitude usado para definir um timbre.
te: AM సింథ్ బ్లాక్ ఒక ఏమ్ప్లిట్యూడ్ మాడ్యులేటర్, ఒక టింబర్ ని వ్యాఖ్యానిస్తుంది.
tr: am synth bloğu
ur: اے ایم سنتھ بلاک ایک طول و عرض ماڈیولیٹر ہے جو ٹمبر کی وضاحت کے لئے استعمال ہوتا ہے۔
zh_cn: AM 合成器块是用于定义音色的振幅调制器。

source: FM synth
es: FM sintetizador
fr: synthé FM
hi: एफ.एम. सिंथ
ja: FM シンセ
mr: एफएम सिंथ
pt: sintetizador FM
te: FM సింథ్
ur: ایف ایم سنتھ
zh_cn: FM 合成器

source: The FM synth block is a frequency modulator used to define a timbre.
es: El bloque Sintetizador de FM es un modulador de frecuencia utilizado para definir un timbre.
fr: Le bloc Synthé FM est un modulateur de fréquence utilisé pour définir un timbre.
hi: एफ.एम. सिंथ ब्लॉक एक फ़्रीक्वेंसी मॉड्युलेटर है जिसे एक टिम्बर को परिभाषित करने के लिए उपयोग किया जाता है।
mr: एफएम सिंथ ब्लॉक एक फ्रीक्वेंसी मॉड्युलेटर आहे जो टिंबर परिभाषित करण्यासाठी वापरला जातो.
pt: O bloco sintetizador FM é um modulador de frequência usado para definir um timbre.
te: FM సింథ్ బ్లాక్ ఒక ఫ్రిక్వెన్సీ మాడ్యులేటర్, ఒక టింబర్ ని వ్యాఖ్యానిస్తుంది.
tr: fm synth bloğu bir tını tanımlamak için kullanılan bir frekans modülatörüdür
ur: ایف ایم سنتھ بلاک ایک فریکوئنسی ماڈیولیٹر ہے جو ٹمبر کی وضاحت کے لیے استعمال ہوتا ہے۔
zh_cn: FM 合成器块是用于定义音色的频率调制器。

source: partial
es: parcial
fr: partiel
hi: आंशिक
ja: 倍音
mr: आंशिक
pt: parcial
te: పార్షల్
tr: kısmi
ur: جزوی
zh_cn: 部分

source: The Partial block is used to specify a weight for a specific partial harmonic.
es: El bloque Parcial se utiliza para especificar un peso para un armónico parcial específico.
fr: Le bloc Partiel est utilisé pour spécifier un poids pour un harmonique partiel spécifique.
mr: आंशिक ब्लॉक विशिष्ट आंशिक हार्मोनिकसाठी वजन निर्दिष्ट करण्यासाठी वापरला जातो.
te: పార్షల్ బ్లాక్ ఒక నిర్దిష్ట పార్షల్ హార్మోనిక్కు ఒక బరువును నిర్ధిష్టించడానికి ఉపయోగిస్తుంది.
tr: kısmi blok
ur: جزوی بلاک کا استعمال ایک مخصوص جزوی ہارمونک کے لیے وزن کی وضاحت کے لیے کیا جاتا ہے۔
zh_cn: Partial块用于指定特定部分泛音的权重。

source: Partial weight must be between 0 and 1.
es: El peso parcial debe estar entre 0 y 1.
fr: Le poids partiel doit être compris entre 0 et 1.
hi: पार्शियल वजन 0 और 1 के बीच होना चाहिए।
ja: 倍音のウェートは０と１の間である必要があります。
mr: आंशिक वजन 0 आणि 1 दरम्यान असले पाहिजे.
pt: O peso Parcial deve estar entre 0 e 1.
te: పార్షల్ బరువు 0 నుండి 1 మధ్యలో ఉండాలి.
tr: kısmi ağırlık 0 ile 1 arasında olmalıdır
ur: جزوی وزن 0 اور 1 کے درمیان ہونا چاہیے۔
zh_cn: 部分权重必须在0到1之间。

source: Partial block should be used inside of a Weighted-partials block.
es: El bloque Parcial debe usarse dentro de un bloque de parciales ponderados.
fr: Le bloc Partiel doit être utilisé à l'intérieur d'un bloc Partiels pondérés.
hi: पार्शियल ब्लॉक को एक वेटेड-पार्शियल्स ब्लॉक के अंदर उपयोग किया जाना चाहिए।
ja: 倍音ブロックが「倍音ウェートブロック」の中にある必要があります。
mr: आंशिक ब्लॉक वेटेड-आंशिक ब्लॉकच्या आत वापरला पाहिजे.
pt: Bloco Parcial deve ser usado dentro de um bloco parcial Ponderado.
te: పార్షల్ బ్లాక్ ఒక బరువును నిర్ధిష్టించడానికి పైన Weighted-partials బ్లాక్ లో ఉపయోగించాలి.
ur: جزوی بلاک کو وزنی جزوی بلاک کے اندر استعمال کیا جانا چاہئے۔
zh_cn: Partial块应在加权部分块内使用。

source: weighted partials
es: parcial ponderada
fr: partiels pondérés
hi: वेटेड पार्शियल्स
ja: ウェート倍音
mr: वेटेड आंशिक
pt: parciais ponderadas
te: వేటెడ్ పార్షల్స్
tr: ağırlıklı kısmi türevler
ur: وزنی حصے
zh_cn: 加权泛音

source: The Harmonic block will add harmonics to the contained notes.
es: El bloque Armónicos agregará armónicos a las notas contenidas.
fr: Le bloc Harmonique ajoutera des harmoniques aux notes contenues.
hi: हारमोनिक ब्लॉक नोट्स में हारमोनिक जोड़ेगा।
mr: हार्मोनिक ब्लॉक समाविष्ट नोट्समध्ये हार्मोनिक्स जोडेल.
pt: O bloco Harmônico adicionará harmônicos às notas contidas.
te: హార్మోనిక్ బ్లాక్ అంగీకరించిన నోట్లకు హార్మోనిక్స్ ను జోడిస్తుంది.
tr: harmonik blok içerdiği notalara harmonikler ekleyecektir
ur: ہارمونک بلاک موجود نوٹوں میں ہارمونکس کا اضافہ کرے گا۔
zh_cn: Harmonic块将为包含的音符添加泛音。

source: harmonic
es: armónico
fr: harmonique
hi: हारमोनिक
ja: ハーモニックス
mr: हार्मोनिक
pt: harmônico
te: హార్మోనిక్
tr: armonik
ur: ہارمونک
zh_cn: 谐波

source: The Distortion block adds distortion to the pitch.
es: El bloque Distorsión agrega distorsión al tono.
fr: Le bloc Distorsion ajoute de la distorsion à la hauteur.
hi: डिस्टोर्शन ब्लॉक ध्वनि में विकृति जोड़ता है।
mr: डिस्टॉर्शन ब्लॉक पिचला डिस्टॉर्शन जोडतो.
pt: O bloco Distorção adiciona distorção ao tom.
te: డిస్టోర్షన్ బ్లాక్ పిచ్ కి డిస్టోర్షన్ ను జోడిస్తుంది.
tr: distorsiyon bloğu perdeye distorsiyon ekler
ur: ڈسٹورشن بلاک پچ میں مسخ کا اضافہ کرتا ہے۔
zh_cn: Distortion块为音高添加失真效果。

source: distortion
es: distorsión
fr: distorsion
hi: विकृति
ja: ディストーション
mr: डिस्टॉर्शन
pt: distorção
te: డిస్టోర్షన్
tr: distorsiyon
ur: تحریف
zh_cn: 失真

source: The Tremolo block adds a wavering effect.
es: El bloque Tremolo añade un efecto de vacilación.
fr: Le bloc Tremolo ajoute un effet de tremblement.
hi: ट्रेमोलो ब्लॉक एक हिलने के प्रभाव को जोड़ता है।
ja: <h2>トレモロブロック</h2><br>ゆれるような音のひびきにする。はやさで、ゆれのはやさを調節できる。<br>
mr: ट्रेमोलो ब्लॉक एक लहरी प्रभाव जोडतो.
pt: O bloco Tremolo adiciona um efeito de onda.
te: ట్రెమోలో బ్లాక్ ఒక పలకింపు ప్రభావాన్ని జోడిస్తుంది.
tr: tremolo bloğu bir dalgalanma efekti ekler
ur: Tremolo بلاک ایک متزلزل اثر کا اضافہ کرتا ہے۔
zh_cn: Tremolo块添加颤音效果。

source: rate
es: velocidad
fr: taux
hi: दर
ja: はやさ
mr: दर
pt: taxa
te: వేగం
tr: hız
ur: شرح
zh_cn: 速率

source: depth
es: intensidad
fr: profondeur
hi: गहराई
ja: 大きさ
mr: गहराई
pt: profundidade
te: గాంభీర్యం
tr: derinlik
ur: گہرائی
zh_cn: 深度

source: The Phaser block adds a sweeping sound.
es: El bloque Phaser añade un sonido de barrido.
fr: Le bloc Phaser ajoute un son de balayage.
hi: फेजर ब्लॉक एक स्वीपिंग साउंड जोड़ता है।
mr: फेजर ब्लॉक एक झाडलोट आवाज जोडतो.
pt: O bloco Phaser adiciona um som de varredura.
te: ఫేసర్ బ్లాక్ ఒక స్వీపింగ్ ధ్వనిని జోడిస్తుంది.
tr: fazer bloğu süpürme sesi ekler
ur: فیزر بلاک ایک تیز آواز کا اضافہ کرتا ہے۔
zh_cn: Phaser块添加扫频效果。

source: phaser
hi: फेजर
ja: フェーザー
mr: फेजर
te: ఫేసర్
tr: fazer
ur: فیزر
zh_cn: 移相器

source: octaves
es: octavas
hi: ऑक्टेव्स
ja: オクターヴ
mr: ऑक्टेव्ह
pt: oitavas
te: ఆక్టవ్స్
tr: oktav
ur: آکٹیو
zh_cn: 八度

source: base frequency
es: frecuencia de base
fr: fréquence de base
hi: मौलिक तड़ंत
ja: 基本周波数
mr: बेस वारंवारता
pt: frequência base
te: బేస్ ఫ్రిక్వెన్సీ
tr: baz frekansı
ur: بنیادی تعدد
zh_cn: 基频

source: The Chorus block adds a chorus effect.
es: El bloque Chorus añade un efecto chorus.
fr: Le bloc Chorus ajoute un effet de chœur.
hi: कोरस ब्लॉक कोरस प्रभाव जोड़ता है।
ja: <h2>コーラスブロック</h2><br>広がりのある音のひびきにする。はやさとずれで、ひびきが残る感じを調節できる。<br>
mr: कोरस ब्लॉक एक कोरस प्रभाव जोडतो.
pt: O bloco Coro adiciona um efeito de coro.
te: ఛోరస్ బ్లాక్ ఒక ఛోరస్ ప్రభావాన్ని జోడిస్తుంది.
tr: koro bloğu bir koro efekti ekler
ur: کورس بلاک ایک کورس اثر کا اضافہ کرتا ہے۔
zh_cn: Chorus块添加合唱效果。

source: chorus
es: coro
fr: chœur
hi: कोरस
ja: コーラス
mr: कोरस
pt: refrão
te: ఛోరస్
tr: koro
ur: کورس
zh_cn: 合唱

source: delay (MS)
es: retraso (MS)
fr: délai (MS)
hi: देरी (मि.से.)
ja: ディレイ・エフェクター（ms）
mr: विलंब (MS)
pt: atraso (MS)
te: దిగుమతి (MS)
tr: gecikme (ms) (Bağlam
ur: تاخیر (MS)
zh_cn: 延迟（毫秒）

source: The Vibrato block adds a rapid, slight variation in pitch.
es: El bloque Vibrato agrega una variación rápida y leve en el tono.
fr: Le bloc Vibrato ajoute une variation rapide et légère de la hauteur.
hi: विब्रेटो ब्लॉक ध्वनि में तेज, स्लाइट वेरिएशन जोड़ता है।
ja: <h2>ビブラートブロック</h2><br>音の高さに小きざみな変化をつける。
mr: वायब्रेटो ब्लॉक पिचमध्ये एक जलद, लहान फरक जोडतो.
pt: O bloco Vibrato adiciona uma variação rápida e ligeira no tom.
te: విబ్రాటో బ్లాక్ ఒక శీఘ్ర, స్లైట్ పరివర్తనాన్ని పిచ్చిలో జోడిస్తుంది.
tr: vibrato bloğu perdede hızlı ve hafif bir değişim sağlar
ur: وائبراٹو بلاک پچ میں تیز، معمولی تبدیلی کا اضافہ کرتا ہے۔
zh_cn: Vibrato块添加快速且轻微的音高变化。

source: vibrato
hi: विब्रेटो
ja: ビブラート
mr: वायब्रेटो
te: విబ్రాటో
ur: وائبراٹو
zh_cn: 颤音

source: intensity
es: intensidad
fr: intensité
hi: तीव्रता
ja: 大きさ
mr: तीव्रता
pt: intensidade
te: ప్రాధికూత్య
tr: yoğunluk
ur: شدت
zh_cn: 强度

source: set synth
es: fijar synth
fr: définir le synthé
hi: सिंथ सेट करें
ja: シンセを設定
mr: सिंथ सेट करा
pt: difinir sintetizador
te: సింథెసైజర్ను ఎంచుకో
tr: synth ayarla
ur: سیٹ synth
zh_cn: 设置合成器

source: synth name
es: nombre del sintetizador
fr: nom du synthé
hi: सिंथ का नाम
ja: シンセの名前
mr: सिंथ नाव
pt: nome do sintetizador
te: సింథెసైజర్ పేరు
tr: synth adı
ur: synth نام
zh_cn: 合成器名称

source: set default instrument
es: fijar instrumento predeterminado
fr: définir l'instrument par défaut
hi: डिफ़ॉल्ट इंस्ट्रुमेंट सेट करें
ja: 音色標準を設定
mr: डिफॉल्ट वाद्य सेट करा
te: డిఫాల్ట్ వాద్యంను సెట్ చేయండి
tr: varsayılan enstrümanı ayarla
ur: پہلے سے طے شدہ آلہ مقرر کریں
zh_cn: 设置默认乐器

source: set instrument
es: fijar instrumento
fr: définir l'instrument
hi: इंस्ट्रुमेंट सेट करें
ja: 音色をせってい
mr: वाद्य सेट करा
te: అనుకూల వాద్యంను సెట్ చేయండి
tr: enstrümanı ayarla
ur: آلہ مقرر کریں
zh_cn: 设置乐器

source: The Set instrument block selects a voice for the synthesizer,
es: El bloque Fijar Instrumentos selecciona una voz para el sintetizador,
fr: Le bloc Définir l'instrument sélectionne une voix pour le synthétiseur,
hi: सेट इंस्ट्रुमेंट ब्लॉक सिंथ के लिए एक आवाज चुनता है,
ja: <h2>音色をせっていブロック</h2><br>中に入っている「音符（おんぷ）ブロック」の音色を設定する。音色は、ギターやピアノなどの中から選ぶことができる。<br><br>
mr: सेट वाद्य ब्लॉक सिंथेसायझरसाठी एक आवाज निवडतो,
te: సెట్ ఇన్స్ట్రమెంట్ బ్లాక్ సింథెసైజర్ కు ఒక ధ్వనిని ఎంచుకోనుండి,
tr: set instrument bloğu synthesizer için bir ses seçer
ur: سیٹ انسٹرومنٹ بلاک سنتھیسائزر کے لیے آواز کا انتخاب کرتا ہے،
zh_cn: Set instrument块用于选择合成器的声音，

source: eg guitar piano violin or cello.
es: Por ejemplo, guitarra, piano, violín o cello
fr: par exemple guitare, piano, violon ou violoncelle.
hi: जैसे गिटार पियानो वायलिन या चेलो।
ja: （例えば、ギター、ピアノ、バイオリン、チェロなど）。
mr: उदा. गिटार पियानो व्हायोलिन किंवा सेलो.
pt: por exemplo guitarra piano violino ou violoncelo.
te: ఉదాహరణగా, గిటార్, పియానో, వాయలిన్ లేదా సెల్లో.
tr: örn
ur: مثال کے طور پر گٹار پیانو وائلن یا سیلو۔
zh_cn: 例如吉他、钢琴、小提琴或大提琴。

source: Import a sound file to use as an instrument and set its pitch center.
es: Importe un archivo de sonido para usarlo como instrumento y establezca su centro de tono.
fr: Importer un fichier audio à utiliser comme instrument et définir son centre de hauteur.
hi: एक इंस्ट्रुमेंट के रूप में उपयोग के लिए एक साउंड फ़ाइल आयात करें और इसके पिच केंद्र सेट करें।
ja: 音色サンプルをアップロードして、音の高さを合わせる
mr: वाद्य म्हणून वापरण्यासाठी ध्वनी फाइल आयात करा आणि त्याचे पिच केंद्र सेट करा.
te: వాద్యానికి ఉపయోగించడానికి ఒక ధ్వని ఫైల్ను దిగుమతి చేసి అదికి చేయడానికి.
tr: Enstrüman olarak kullanmak için bir ses dosyasını içe aktarın ve perde merkezini ayarlayın
ur: ایک آلے کے طور پر استعمال کرنے کے لیے ایک ساؤنڈ فائل درآمد کریں اور اس کا پچ سینٹر سیٹ کریں۔
zh_cn: 导入音频文件作为乐器并设置其音高中心。

source: Upload a sound file to connect with the sample block.
es: Cargue un archivo de sonido para conectarlo con el bloque de muestra.
fr: Télécharger un fichier audio pour le connecter au bloc d'échantillon.
hi: सैंपल ब्लॉक से जुड़ने के लिए एक साउंड फ़ाइल अपलोड करें।
ja: 音色サンプルをアップロードして、音の高さを合わせる
mr: नमूना ब्लॉकशी कनेक्ट करण्यासाठी ध्वनी फाइल अपलोड करा.
te: సేంపిల్ బ్లాక్తో కనెక్ట్ అవుట్ చేడానికి ఒక ధ్వని ఫైల్ను అప్లోడ్ చేయండి.
tr: örnek bloğa bağlanmak için bir ses dosyası yükleyin
ur: نمونہ بلاک کے ساتھ جڑنے کے لیے آواز کی فائل اپ لوڈ کریں۔
zh_cn: 上传音频文件以连接采样块。
