Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: Cannot load project from the file. Please check the file type.
es: No se puede cargar el proyecto desde el archivo. Compruebe el tipo de archivo.
fr: Impossible de charger le projet depuis le fichier. Veuillez vérifier le type de fichier.
hi: फ़ाइल से परियोजना लोड नहीं कर सकता है। कृपया फ़ाइल का प्रकार जांचें।
ja: プロジェクトを読みこめません。ファイルの種類をかくにんしてください。
mr: फ़ाइल से प्रोजेक्ट लोड नहीं कर सकता। कृपया फ़ाइल प्रकार की जाँच करें।
pt: Não foi possível carregar o projeto do arquivo. Por favor, verifique o tipo de arquivo.
te: ఫైలు నుండి ప్రాజెక్ట్‌ను లోడ్ చేయలేకపోయింది. దయచేసి ఫైలు రకాన్ని తనిఖీ చేయండి.
tr: dosyadan proje yüklenemiyor
ur: پروجیکٹ کو فائل سے لوڈ نہیں کرسکتا۔ براہ کرم فائل کی قسم چیک کریں۔
zh_cn: 无法从文件加载项目。请检查文件类型。

source: Invalid parameters
es: El parametro es invalido.
fr: Paramètres invalides
hi: अमान्य पैरामीटर्स
ja: 無効なパラメータ
mr: अमान्य पैरामीटर
pt: Parâmetros inválidos
te: అమాయక పరామిటర్లు
tr: geçersiz parametreler
ur: غلط پیرامیٹرز
zh_cn: 参数无效

source: Error regenerating palettes. Please refresh the page.
es: Error al regenerar las paletas. Actualice la página.
fr: Erreur lors de la régénération des palettes. Veuillez rafraîchir la page.
mr: पैलेट्स को पुनः उत्पन्न करने में त्रुटि। कृपया पृष्ठ को रीफ्रेश करें।
tr: paletler yeniden oluşturulurken hata oluştu
ur: پیلیٹوں کو دوبارہ تخلیق کرنے میں خرابی براہ کرم صفحہ کو تازہ کریں۔
zh_cn: 重新生成调色板时出错。请刷新页面

source: temperament
es: temperamento
fr: tempérament
hi: स्वभाव
ja: 音律
mr: स्वभाव
pt: temperamento
te: మానఃస్వారూపము
tr: mizaç
ur: مزاج
zh_cn: 音律

source: start
es: iniciar
fr: commence
hi: प्रारंभ
ja: スタート
mr: सुरूवात
pt: iniciar
te: ప్రారంభించు
tr: başlangıç
ur: شروع کریں
zh_cn: 开始

source: matrix
es: matriz
fr: matrice
hi: मैट्रिक्स
ja: フレーズメーカー
mr: मैट्रिक्स
pt: matriz
te: మేట్రిక్స్
tr: matris
ur: میٹرکس
zh_cn: 矩阵

source: status
es: estatus
fr: statut
hi: स्थिति
ja: 実行じょうきょう
mr: स्थिति
pt: condição
te: స్థితి
tr: durum
ur: حیثیت
zh_cn: 状态

source: drum mapper
es: mapa del tambor
fr: mapper de tambour
hi: ड्रम मैपर
ja: ドラム・ピッチ行列
mr: ड्रम मैपर
pt: mapa da bateria
te: డ్రం మ్యాపర్
tr: davul eşleyici
ur: ڈھول میپر
zh_cn: 鼓映射器

source: ruler
es: regla
fr: règle
hi: रूलर
ja: リズムメーカー
mr: रूलर
pt: régua
te: రూలర్
tr: cetvel
ur: حکمران
zh_cn: 尺子

source: timbre
hi: टिम्बर
ja: 音色
mr: स्वर
te: టింబ్రె
tr: tını
ur: ٹمبری
zh_cn: 音色

source: stair
es: escalera
fr: escalier
hi: सीढ़ी
ja: 階段
mr: सीढ़ी
pt: escada
te: స్టేర్
tr: merdiven
ur: سیڑھی
zh_cn: 楼梯

source: tempo
hi: टेम्पो
ja: メトロノーム
mr: ताल
te: టెంపో
ur: ٹیمپو
zh_cn: 速度

source: mode
es: modo
hi: मोड
ja: モード（音階）
mr: मोड
pt: modo
te: మోడ్
tr: mod
ur: موڈ
zh_cn: 调式

source: slider
es: deslizador
fr: curseur
hi: स्लाइडर
ja: スライダー
mr: स्लाइडर
te: స్లైడర్
tr: kaydırıcı
ur: سلائیڈر
zh_cn: 滑块

source: keyboard
es: teclado
fr: clavier
hi: कुंजीपट
ja: キーボード
mr: किबोर्ड
pt: teclado
te: కీబోర్డ్
tr: klavye
ur: کی بورڈ
zh_cn: 查询键盘

source: drum
es: tambor
fr: tambour
hi: ढोल
ja: ドラム
mr: ड्रम
pt: bateria
te: డ్రమ్
tr: davul
ur: ڈھول
zh_cn: 鼓

source: rhythm maker
es: hacer un ritmo
fr: créateur de rythme
hi: रिदम बनाने वाला
ja: リズムメーカー
mr: रिदम मेकर
pt: criador de ritmo
te: రిద్ధమ్ మేకర్
tr: ritim yapıcı
ur: تال بنانے والا
zh_cn: 节奏制作器

source: note value
es: valor de la nota
fr: valeur de la note
hi: नोट मूल्य
ja: 音の長さ
mr: नोट मूल्य
pt: valor de nota
te: నోట్ విల్యూ
tr: nota değeri
ur: نوٹ ویلیو
zh_cn: 音符时值

source: scalar interval
es: intervalo escalar
fr: intervalle scalaire
hi: स्केलर इंटरवल
ja: 音階の上下
mr: स्केलर अंतराल
pt: intervalo escalar
te: స్కాలర్ ఇంటర్వల్
tr: skaler aralık
ur: اسکیلر وقفہ
zh_cn: 音阶音程

source: milliseconds
es: milisegundos
fr: millisecondes
hi: मिलीसेकंड
ja: ミリ秒
mr: मिलीसेकंड
pt: milissegundos
te: మిల్లిసెకన్లు
tr: milisaniye
ur: ملی سیکنڈ
zh_cn: 毫秒

source: silence
es: silencio
hi: मौन
ja: 休符
mr: मौन
pt: silêncio
te: నిశ్శబ్దం
tr: sessizlik
ur: خاموشی
zh_cn: 沉默

source: down
es: abajo
fr: bas
hi: नीचे
ja: 下
mr: नीचे
pt: abaixo
te: క్రిందకు
tr: aşağı
ur: نیچے نیچے
zh_cn: 向下

source: up
es: arriba
fr: haut
hi: ऊपर
ja: 上
mr: ऊपर
pt: acima
te: పైకు
tr: yukarı
ur: اوپر
zh_cn: 向上

source: pitch
es: tono
fr: hauteur
hi: पिच
ja: 音の高さ
mr: स्वर
pt: determinar o tom
te: శ్రుతి
tr: perde
ur: پچ
zh_cn: 音高

source: Silence block cannot be removed.
es: El bloqueo de silencio no se puede eliminar.
fr: Le bloc de silence ne peut pas être supprimé.
ja: 「休符」は取り出すことができません。
mr: मौन ब्लॉक को हटाया नहीं जा सकता।
tr: sessizlik bloğu kaldırılamaz
ur: خاموشی بلاک کو نہیں ہٹایا جاسکتا۔
zh_cn: 无法移除静音模块

source: You can restore deleted blocks from the trash with the Restore From Trash button.
es: Puedes restaurar bloques eliminados de la papelera con el botón Restaurar desde la papelera.
fr: Vous pouvez restaurer les blocs supprimés depuis la corbeille avec le bouton Restaurer depuis la corbeille.
mr: आप ट्रैश से हटाए गए ब्लॉकों को पुनर्स्थापित कर सकते हैं।
tr: çöp kutusundan geri yükle düğmesi ile silinen blokları çöp kutusundan geri yükleyebilirsiniz
ur: آپ کوڑے دان سے حذف شدہ بلاکس کو کوڑے دان کے بٹن سے بحال کرسکتے ہیں۔
zh_cn: 您可以通过“从垃圾桶恢复”按钮恢复已删除的模块

source: true
es: verdadero
fr: vrai
hi: सत्य
ja: 真
mr: सत्य
pt: verdadeiro
te: నిజమైన
tr: doğru
ur: سچ ہے
zh_cn: 真

source: false
es: falso
fr: faux
hi: असत्य
ja: 偽
mr: असत्य
pt: falso
te: అసత్యం
ur: جھوٹا
zh_cn: 假

source: Cartesian
es: Cartesiano
fr: Coordonnées cartésiennes
hi: कार्टेसियन
ja: ほうがん（ざひょう）を表示
mr: कार्टेशियन
pt: Cartesiano
te: కార్టీషియన్
tr: Kartezyen
ur: کارٹیسیان
zh_cn: 笛卡爾

source: polar
fr: polaire
hi: पोलर
ja: 極座標を表示
mr: ध्रुवीय
te: పోలార్
tr: kutup
ur: قطبی
zh_cn: 极坐标

source: Cartesian/Polar
es: Cartesiano/Polar
fr: Cartésien/Polaire
hi: कार्टेसिय
ja: 中心の角度とほうがん（ざひょう）をひょうじ
mr: कार्टेशियन/ध्रुवीय
pt: Cartesiano/Polar
te: కార్టేషియన్/పోలార్
ur: کارٹیسین / پولر
zh_cn: 笛卡尔/极坐标

source: none
es: ninguno
fr: aucun
hi: कोई नहीं
ja: なし
mr: कोई नहीं
te: ఏమిలేదు
ur: کوئی نہیں
zh_cn: 无

source: treble
es: agudos
fr: aigu
hi: ट्रेबल
ja: トレブル記号
mr: उच्च स्वर
te: ట్రెబిల్
tr: tiz
ur: کانپنا
zh_cn: 高音

source: grand staff
es: staff grande
fr: grande portée
hi: ग्रैंड स्टाफ
ja: トレブルとバス記号
mr: ग्रैंड स्टाफ
te: గ్రాండ్ స్టాఫ్
tr: büyük personel
ur: عظیم عملہ
zh_cn: 大五线谱

source: mezzo-soprano
hi: मेज़्ज़ो-सोप्रानो
ja: メゾソプラノ記号
mr: मेज़ो-सोप्रानो
te: మెజ్జో-సోప్రానో
ur: میزو سوپرانو
zh_cn: 中高音

source: alto
hi: आल्टो
ja: アルト記号
mr: एल्टो
te: ఆల్టో
ur: آلٹو
zh_cn: 女低音

source: tenor
fr: ténor
hi: टेनर
ja: テノール記号
mr: टेनर
te: టెనర్
ur: ٹینر
zh_cn: 男高音

source: bass
fr: basse
hi: बास
ja: コントラバス
mr: बास
pt: baixo
te: బేస్
tr: bas
ur: باس
zh_cn: 低音

source: on2
es: encendido
fr: marche2
hi: ऑन2
ja: オン
mr: ऑन2
te: ఆన్
ur: 2 پر
zh_cn: 开

source: off
es: apagado
fr: arrêt
hi: ऑफ
ja: オフ
mr: बंद
te: ఆఫ్
tr: kapalı
ur: آف
zh_cn: 关闭

source: Not a number
es: no es un número
fr: Pas un nombre
hi: एक संख्या नहीं
ja: 数字ではありません
mr: संख्या नहीं
pt: Não um número
te: సంఖ్య కాదు
tr: bir sayı değil
ur: نمبر نہیں
zh_cn: 不是数字

source: Octave value must be between 1 and 8.
fr: La valeur de l'octave doit être comprise entre 1 et 8.
ja: オクターヴの値が「１」から「8」までの範囲でなければなりません。
mr: अष्टक मान 1 और 8 के बीच होना चाहिए।
tr: oktav değeri 1 ile 8 arasında olmalıdır
ur: آکٹیو ویلیو 1 اور 8 کے درمیان ہونی چاہئے۔
zh_cn: 八度值必须在1到8之间

source: Numbers can have at most 10 digits.
es: El bloqueo de silencio no se puede eliminar.
fr: Les nombres peuvent comporter au maximum 10 chiffres.
ja: 数字は最大１０桁までです。
mr: संख्याओं में अधिकतम 10 अंक हो सकते हैं।
tr: sayıların en fazla 10 basamağı olabilir
ur: تعداد میں زیادہ سے زیادہ 10 ہندسے ہوسکتے ہیں۔
zh_cn: 数字最多只能有10位

source: box
es: caja
fr: boîte
hi: बक्सा
ja: 箱
mr: पेटी
pt: caixa
te: పేటిక
tr: kutu
ur: باکس
zh_cn: 盒子

source: Consider breaking this stack into parts.
es: Considera dividir esta pila en partes.
fr: Envisagez de diviser cette pile en parties.
hi: इस स्टैक को भागों में बाँटने का विचार करें।
ja: アクションブロックを使ってプログラムをまとめませんか
mr: इस ढेर को भागों में तोड़ने पर विचार करें।
pt: Considere dividir essa pilha em partes.
te: ఈ స్టాక్‌ను భాగాలాగా విభాజించడానికి పరిగణించండి
tr: bu yığını parçalara ayırmayı düşünün
ur: اس اسٹیک کو حصوں میں توڑنے پر غور کریں۔
zh_cn: 考虑将这个堆栈拆分成几个部分

source: open file
es: abrir archivo
fr: fichier ouvert
hi: फ़ाइल खोलें
ja: ファイルを開く
mr: फाइल खोलें
pt: abrir arquivo
te: ఫైల్ తెరవండి
tr: dosya aç
ur: کھلی فائل
zh_cn: 打开文件.

source: text
es: texto
fr: texte
hi: पाठ
ja: 文字そざい
mr: मजकूर
pt: texto
te: పాఠము
tr: metin
ur: متن
zh_cn: 文本.

source: store in box
es: guardar en caja
hi: बॉक्स में स्टोर करें
ja: 箱にほぞん
mr: बॉक्स में स्टोर करें
pt: guardar na caixa
tr: kutu içinde mağaza
ur: باکس میں اسٹور کریں
zh_cn: 存储在盒子里

source: box1
es: caja1
hi: बॉक्स1
ja: 箱１
mr: बॉक्स 1
pt: caixa1
te: మొదటి పెట్టె
ur: باکس 1
zh_cn: 盒子1

source: box2
es: caja2
hi: बॉक्स2
ja: 箱２
mr: बॉक्स 2
pt: caixa2
te: రెండవ పెట్టె
ur: باکس 2
zh_cn: 盒子2

source: store in
es: guardar en
fr: range dans
hi: में भंडारित करें
ja: 入れる
mr: में संग्रह करें
pt: guardar em
te: దీనిలో దాచు
tr: mağaza içinde
ur: اسٹور میں
zh_cn: 放入

source: name
es: nombre
fr: nom
hi: नाम
ja: 名前
mr: नाम
pt: nome
te: పేరు
tr: ad
ur: نام
zh_cn: 名称

source: value
es: valor
fr: valor
hi: मान
ja: 値
mr: मूल्य
pt: valor
te: విలువ
tr: değer
ur: قدر
zh_cn: 值

source: Forever loop detected inside a note value block. Unexpected things may happen.
es: Se detectó un bucle indefinido dentro de un bloque de valor de nota. Pueden ocurrir cosas inesperadas.
fr: Boucle infinie détectée dans un bloc de valeur de note. Des choses inattendues peuvent se produire.
ja: 「ずっとくり返す」状態が「音符」の中にある。
mr: नोट मूल्य ब्लॉक के अंदर हमेशा के लिए लूप का पता चला। अप्रत्याशित चीजें हो सकती हैं।
tr: forever loop detected inside a note value block
ur: نوٹ ویلیو بلاک کے اندر ہمیشہ لوپ کا پتہ چلا۔ غیر متوقع چیزیں ہوسکتی ہیں۔
zh_cn: 在音符时值模块中检测到永久循环。可能会发生意外情况

source: There is no block selected.
es: No hay bloque seleccionado.
fr: Aucun bloc n'est sélectionné.
hi: कोई ब्लॉक चयन नहीं किया गया है।
ja: ブロックが選ばれていません
mr: कोई ब्लॉक चयनित नहीं है।
pt: Não há bloco selecionado.
te: ఎటువంటి విభాగం ఎంచుకోలేదు
tr: seçili bir blok yok
ur: کوئی بلاک منتخب نہیں ہوا ہے۔
zh_cn: 没有选择任何模块

source: avatar
hi: अवतार
ja: ネズミへんこう
mr: अवतार
te: అవతార్
ur: اوتار
zh_cn: 头像

source: sample
es: muestra de audio
fr: échantillon
hi: सैम्पल
ja: 音色サンプル
mr: नमूना
te: నమూనా
tr: örnek
ur: نمونہ
zh_cn: 样本

source: mouse
es: ratón
fr: souris
hi: माउस
ja: ネズミ
mr: चूहा
pt: ratinho
te: మౌస్
tr: fare
ur: ماؤس
zh_cn: 鼠标

source: brown rat
es: rata marrón
fr: rat brun
hi: भूरा चूहा
ja: 茶色のドブネズミ
mr: तपकिरी उंदीर
pt: rato marron
te: బ్రౌన్ ర్యాట్
tr: kahverengi sıçan
ur: بھوری چوہا
zh_cn: 棕色老鼠

source: mole
es: topo
fr: taupe
hi: मौज
ja: 土竜
mr: मोल
pt: topeira
te: మోల్
tr: köstebek
ur: تل
zh_cn: 鼹鼠

source: chipmunk
es: ardilla
fr: tamia
hi: चिपमंक
ja: リス
mr: चिपमंक
pt: chimpanzé
te: చిప్మంక్
tr: sincap
ur: چپمنک
zh_cn: 花栗鼠

source: red squirrel
es: ardilla roja
fr: écureuil roux
hi: लाल गिलहरी
ja: 赤いリス
mr: लाल खार
pt: esquilo vermelho
te: ఎరువు ఎక్క
tr: kırmızı sincap
ur: سرخ گلہری
zh_cn: 红松鼠

source: guinea pig
es: conejillo de indias
fr: cobaye
hi: गिनीपिग
ja: ギニーピッグ
mr: गिनी पिग
pt: porquinho da índia
te: గినియా పిగ్
tr: gine domuzu
ur: گنی پگ
zh_cn: 豚鼠

source: capybara
hi: कैपीबारा
ja: カピバラ
mr: कॅपिबारा
pt: capivara
te: కాప్యాబారా
ur: کیپیبرا
zh_cn: 水豚

source: coypu
fr: ragondin
hi: कोयपू
ja: ヌートリア
mr: कोयपू
pt: nútria
te: కోయిపు
ur: کوائپو
zh_cn: 豪猪

source: black rat
es: rata negra
fr: rat noir
hi: काला चूहा
ja: 黒い鼠
mr: काळा उंदीर
pt: rato de navio
te: బ్లాక్ ర్యాట్
tr: siyah sıçan
ur: سیاہ چوہا
zh_cn: 黑色老鼠

source: grey squirrel
es: ardilla gris
fr: écureuil gris
hi: स्लेटी गिलहरी
ja: 灰色のリス
mr: राखाडी खार
pt: esquilo cinza
te: గ్రే ఎక్క
tr: gri sincap
ur: بھوری رنگ گلہری
zh_cn: 灰松鼠

source: flying squirrel
es: ardilla voladora
fr: écureuil volant
hi: उड़ती गिलहरी
ja: モモンガ
mr: उडणारी खार
pt: esquilo voador
te: ఫ్లైంగ్ ఎక్క
tr: uçan sincap
ur: اڑن گلہری
zh_cn: 飞鼠

source: bat
es: murciélago
fr: batte
hi: बैट
ja: 蝙蝠
mr: वटवाघूळ
pt: morcego
te: బ్యాట్
tr: yarasa
ur: بیٹ
zh_cn: 蝙蝠

source: start drum
es: iniciar tambor
fr: démarrer le tambour
hi: ड्रम चालू करें
ja: ドラム・スタート
mr: ड्रम सुरू करा
pt: iniciar bateria
te: డ్రమ్ ప్రారంభం
tr: başlangıç tamburu
ur: ڈھول شروع کریں
zh_cn: 开始鼓声

source: rhythm
es: ritmo
fr: rythme
hi: रिद्धम
ja: 音符
mr: ताल
pt: Ritmo
te: రిధం
tr: ritim
ur: تال
zh_cn: 节奏

source: tone
es: tono
fr: ton
hi: स्वर
ja: 音色
mr: स्वर
pt: tom
te: టోన్
tr: ton
ur: سر
zh_cn: 音调

source: pen
es: pluma
fr: stylo
hi: क़लम
ja: ペン
mr: पेन
pt: caneta
te: పెన్
tr: kalem
ur: قلم
zh_cn: 钢笔

source: number
es: número
fr: nombre
hi: संख्या
ja: すうち
mr: संख्या
pt: número
te: సంఖ్య
tr: sayı
ur: نمبر
zh_cn: 數字

source: flow
es: flujo
fr: flux
hi: बहाव
ja: 実行手順
mr: प्रवाह
pt: seguimento
te: ఫ్లో
tr: akış
ur: بہاؤ
zh_cn: 流动

source: Sensors
es: sensores
fr: Capteurs
hi: सेंसर्स
ja: センサー
mr: संवेदी
pt: Sensores
te: సెన్సార్లు
tr: Sensörler
ur: سینسر

source: Media
es: medios
fr: Médias
hi: मीडिया
ja: メディア
mr: मीडिया
pt: Mídia
te: మీడియా
tr: Medya
ur: میڈیا

source: mice
es: ratón
fr: souris
hi: माउस
ja: ネズミ達の関係
mr: उंदीर
pt: rato
te: మైస్
tr: fare
ur: چوہے
zh_cn: 鼠标

source: About Music Blocks
es: Acerca de los Bloques de Música
fr: À propos de Music Blocks
hi: म्यूज़िक ब्लॉक्स के बारे में
ja: ミュージック・ブロックスについて
mr: म्युझिक ब्लॉक्स बद्दल
pt: Sobre o Music Blocks
te: మ్యూజిక్ బ్లాక్స్ గురించి
tr: müzik blokları hakkında
ur: میوزک بلاکس کے بارے میں
zh_cn: 关于音乐模块

source: Record
es: Grabar
fr: Enregistrer
hi: रिकॉर्ड
ja: 録音
mr: रेकॉर्ड
te: రికార్డ్
tr: Kayıt
ur: ریکارڈ
zh_cn: 录音

source: Full screen
es: Pantalla completa
fr: Plein écran
hi: पूर्ण स्क्रीन
ja: フルスクリーン
mr: पूर्ण स्क्रीन
te: పూర్తి పరిపరచిన పరిచయం
tr: tam ekran
ur: مکمل اسکرین
zh_cn: 全屏

source: Toggle Fullscreen
es: Alternar pantalla completa
fr: Basculer en plein écran
ja: フルスクリーンの切り替え
mr: पूर्ण स्क्रीन परिवर्तन करा
tr: tam ekrana geç
ur: ٹوگل فل سکرین
zh_cn: 切换全屏

source: New project
es: Nuevo proyecto
fr: Nouveau projet
hi: नया काम
ja: 新しいプロジェクト
mr: नवीन प्रकल्प
pt: Novo projeto
te: కొత్త ప్రాజెక్టు
tr: yeni proje
ur: نیا پروجیکٹ
zh_cn: 新项目

source: Load project from file
es: Cargar proyecto de archivo
fr: Charger le projet à partir du fichier
hi: फ़ाइल से प्रोजेक्ट लें
ja: プロジェクトを読みこむ
mr: फाइलमधून प्रकल्प लोड करा
pt: Carregar projeto de um arquivo
te: ఫైల్ నుండి ప్రాజెక్టును లోడ్ చేయండి
tr: projeyi dosyadan yükle
ur: فائل سے پروجیکٹ لوڈ کریں
zh_cn: 从文件加载项目

source: Save project
es: Guardar proyecto
fr: Enregistrer le projet
hi: प्रोजेक्ट को संचय करे
ja: プロジェクトをほぞん
mr: प्रकल्प जतन करा
pt: Salvar projeto
te: ప్రాజెక్ట్‌ను భద్రపరచు
tr: projeyi kaydet
ur: پروجیکٹ کو محفوظ کریں
zh_cn: 保存项目

source: Save project as HTML
es: Guardar como HTML
fr: Enregistrer le projet en tant que HTML
hi: प्रोजेक्ट को HTML के रूप में संचय करें
ja: HTMLをほぞん
mr: प्रकल्प HTML म्हणून जतन करा
pt: Salvar projeto como HTML
te: ప్రాజెక్ట్‌ను HTML రూపంలో భద్రపరచు
tr: projeyi html olarak kaydet
ur: پروجیکٹ کو HTML کے بطور محفوظ کریں
zh_cn: 将项目保存为HTML

source: Find and share projects
es: Encuentra y comparte proyectos
fr: Trouver et partager des projets
hi: परियोजनाएं खोजें और साझा करें
ja: みんなの作品
mr: प्रकल्प शोधा आणि सामायिक करा
pt: Buscar e compartilhar projetos
te: ప్రాజెక్టులను కనుగొనండి మరియు షేర్ చేయండి
tr: projeleri bulma ve paylaşma
ur: منصوبے تلاش کریں اور شیئر کریں
zh_cn: 查找并分享项目

source: Offline. Sharing is unavailable
es: Desconectado. Compartir no está disponible.
fr: Hors ligne. Le partage est indisponible
hi: ऑफ़लाइन। साझा करना अस्वीकृत है
ja: オフライン。シェア機能が使えません
mr: ऑफलाइन. सामायिक करणे उपलब्ध नाही
pt: Desconectado. Compartilhamento não está disponível
te: ఆఫ్‌లైన్. షేరింగ్ అంచనా లేదు
tr: çevrimdışı
ur: آف لائن شیئرنگ دستیاب نہیں ہے
zh_cn: 离线。共享不可用

source: Auxiliary menu
es: Menú auxiliar
fr: Menu auxiliaire
hi: सहायक मेनू
ja: サブメニュー
mr: सहायक मेनू
pt: Menu auxiliar
te: సహాయక మెనూ
tr: yardımcı menü
ur: معاون مینو
zh_cn: 辅助菜单

source: Help
es: Ayuda
fr: Aide
hi: मदद
ja: 説明
mr: मदत
pt: Ajuda
te: సహాయం
tr: Yardım
ur: مدد کریں
zh_cn: 幫助

source: Run slowly
es: Tocar lentamente
fr: Exécuter lentement
hi: धीमे रूप से चलाएं
ja: ゆっくり実行する
mr: हळूहळू चालवा
pt: Executar lentamente
te: నిధానంగా ప్రవృత్తి చేయండి
tr: yavaş koş
ur: آہستہ سے چلائیں
zh_cn: 慢速运行

source: Run step by step
es: Ejecutar paso a paso
fr: Exécuter pas à pas
hi: क्रमशः चलाएं
ja: ブロックを１つずつ実行する
mr: पायरी पायरीने चालवा
pt: Executar passo a passo
te: అడుగుపూర్వకంగా ప్రవృత్తి చేయండి
tr: adım adım koşmak
ur: قدم بہ قدم چلائیں
zh_cn: 逐步运行

source: Display statistics
es: Analizar
fr: Afficher les statistiques
hi: आँकड़े प्रदर्शित करें
ja: とうけいを表示する
mr: आकडेवारी दाखवा
pt: Exibir estatísticas
te: సంఖ్యలను ప్రదర్శించండి
tr: istatistikleri görüntüle
ur: اعداد و شمار دکھائیں
zh_cn: 显示统计信息

source: Load plugin
es: Cargar plugin
fr: Charger le plugin
hi: प्लगइन लोड करें
ja: プラグインを読みこむ
mr: प्लगइन लोड करा
pt: Carregar plugin
te: ప్లగిన్ లోడ్ చేయండి
tr: eklentiyi yükle
ur: لوڈ پلگ ان
zh_cn: 加载插件

source: Delete plugin
es: Eliminar plugin
fr: Supprimer le plugin
hi: प्लगइन हटाएं
ja: プラグインを消す
mr: प्लगइन हटवा
pt: Excluir plugin
tr: eklentiyi sil
ur: پلگ ان کو حذف کریں
zh_cn: 删除插件

source: Enable horizontal scrolling
es: Habilitar desplazamiento horizontal
fr: Activer le défilement horizontal
hi: क्षैतिज स्क्रोलिंग सक्षम करें
ja: 自由な方向にスクロール
mr: आडवे स्क्रोलिंग सक्षम करा
pt: Habilitar rolamento horizontal
te: అక్షరాభ్యంతర లోడింగ్‌ను అనుమతించండి
tr: yatay kaydırmayı etkinleştir
ur: افقی سکرولنگ کو فعال کریں
zh_cn: 启用横向滚动

source: Disable horizontal scrolling
es: Deshabilitar desplazamiento horizontal
fr: Désactiver le défilement horizontal
hi: क्षैतिज स्क्रोलिंग अक्षम करें
ja: たて方向にスクロール
mr: आडवे स्क्रोलिंग अक्षम करा
pt: Desabilitar o rolamento horizontal
te: అక్షరాభ్యంతర లోడింగ్‌ను నిలిపించండి
tr: yatay kaydırmayı devre dışı bırak
ur: افقی سکرولنگ کو غیر فعال کریں
zh_cn: 禁用横向滚动

source: Change theme
tr: temayı değiştir
ur: تھیم کو تبدیل کریں
zh_cn: 更改主题

source: Light Mode
tr: ışık modu
ur: لائٹ موڈ
zh_cn: 浅色模式

source: Dark Mode
tr: karanlık mod
ur: ڈارک موڈ
zh_cn: 深色模式

source: Merge with current project
es: Unir con el proyecto actual
fr: Fusionner avec le projet actuel
hi: वर्तमान परियोजना के साथ मर्ज करें
ja: プロジェクトを組みあわせる
mr: वर्तमान प्रकल्पाशी विलीन करा
pt: Integrar com o projeto atual
te: ప్రస్తుత ప్రాజెక్ట్‌తో విలీనం చేయండి
tr: mevcut proje ile birleştirme
ur: موجودہ منصوبے کے ساتھ ضم کریں
zh_cn: 与当前项目合并

source: Set Pitch Preview
es: Establecer vista previa de tono
fr: Définir l'aperçu de hauteur
hi: पिच पूर्वावलोकन सेट करें
ja: 変化記号を設定
mr: पिच पूर्वावलोकन सेट करा
te: పిచ్ ప్రివ్యూను సెట్ చేయండి
tr: perde önizlemesini ayarla
ur: پچ پیش نظارہ سیٹ کریں
zh_cn: 设置音高预览

source: JavaScript Editor
es: Editor de Javascript
fr: Éditeur JavaScript
ja: ジャバスクリプト エディタ
mr: जावास्क्रिप्ट संपादक
tr: javascript editörü
ur: جاوا اسکرپٹ ایڈیٹر
zh_cn: JavaScript 编辑器

source: Restore
es: Restaurar
fr: Restaurer
hi: पुनर्स्थापित करें
ja: すてたブロックをもどす
mr: पुनर्संचयित करा
pt: Restaurar
te: పునఃస్థాపించు
tr: Geri Yükleme
ur: بحال
zh_cn: 恢复

source: Switch to beginner mode
es: Cambiar al modo principiante
fr: Passer en mode débutant
hi: प्रारंभिक मोड में स्विच करें
ja: かんたんモードにする
mr: प्रारंभिक मोडवर स्विच करा
pt: Trocar para modo iniciante
te: ప్రారంభకర్తల రీతికి మారండి
tr: başlangıç moduna geç
ur: ابتدائی موڈ میں سوئچ کریں
zh_cn: 切换到初学者模式

source: Switch to advanced mode
es: Cambiar a modo avanzado
fr: Passer en mode avancé
hi: उन्नत मोड में स्विच करें
ja: はってんモードにする
mr: प्रगत मोडवर स्विच करा
pt: Trocar para modo avançado
te: ఉన్నత రీతికి మారండి
tr: gelişmiş moda geç
ur: جدید موڈ میں سوئچ کریں
zh_cn: 切换到高级模式

source: Select language
es: Seleccione el idioma
fr: Sélectionner la langue
hi: भाषा चुनें
ja: 言語をえらぶ
mr: भाषा निवडा
pt: Selecionar idioma
te: భాషను ఎంచుకోండి
tr: dil seç
ur: زبان منتخب کریں
zh_cn: 选择语言

source: Save mouse artwork as PNG
es: Guardar ilustraciones del ratón como PNG
fr: Enregistrer l'œuvre de la souris sous forme de PNG
hi: माउस आर्टवर्क को PNG के रूप में सहेजें
ja: PNGでほぞん
mr: माऊस कला PNG म्हणून जतन करा
pt: Salvar as ilustrações do ratinho como PNG
te: మౌస్ ఆర్ట్‌వర్క్‌ను PNG రూపంలో భద్రపరచండి
tr: fare resmini png olarak kaydet
ur: پی این جی کی حیثیت سے ماؤس آرٹ ورک کو محفوظ کریں
zh_cn: 将鼠标图像保存为PNG

source: Save mouse artwork as SVG
es: Guardar ilustraciones del ratón como SVG
fr: Enregistrer l'œuvre de la souris sous forme de SVG
hi: माउस आर्टवर्क को SVG के रूप में सहेजें
ja: SVGでほぞん
mr: माऊस कला SVG म्हणून जतन करा
pt: Salvar as ilustrações do ratinho como SVG
te: మౌస్ ఆర్ట్‌వర్క్‌ను SVG రూపంలో భద్రపరచండి
tr: fare resmini svg olarak kaydet
ur: ایس وی جی کے بطور ماؤس آرٹ ورک کو محفوظ کریں
zh_cn: 将鼠标图像保存为SVG

source: Save music as WAV
es: Guarda música como WAV
fr: Enregistrer la musique sous forme de WAV
hi: संगीत को WAV के रूप में सहेजें
ja: WAVでほぞん
mr: संगीत WAV म्हणून जतन करा
pt: Salvar a música como WAV
te: సంగీతాన్ని WAV రూపంలో భద్రపరచండి
tr: müziği wav olarak kaydet
ur: WAV کے بطور موسیقی محفوظ کریں
zh_cn: 将音乐保存为WAV

source: Save sheet music as ABC
es: Guardar partituras como ABC
fr: Enregistrer la partition sous forme de ABC
hi: शीट संगीत को ABC के रूप में सहेजें
ja: ABCのフォーマットでほぞん
mr: नोटेशन ABC म्हणून जतन करा
pt: Slavar partitura com ABC
te: షీట్ సంగీతాన్ని ABC రూపంలో భద్రపరచండి
tr: notaları abc olarak kaydet
ur: اے بی سی کے بطور شیٹ میوزک محفوظ کریں
zh_cn: 将乐谱保存为ABC

source: Save sheet music as Lilypond
es: Guardar partituras como Lilypond.
fr: Enregistrer la partition sous forme de Lilypond
hi: शीट संगीत को Lilypond के रूप में सहेजें
ja: がくふ(Lilypondのフォーマット)でほぞん
mr: नोटेशन Lilypond म्हणून जतन करा
pt: Salvar partitura como Lilypond
te: షీట్ సంగీతాన్ని Lilypond రూపంలో భద్రపరచండి
tr: notaları lilypond olarak kaydet
ur: للی پنڈ کے بطور شیٹ میوزک محفوظ کریں
zh_cn: 将乐谱保存为LilyPond

source: Save sheet music as MusicXML
es: Guardar partituras como MusicXML
fr: Enregistrer la partition sous forme de MusicXML
hi: शीट संगीत को MusicXML के रूप में सहेजें
ja: プロジェクトをMusicXML楽譜でほぞん
mr: नोटेशन MusicXML म्हणून जतन करा
te: షీట్ సంగీతాన్ని MusicXML రూపంలో భద్రపరచండి
tr: notaları musicxml olarak kaydet
ur: میوزک ایکس ایم ایل کے بطور شیٹ میوزک محفوظ کریں
zh_cn: 将乐谱保存为MusicXML

source: Save block artwork as SVG
es: Guardar bloque de ilustraciones como SVG
fr: Enregistrer l'œuvre de bloc sous forme de SVG
hi: ब्लॉक आर्टवर्क को SVG के रूप में सहेजें
ja: ブロックのアートをほぞん
mr: ब्लॉक कला SVG म्हणून जतन करा
pt: Salvar ilustração do bloco como SVG
te: SVG రూపకలాబద్దం నాటించండి
tr: blok resmi svg olarak kaydet
ur: ایس وی جی کے بطور بلاک آرٹ ورک کو محفوظ کریں
zh_cn: 将块图形保存为SVG

source: Save block artwork as PNG
tr: blok resmini png olarak kaydet
ur: پی این جی کی حیثیت سے بلاک آرٹ ورک کو محفوظ کریں
zh_cn: 将块图形保存为PNG

source: Confirm
es: Confirmar
fr: Confirmer
hi: पुष्टि करें
ja: 作成する
mr: पुष्टी करा
pt: Confirmar
te: నిర్ధారించండి
tr: Onaylama
ur: تصدیق کریں
zh_cn: 确认

source: English (United States)
fr: Anglais (États-Unis)
mr: इंग्रजी (संयुक्त राज्ये)
pt: Inglês (Estados Unidos)
tr: ingilizce (birleşik devletler) (Bağlam
ur: انگریزی (ریاستہائے متحدہ)

source: English (United Kingdom)
fr: Anglais (Royaume-Uni)
mr: इंग्रजी (युनायटेड किंगडम)
pt: Inglês (Reino Unido)
tr: ingilizce (birleşik krallık) (Bağlam
ur: انگریزی (برطانیہ)

source: español
fr: Espagnol
mr: स्पॅनिश
pt: espanhol
ur: ایسپاؤول

source: português
fr: Portugais
mr: पोर्तुगीज
ur: پورٹگووس

source: aymara
mr: आयमारा
ur: آئمارا

source: quechua
mr: क्वेचुआ
ur: کوئچو

source: guarani
mr: गुआरानी
ur: گارانی

source: Save turtle artwork as PNG
es: Guardar la ilustración de la tortuga como PNG
fr: Enregistrer l'œuvre de la tortue en tant que PNG
hi: टर्टल आर्टवर्क को PNG के रूप में सहेजें
ja: アートをPNGで保存
mr: कासवाची कलाकृती PNG म्हणून जतन करा
pt: Salvar ilustração da tartaruga como PNG
te: PNG రూపకలాబద్దం నాటించండి
tr: kaplumbağa resmini png olarak kaydet
ur: پی این جی کی حیثیت سے کچھی آرٹ ورک کو بچائیں
zh_cn: 将海龟图形保存为PNG
