Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: save heap to App
es: guardar pila a aplicación
fr: enregistrer le tas dans l'application
ja: アプリにヒープを保存
pt: salvar pilha no aplicativo
te: అప్‌కి హీప్ కంటెంట్‌ను భద్రపరచేయండి
tr: yığını uygulamaya kaydet
ur: ڈھیر کو ایپ میں محفوظ کریں
zh_cn: 保存堆到应用

source: Cannot find a valid heap for
es: Pilas tortuga no contiene un montón válida para
fr: Impossible de trouver un tas valide pour
ja: 正しいヒープが見つかりません。
pt: Não foi possível encontrar uma pilha válida para
te: కొరకు చాలామంది మాన్యమైన హీప్‌ను కనుగొనలేరు
tr: için geçerli bir yığın bulamıyor
ur: کے لئے ایک درست ڈھیر نہیں مل سکتا
zh_cn: 找不到有效的堆用于

source: The Load-heap block loads the heap from a file.
es: El bloque Cargar pila carga la pila de un archivo.
fr: Le bloc Charger-le-tas charge le tas depuis un fichier.
pt: O bloco Carregar-pilha carrega a pilha de um arquivo.
te: లోడ్-హీప్ బ్లాక్ హీప్‌ను ఒక ఫైల్‌నుండి లోడ్ చేస్తుంది.
ur: لوڈ ڈھیر بلاک ڈھیر سے ڈھیر کو فائل سے لوڈ کرتا ہے۔
zh_cn: Load-heap 块从文件加载堆。

source: load heap
es: cargar pila
fr: charger le tas
hi: ढेर को लोड करें
ja: ヒープをロードする
mr: लोड ढीग
pt: carregar pilha
te: హీప్‌ను ఫైల్ నుండి లోడ్ చేయండి
tr: yığın yükle
ur: بوجھ ڈھیر
zh_cn: 加载堆

source: The file you selected does not contain a valid heap.
es: El archivo seleccionado no contiene un pila válida.
fr: Le fichier que vous avez sélectionné ne contient pas un tas valide.
ja: 選んだファイルには、正しいヒープが含まれません。
pt: O arquivo escolhido não tem uma pilha válida.
te: మీ ఎంచుకున్న ఫైల్ మాన్యమైన హీప్ కంటేదేమీ ఉండదు.
tr: seçtiğiniz dosya geçerli bir yığın içermiyor
ur: آپ نے منتخب کردہ فائل میں درست ڈھیر نہیں ہوتا ہے۔
zh_cn: 您选择的文件不包含有效的堆。

source: The loadHeap block needs a loadFile block.
es: El bloque Pila de carga necesita un bloque de archivo de carga.
fr: Le bloc chargerTas a besoin d'un bloc chargerFichier.
ja: ロードヒープのブロックには、ロードファイルブロックが必要です。
pt: O bloco de carregarPilha precisa de um bloco de carregarArquivo.
te: లోడ్‌హీప్ బ్లాక్ ఒక లోడ్‌ఫైల్ బ్లాక్ అవసరం.
tr: loadheap bloğunun bir loadfile bloğuna ihtiyacı vardır
ur: لوڈ ہیپ بلاک کو لوڈ فائل بلاک کی ضرورت ہے۔
zh_cn: loadHeap 块需要一个 loadFile 块。

source: The Set-heap block loads the heap.
es: El bloque fijar pila carga la pila.
fr: Le bloc Définir-le-tas charge le tas.
te: సెట్-హీప్ బ్లాక్ హీప్‌ను లోడ్ చేస్తుంది.
ur: سیٹ ہیپ بلاک ڈھیر کو بوجھ دیتا ہے۔
zh_cn: Set-heap 块加载堆。

source: The block you selected does not contain a valid heap.
es: El bloque que seleccionó no contiene una pila válido.
fr: Le bloc que vous avez sélectionné ne contient pas un tas valide.
te: మీ ఎంచుకున్న బ్లాక్ మాన్యమైన హీప్ కంటేదేమీ ఉండదు.
tr: seçtiğiniz blok geçerli bir yığın içermiyor
ur: آپ نے جس بلاک کا انتخاب کیا ہے اس میں درست ڈھیر نہیں ہوتا ہے۔
zh_cn: 您选择的块不包含有效的堆。

source: The Set heap block needs a heap.
es: El bloque fija pila necesita una pila.
fr: Le bloc Définir le tas a besoin d'un tas.
te: సెట్ హీప్ బ్లాక్ ఒక హీప్ అవసరం.
tr: set heap bloğunun bir heap'e ihtiyacı vardır
ur: سیٹ ہیپ بلاک کو ڈھیر کی ضرورت ہے۔
zh_cn: Set heap 块需要一个堆。

source: The Load-dictionary block loads a dictionary from a file.
es: El bloque Carga-diccionario carga un diccionario desde un archivo.
fr: Le bloc Charger le dictionnaire charge un dictionnaire à partir d'un fichier.
te: లోడ్-డిక్షనరీ బ్లాక్ ఫైల్‌నుండి డిక్షనరీను లోడ్ చేస్తుంది.
ur: لوڈ ڈکشنری بلاک فائل سے ایک لغت کو لوڈ کرتا ہے۔
zh_cn: Load-dictionary 块从文件加载字典。

source: load dictionary
es: carga diccionario
fr: charger le dictionnaire
ja: 辞書をロード
te: డిక్షనరీను లోడ్ చేయండి
tr: sözlük yükle
ur: بوجھ کی لغت
zh_cn: 加载字典

source: file
es: archivo
fr: fichier
ja: ファイル
te: ఫైల్
tr: dosya
ur: فائل
zh_cn: 文件

source: The file you selected does not contain a valid dictionary.
es: El archivo que seleccionó no contiene un diccionario válido.
fr: Le fichier que vous avez sélectionné ne contient pas un dictionnaire valide.
te: మీరు ఎంచుకున్న ఫైలు యొక్క యాక్షనరాద నిఘంటువు కాదు.
tr: seçtiğiniz dosya geçerli bir sözlük içermiyor
ur: آپ نے جس فائل کا انتخاب کیا ہے اس میں کوئی درست لغت نہیں ہے۔
zh_cn: 您选择的文件不包含有效的字典。

source: The load dictionary block needs a load file block.
es: El bloque de diccionario de carga necesita un bloque de archivo
fr: Le bloc charger le dictionnaire nécessite un bloc charger le fichier.
te: లోడ్ నిఘంటువు బ్లాక్ ఒక లోడ్ ఫైల్ బ్లాక్ అవసరం.
tr: yükleme sözlüğü bloğunun bir yükleme dosyası bloğuna ihtiyacı vardır
ur: لوڈ ڈکشنری بلاک کو لوڈ فائل بلاک کی ضرورت ہے۔
zh_cn: load dictionary 块需要一个 load file 块。

source: The Set-dictionary block loads a dictionary.
es: El bloque fijar diccionario carga un diccionario.
fr: Le bloc Définir le dictionnaire charge un dictionnaire.
te: సెట్-నిఘంటువు బ్లాక్ నిఘంటువును లోడ్ చేస్తుంది.
ur: سیٹ لغت بلاک ایک لغت کو لوڈ کرتا ہے۔
zh_cn: Set-dictionary 块加载字典。

source: set dictionary
es: fijar diccionario
fr: définir le dictionnaire
ja: 辞書を設定
te: సెట్ నిఘంటువు
tr: sözlük ayarla
ur: سیٹ لغت
zh_cn: 设置字典

source: The block you selected does not contain a valid dictionary.
es: El bloque que seleccionó no contiene un diccionario válido.
fr: Le bloc que vous avez sélectionné ne contient pas un dictionnaire valide.
te: మీరు ఎంచుకున్న బ్లాక్ యొక్క యాక్షనరాద నిఘంటువు కాదు.
tr: seçtiğiniz blok geçerli bir sözlük içermiyor
ur: آپ نے جس بلاک کا انتخاب کیا ہے اس میں کوئی درست لغت نہیں ہے۔
zh_cn: 您选择的块不包含有效的字典。

source: The set dictionary block needs a dictionary.
es: El bloque Fijar dictionario necesita un diccionario.
fr: Le bloc définir le dictionnaire nécessite un dictionnaire.
te: సెట్ నిఘంటువు బ్లాక్ ఒక నిఘంటువు అవసరం.
tr: set dictionary bloğunun bir sözlüğe ihtiyacı vardır
ur: سیٹ لغت بلاک کو ایک لغت کی ضرورت ہے۔
zh_cn: set dictionary 块需要一个字典。

source: The Save-heap block saves the heap to a file.
es: El bloque Guardar pila guarda la pila en un archivo.
fr: Le bloc Sauvegarder le tas sauvegarde le tas dans un fichier.
pt: O bloco Salvar-pilha salva a pilha em um arquivo.
te: సేవ్-హీప్ బ్లాక్ హీప్ను ఒక ఫైల్కు సేవ్ చేస్తుంది.
ur: سیف ہیپ بلاک ڈھیر کو فائل میں محفوظ کرتا ہے۔
zh_cn: Save-heap 块将堆保存到文件。

source: save heap
es: guardar pila
fr: sauvegarder le tas
hi: ढेर सेव करें
ja: ヒープを保存する
mr: ढीग जतन करा
pt: salvar pilha
te: హీప్ను సేవ్ చేయండి
tr: yığını kaydet
ur: ڈھیر محفوظ
zh_cn: 保存堆

source: The Save-dictionary block saves a dictionary to a file.
es: El bloque Guardar diccionario guarda el diccionario en un archivo
fr: Le bloc Sauvegarder le dictionnaire sauvegarde un dictionnaire dans un fichier.
te: సేవ్-నిఘంటువు బ్లాక్ ఒక నిఘంటువును ఒక ఫైల్కు సేవ్ చేస్తుంది.
ur: سیف ڈکشنری بلاک فائل میں ایک لغت محفوظ کرتا ہے۔
zh_cn: Save-dictionary 块将字典保存到文件。

source: save dictionary
es: guardar diccionario
fr: sauvegarder le dictionnaire
ja: 辞書を保存
te: నిఘంటువును సేవ్ చేయండి
tr: sözlüğü kaydet
ur: لغت کو محفوظ کریں
zh_cn: 保存字典

source: The Open palette block opens a palette.
es: El bloque abrir la paleta abre una paleta
fr: Le bloc Ouvrir la palette ouvre une palette.
pt: O bloco Abrir paleta abre uma paleta.
te: ఓపెన్ పాలెట్ బ్లాక్ ఒక పాలెట్ను తెరవిస్తుంది.
tr: palet aç bloğu bir palet açar
ur: اوپن پیلیٹ بلاک ایک پیلیٹ کھولتا ہے۔
zh_cn: Open palette 块打开调色板。

source: open palette
es: abrir la paleta
fr: ouvrir la palette
ja: パレットを開きます
pt: abrir paleta
te: పాలెట్ను తెరవండి
tr: paleti aç
ur: کھلی پیلیٹ
zh_cn: 打开调色板

source: The Delete block block removes a block.
es: El bloque eliminar bloque elimina un bloque
fr: Le bloc Supprimer le bloc supprime un bloc.
pt: O bloco Excluir bloco remove um bloco.
te: డిలీట్ బ్లాక్ బ్లాక్ ఒక బ్లాక్ను తీసేస్తుంది.
tr: delete block bloğu bir bloğu kaldırır
ur: حذف بلاک بلاک بلاک بلاک کو دور کرتا ہے۔
zh_cn: Delete block 块删除一个块。

source: delete block
es: eliminar bloque
fr: supprimer le bloc
ja: ブロックを消す
pt: excluir bloco
te: ఈ బ్లాక్ను కచ్చివేయండి.
tr: bloğu sil
ur: بلاک کو حذف کریں
zh_cn: 删除块

source: The Move block block moves a block.
es: El bloque mover bloque mueve un bloque.
fr: Le bloc Déplacer le bloc déplace un bloc.
pt: O bloco Mover move um bloco.
te: మూవ్ బ్లాక్ బ్లాక్ ఒక బ్లాక్ను నేయిస్తుంది.
tr: move block bloğu bir bloğu hareket ettirir
ur: موو بلاک بلاک کو حرکت دیتا ہے۔
zh_cn: Move block 块用于移动一个块。

source: move block
es: mover bloque
fr: déplacer le bloc
ja: ブロックを動かす
pt: mover bloco
te: బ్లాక్ను నేయండి
tr: bloğu taşı
ur: بلاک منتقل کریں
zh_cn: 移动块

source: block number
es: número de bloque
fr: numéro du bloc
ja: ブロックの番号
pt: número do bloco
te: బ్లాక్ సంఖ్య
tr: blok numarası
ur: بلاک نمبر
zh_cn: 块编号

source: run block
es: ejecutar bloque
fr: exécuter le bloc
ja: ブロックを再生
pt: executar bloco
te: ఈ బ్లాక్ను తొలగించండి
tr: blok çalıştır
ur: رن بلاک
zh_cn: 运行块

source: The Dock block block connections two blocks.
es: El bloque connectar conecta dos bloques
fr: Le bloc Dock connecte deux blocs.
pt: O bloco Dock bloco conecta dois blocos.
tr: rıhtım bloğu blok bağlantıları iki blok
ur: ڈاک بلاک بلاک کنکشن دو بلاکس۔
zh_cn: Dock block 块连接两个块。

source: connect blocks
es: connectar block
fr: connecter les blocs
ja: ブロックを繋ぐ
mr: ब्लॉक्स कनेक्ट करा
pt: conectar blocos
te: ఒక బ్లాక్ను మరియునా ఒక బ్లాక్కు కలిగించండి.
tr: blokları bağla
ur: متصل بلاکس
zh_cn: 连接块

source: target block
es: bloque de destino
fr: bloc cible
ja: 目標のブロック
mr: लक्ष्य ब्लॉक
pt: Blco alvo
te: లక్ష్య బ్లాక్
tr: hedef blok
ur: ہدف بلاک
zh_cn: 目标块

source: connection number
es: número de conexion
fr: numéro de connexion
ja: 接続の番号
mr: कनेक्शन क्रमांक
pt: Número da conexão
te: కనెక్షన్ సంఖ్య
tr: bağlantı numarası
ur: کنکشن نمبر
zh_cn: 连接编号

source: The Make block block creates a new block.
es: El bloque crear bloque crea un bloque.
fr: Le bloc Créer un bloc crée un nouveau bloc.
mr: मेक ब्लॉक ब्लॉक एक नवीन ब्लॉक तयार करतो.
pt: O bloco Fazer bloco criar um novo bloco.
te: మేక్ బ్లాక్ బ్లాక్ ఒక కొత్త బ్లాక్ను సృష్టిస్తుంది.
tr: make block bloğu yeni bir blok oluşturur
ur: میک بلاک بلاک ایک نیا بلاک پیدا کرتا ہے۔
zh_cn: Make block 块用于创建一个新块。

source: make block
es: crear bloque
fr: créer un bloc
ja: ブロックを作る
mr: ब्लॉक तयार करा
pt: fazer bloco
te: ప్రోగ్రామ్తాత కొత్త బ్లాక్ను సృష్టించండి.
tr: blok yapmak
ur: بلاک بنائیں
zh_cn: 创建块

source: note
es: nota
hi: नोट
ja: 音符
mr: नोंद
pt: nota
te: నోట్
tr: nota
ur: نوٹ
zh_cn: 音符

source: Cannot find block
es: No se puede encontrar el bloque.
fr: Impossible de trouver le bloc
ja: ブロックが見つかりません
mr: ब्लॉक सापडत नाही
pt: Não foi possivel encontrar o bloco
te: బ్లాక్ను కనబడలేదు
tr: blok bulunamıyor
ur: بلاک نہیں مل سکتا
zh_cn: 找不到块

source: Warning: block argument type mismatch
es: Advertencia: el tipo de argumento de bloque no coincide
fr: Attention : incompatibilité de type d'argument de bloc
ja: 注意：ブロックとタイプが合っていません。
mr: इशारा: ब्लॉक आर्ग्युमेंट प्रकार जुळत नाही
pt: Aviso: tipo incompatível de bloco de arggumento
te: హెచ్చరిక: బ్లాక్ ఆర్గ్యుమెంటు రకాన్ని సరిపోలడం లేదు
tr: warning
ur: انتباہ: بلاک دلیل کی قسم مماثل ہے
zh_cn: 警告：块参数类型不匹配

source: The Open project block is used to open a project from a web page.
es: El bloque Abrir proyecto se utiliza para abrir un proyecto desde una página web.
fr: Le bloc Ouvrir le projet est utilisé pour ouvrir un projet à partir d'une page web.
mr: ओपन प्रोजेक्ट ब्लॉक वेब पृष्ठावरून प्रोजेक्ट उघडण्यासाठी वापरला जातो.
pt: O bloco Abrir projeto é usado para abrir um projeto de uma página da Internet.
te: ఓపెన్ ప్రాజెక్ట్ బ్లాక్ ఒక వెబ్ పేజీ నుండి ప్రాజెక్ట్ను తెరవడానికి ఉపయోగిస్తారు.
tr: open project bloğu bir projeyi web sayfasından açmak için kullanılır
ur: اوپن پروجیکٹ بلاک ویب پیج سے پروجیکٹ کھولنے کے لئے استعمال ہوتا ہے۔
zh_cn: Open project 块用于从网页打开项目。

source: open project
es: abierto proyecto
fr: ouvrir le projet
ja: プロジェクトを開く
mr: प्रोजेक्ट उघडा
pt: abrir projeto
te: ప్రాజెక్ట్ను తెరవండి
tr: açık proje
ur: کھلا پروجیکٹ
zh_cn: 打开项目

source: Please enter a valid URL.
es: Por favor introduzca un URL válido.
fr: Veuillez entrer une URL valide.
ja: 正しい URL をいれて下さい。
mr: कृपया वैध URL प्रविष्ट करा.
pt: Por favor, digite uma URL válida
te: దయచేసి ఒక చెల్లని URL నమోదు చేయండి.
tr: lütfen geçerli bir url girin
ur: براہ کرم ایک درست URL درج کریں۔
zh_cn: 请输入有效的URL。

source: Note value must be greater than 0.
es: Valor de la nota debe ser mayor que 0.
fr: La valeur de la note doit être supérieure à 0.
ja: 音の長さは、0より大きいあたいをせっていしてください。
mr: नोंद मूल्य 0 पेक्षा जास्त असणे आवश्यक आहे.
pt: O valor da nota deve ser maior que 0.
te: నోట్ విల్యూ కనీసం 0 కంటే ఎక్కడ ఉండాలి.
tr: nota değeri 0'dan büyük olmalıdır
ur: نوٹ کی قیمت 0 سے زیادہ ہونی چاہئے۔
zh_cn: 音符值必须大于0。

source: swing
ja: スイング
mr: स्विंग
te: స్వింగ్
ur: سوئنگ
zh_cn: 摇摆

source: swing value
es: valor de swing
fr: valeur du swing
ja: スイングの数値
mr: स्विंग मूल्य
pt: valor do swing
te: స్వింగ్ విల్యూ
tr: salınım değeri
ur: سوئنگ ویلیو
zh_cn: 摆动值

source: The Skip notes block will cause notes to be skipped.
es: El bloque Omitir notas hará que las notas se omitan.
fr: Le bloc Sauter des notes fera que des notes seront sautées.
mr: स्किप नोट्स ब्लॉक नोट्स वगळण्यास कारणीभूत ठरेल.
pt: O bloco Ignorar notas fará com que as notas sejam ignoradas.
te: స్కిప్ నోట్స్ బ్లాక్ నోట్లను విడిపిస్తుంది.
tr: notları atla bloğu notların atlanmasına neden olur
ur: اسکیپ نوٹ بلاک نوٹوں کو چھوڑ دینے کا سبب بنے گا۔
zh_cn: Skip notes 块会导致音符被跳过。

source: skip notes
es: saltar notas
fr: sauter des notes
ja: 音符の省略
mr: नोट्स वगळा
pt: pular notas
te: స్కిప్ నోట్స్
tr: notları atla
ur: نوٹ چھوڑ دیں
zh_cn: 跳过音符

source: multiply note value
es: ritmo multiplican
fr: multiplier la valeur de la note
ja: 音価を～倍にするファクター
mr: नोंद मूल्य गुणाकार
pt: multiplicar valor da nota
te: నోట్ విల్యూను ఎటువంటిని గట్టిగా పెరగండి, ఉదా. ఫ్యాక్టర్ 2 ని ఉపయోగించి 1/4 ను 1/8 నోట్లకు మార్చండి.
tr: nota değerini çarp
ur: ضرب نوٹ کی قیمت
zh_cn: 倍乘音符值

source: The Tie block works on pairs of notes, combining them into one note.
es: El bloque Atar funciona en pares de notas, combinándolas en una sola nota.
fr: Le bloc Lier fonctionne sur des paires de notes, les combinant en une seule note.
hi: टाई ब्लॉक नोट्स के जोड़ों पर काम करता है, उन्हें एक नोट में मिलाकर।
ja: <h2>タイブロック</h2><br>２つの音をつなげて１つの音にする。「音の高さブロック」を入れて使う。同じ高さの音だけ、つなぐことができる。
mr: टाय ब्लॉक नोट्सच्या जोड्यांवर काम करतो, त्यांना एका नोटमध्ये एकत्र करतो.
pt: O bloco Laço funciona em pares de notas, combinando-as em uma nota.
te: టై బ్లాక్ ద్వయాన్ని పనులను మిలకుగా వాటిని ఒక నోట్గా కలిగిస్తుంది.
tr: bağ bloğu nota çiftleri üzerinde çalışarak onları tek bir notada birleştirir
ur: ٹائی بلاک نوٹوں کے جوڑے پر کام کرتا ہے ، اور انہیں ایک نوٹ میں جوڑتا ہے۔
zh_cn: Tie 块作用于成对的音符，将它们合并为一个音符。

source: tie
es: atar
fr: lier
hi: टाई
ja: タイ
mr: टाय
pt: juntar
te: బంధించు
tr: bağ
ur: ٹائی
zh_cn: 连音

source: dot
es: punto
fr: point
hi: डॉट
ja: 付点音符
mr: डॉट
pt: ponto
te: డాట్
tr: nokta
ur: ڈاٹ
zh_cn: 附点

source: An argument of -1 results in a note value of 0.
es: Un argumento de -1 da como resultado un valor de nota de 0.
fr: Un argument de -1 résulte en une valeur de note de 0.
hi: -1 का एक तर्क एक नोट मूल्य का परिणाम होता है।
ja: ー１は０の音価にします
mr: -1 चे आर्ग्युमेंट 0 चे नोट मूल्य देते.
pt: Um argumento de -1 resulta em um valor de nota de 0.
te: ఆర్గ్యుమెంట్ -1 యొక్క పరిణామంగా 0 యొక్క నోట్ విల్యూ ఉంటుంది.
ur: -1 کی دلیل کے نتیجے میں 0 کی نوٹ ویلیو ہوتی ہے۔
zh_cn: 参数为 -1 会导致音符值为 0。

source: The Dot block extends the duration of a note by 50%.
es: El bloque Punto extiende la duración de una nota en un 50%.
fr: Le bloc Point prolonge la durée d'une note de 50%.
hi: डॉट ब्लॉक एक नोट की अवधि को 50% बढ़ाता है।
mr: डॉट ब्लॉक नोटची कालावधी 50% ने वाढवतो.
pt: O bloco Ponto aumenta a duração de uma nota em 50%.
te: డాట్ బ్లాక్ నోట్ యొక్క కాలాన్ని 50% పెంచిద్దాం.
tr: nokta bloğu bir notanın süresini %50 uzatır
ur: ڈاٹ بلاک ایک نوٹ کی مدت میں 50٪ تک توسیع کرتا ہے۔
zh_cn: Dot 块将音符时值延长50%。

source: Eg a dotted quarter note will play for 3/8 (1/4 + 1/8) of a beat.
es: Por ejemplo, una nota de un cuarto de puntos se reproducirá a 3/8 (1/4 + 1/8) de un tiempo.
fr: Par exemple, une noire pointée jouera pendant 3/8 (1/4 + 1/8) d'un temps.
hi: उदा, एक डॉटेड क्वार्टर नोट 3/8 (1/4 + 1/8) बीट के लिए बजेगा।
mr: उदा. डॉट केलेली तिमाही नोट 3/8 (1/4 + 1/8) बीटसाठी वाजेल.
pt: Por exemplo, uma semínima pontuada será reproduzida por 3/8 (1/4 + 1/8) de uma batida.
te: ఉదా, ఒక డాట్ క్వార్టర్ నోట్ బీట్ కి 3/8 (1/4 + 1/8) ప్రకారం ప్రదర్శించబడుతుంది.
tr: i (1/4 + 1/8) kadar çalacaktır. (Bağlam: örneğin noktalı bir dörtlük nota bir vuruşun 3/8
ur: مثال کے طور پر ایک ڈاٹڈ کوارٹر نوٹ 3/8 (1/4 + 1/8) کے لئے کھیلے گا۔
zh_cn: 例如，附点四分音符的时值为3/8拍（1/4 + 1/8）。

source: note value drum
es: Valor de nota tambor
fr: valeur de note pour tambour
hi: नोट मूल्य ड्रम
ja: 音符（ドラム）
mr: ड्रम साठी नोट मूल्य ब्लॉक
pt: valor da nota da bateria
te: నోటు విలువ డ్రమ్
tr: nota değeri tamburu
ur: نوٹ ویلیو ڈرم
zh_cn: 音符值鼓

source: 392 hertz
hi: 392 हर्ट्ज
ja: ３９２ヘルツ
mr: 392 हर्ट्झ
te: 392 హెర్ట్జ్
ur: 392 ہرٹز
zh_cn: 392 赫兹

source: The Note block is a container for one or more Pitch blocks.
es: El bloque Nota es un contenedor para uno o más bloques de tono.
fr: Le bloc Note est un conteneur pour un ou plusieurs blocs de hauteur.
hi: नोट ब्लॉक एक या एक से अधिक पिच ब्लॉक के लिए एक कंटेनर है।
ja: <h2>音符（おんぷ）ブロック</h2><br>音の長さと高さをせっていする。長さを決め、「音の高さブロック」を入れて使う。
mr: नोंद ब्लॉक एक किंवा अधिक पिच ब्लॉक्ससाठी कंटेनर आहे.
pt: O bloco Notas é um contêiner para um ou mais blocos de tom.
te: నోటు బ్లాక్ ఒక లేదా ఎక్కువ పిచ్ బ్లాక్ల కోసం ఒక కంటెయినర్ ఉంది.
tr: nota bloğu bir veya daha fazla perde bloğu için bir konteynerdir
ur: نوٹ بلاک ایک یا زیادہ پچ بلاکس کے لئے کنٹینر ہے۔
zh_cn: Note 块是一个或多个 Pitch 块的容器。

source: The Note block specifies the duration (note value) of its contents.
es: El bloque Notas especifica la duración (valor de la nota) de su contenido.
fr: Le bloc Note spécifie la durée (valeur de la note) de son contenu.
hi: नोट ब्लॉक अपने सामग्री की अवधि (नोट मूल्य) को निर्दिष्ट करता है।
ja: <br><br>「音の高さブロック」を２つ以上入れると、音を同時に出すことができる。
mr: नोंद ब्लॉक त्याच्या सामग्रीचा कालावधी (नोंद मूल्य) निर्दिष्ट करतो.
pt: O bloco Nota especifica a duração (valor da nota) de seu conteúdo.
te: నోటు బ్లాక్ అన్ని విషయాల కోసం విలువ (నోటు విలువ) ని నిర్దిష్టం చేస్తుంది.
tr: nota bloğu
ur: نوٹ بلاک اپنے مندرجات کی مدت (نوٹ ویلیو) کی وضاحت کرتا ہے۔
zh_cn: Note 块指定其内容的时值（音符值）。

source: value2
es: valor
fr: valeur2
hi: मूल्य2
ja: 長さ
mr: मूल्य2
pt: valor2
te: విలువ2
tr: değer2
ur: ویلیو 2
zh_cn: 值2

source: define frequency
es: definir frecuencia
fr: définir la fréquence
hi: फ़्रीक्वेंसी को परिभाषित करें
ja: 周波数を明確にする
mr: वारंवारता परिभाषित करा
pt: Definir frequência
te: ఫ్రిక్వెన్సీని నిర్వచించండి
tr: frekansı tanımla
ur: تعدد کی وضاحت کریں
zh_cn: 定义频率

source: octave space
es: espacio de octava
fr: espace d'octave
hi: ऑक्टेव स्थान
ja: オクターヴ・スペース
mr: ऑक्टेव्ह स्पेस
pt: espaço oitava
te: ఆక్టేవ్ స్పేస్
tr: oktav alanı
ur: آکٹیو اسپیس
zh_cn: 八度空间

source: number of notes
es: número de notas
fr: nombre de notes
hi: नोटों की संख्या
ja: 音符の数
mr: नोट्सची संख्या
pt: número de notas
te: గానాల సంఖ్య
tr: nota sayısı
ur: نوٹ کی تعداد
zh_cn: 音符数量

source: polyphonic rhythm
es: ritmo polifónico
fr: rythme polyphonique
hi: बहुस्वर ताल
ja: ポリリズム
mr: पॉलीफोनिक रिदम
pt: ritmo polifônico
te: బహువాదీ రిదం
tr: polifonik ritim
ur: پولی فونک تال
zh_cn: 复音节奏

source: The Rhythm block is used to generate rhythm patterns.
es: El bloque Ritmo se utiliza para generar patrones de ritmo.
fr: Le bloc Rythme est utilisé pour générer des motifs rythmiques.
hi: रिद्धम ब्लॉक का उपयोग ताल पैटर्न बनाने के लिए किया जाता है।
ja: <h2>連符（れんぷ）ブロック（かけ算）</h2><br>まとまったいくつかの音符（おんぷ）。一定の長さの音を３つや５つなどくり返して使う。３連符（れんぷ）や５連符（れんぷ）など、２の倍数ではない音符（おんぷ）の数でグループを作りやすくなる。
mr: रिदम ब्लॉक रिदम पॅटर्न तयार करण्यासाठी वापरला जातो.
pt: O bloco Ritmo é usado para gerar padrões de ritmo.
te: రిదం బ్లాక్ రిదం నమూనాలను ఉత్పత్తి చేయడానికి ఉపయోగపడుతుంది.
tr: ritim bloğu ritim kalıpları oluşturmak için kullanılır
ur: تال بلاک تال کے نمونے تیار کرنے کے لئے استعمال ہوتا ہے۔
zh_cn: Rhythm 块用于生成节奏模式。

source: 1/64 note
es: 1/64 nota
fr: note 1/64
hi: 1/64 नोट
ja: ６４分音符
mr: 1/64 नोट
pt: nota 1/64
te: 1/64 నోట్
tr: 1/64 nota
ur: 1/64 نوٹ
zh_cn: 六十四分音符

source: 1/32 note
es: 1/32 nota
fr: note 1/32
hi: 1/32 नोट
ja: ３２分音符
mr: 1/32 नोट
pt: nota 1/32
te: 1/32 నోట్
tr: 1/32 nota
ur: 1/32 نوٹ
zh_cn: 三十二分音符

source: 1/16 note
es: 1/16 nota
fr: note 1/16
hi: 1/16 नोट
ja: １６分音符
mr: 1/16 नोट
pt: nota 1/16
te: 1/16 నోట్
tr: 1/16 nota
ur: 1/16 نوٹ
zh_cn: 十六分音符

source: eighth note
es: 1/8 nota
fr: croche
hi: आठवीं नोट
ja: ８分音符
mr: आठवी नोट
pt: uma oitava de nota
te: ఎనిమిదవ నోట్
tr: sekizinci nota
ur: آٹھویں نوٹ
zh_cn: 八分音符

source: quarter note
es: 1/4 nota
fr: noire
hi: क्वॉर्टर नोट
ja: ４分音符
mr: चतुर्थांश नोट
pt: um quarto de nota
te: క్వార్టర్ నోట్
tr: çeyrek nota
ur: سہ ماہی نوٹ
zh_cn: 四分音符

source: half note
es: 1/2 nota
fr: blanche
hi: हाफ नोट
ja: ２分音符
mr: अर्धी नोट
pt: meia nota
te: అర్ధం నోట్
tr: yarım nota
ur: آدھا نوٹ
zh_cn: 二分音符

source: whole note
es: nota completa
fr: ronde
hi: पूरा नोट
ja: 全音符
mr: पूर्ण नोट
pt: nota inteira
te: పూర్ణ నోట్
tr: bütün nota
ur: پورا نوٹ
zh_cn: 全音符

source: tuplet
hi: टुपलेट
ja: ～連符（タプル）
mr: टुपलेट
te: ట్యూప్లెట్
ur: ٹیپلیٹ
zh_cn: 复音符组

source: septuplet
es: septeto
hi: सेप्टुप्लेट
ja: ７連符
mr: सेप्टुपलेट
pt: sexteto
te: సెప్ట్యూప్లెట్
tr: yedili
ur: سیپٹوپلیٹ
zh_cn: 七连音

source: quintuplet
es: quinteto
hi: क्विंटुप्लेट
ja: ５連符
mr: क्विंटुपलेट
pt: quinteto
te: క్వింట్యూప్లెట్
tr: beşli
ur: کوئنٹ اپلیٹ
zh_cn: 五连音

source: triplet
es: trillizo
fr: triolet
hi: त्रैपलेट
ja: ３連符
mr: ट्रिपलेट
pt: trio
te: ట్రిప్లెట్
tr: üçlü
ur: ٹرپلٹ
zh_cn: 三连音

source: simple tuplet
es: tuplet simple
fr: tuplet simple
hi: साधा टुपलेट
ja: 連符（わり算）
mr: साधी टुपलेट
pt: tuplet simples
te: సాధారణ ట్యూప్లెట్
tr: basit tuplet
ur: سادہ ٹیپلیٹ
zh_cn: 简单复拍

source: Tuplets are a collection of notes that get scaled to a specific duration.
es: Tuplets son una colección de notas que se escalan a una duración específica.
fr: Les tuplets sont une collection de notes qui sont mises à l'échelle pour une durée spécifique.
hi: टुपलेट्स एक ऐसे समय की निर्दिष्ट अवधि के लिए स्केल करने वाले नोट्स का संग्रह होते हैं।
ja: <h2>連符（れんぷ）ブロック（わり算）</h2><br>まとまったいくつかの音符（おんぷ）。一定の長さの音を３つや５つに等分して使う。
mr: टुपलेट्स हे नोट्सचे एक संग्रह आहेत जे एका विशिष्ट कालावधीत प्रमाणित केले जातात.
pt: Os Tuplets são uma coleção de notas que são escaladas para uma duração específica.
te: ట్యూప్లెట్లు ఒక నిర్దిష్ట కాలకోణానికి పెరిగిపోయి ఉంటాయి.
tr: tupletler
ur: ٹیپلیٹس نوٹوں کا ایک مجموعہ ہیں جو ایک مخصوص مدت تک کم ہوجاتے ہیں۔
zh_cn: 复拍是一组被缩放到特定时值的音符。

source: The Backward block runs code in reverse order (Musical retrograde).
es: El bloque Atrás ejecuta el código en orden inverso (retrógrado en la música).
fr: Le bloc Arrière exécute le code en ordre inverse (rétrograde musical).
hi: बैकवर्ड ब्लॉक कोड को उल्टे क्रम में चलाता है (संगीत रेट्रोग्रेड)।
ja: <h2>実行ブロック（ぎゃく実行）</h2><br>はさまれているブロックを、つうじょうとはぎゃくの順じょで、下から上に向かって実行する。
mr: बॅकवर्ड ब्लॉक कोड उलट क्रमाने चालवतो (संगीतमधील रेट्रोग्रेड).
pt: O bloco Retroceder executa o código na ordem inversa (retorno musical).
te: బ్యాక్వర్డ్ బ్లాక్ కోడ్ను ప్రతిపక్ష క్రమంలో అమలు చేస్తుంది (సంగీత రెట్రోగ్రేడ్).
tr: geriye doğru blok kodu ters sırada çalıştırır (müzikal retrograd)
ur: بیکورڈ بلاک ریورس آرڈر (میوزیکل ریٹروگریڈ) میں کوڈ چلاتا ہے۔
zh_cn: Backward 块按相反顺序运行代码（音乐倒行）。

source: backward
es: hacia atrás
fr: arrière
hi: विपरीतक्रम
ja: ぎゃく向きに実行
mr: उलट
pt: para trás
te: ప్రతిపక్షం
tr: geriye doğru
ur: پسماندہ
zh_cn: 后退

source: The Duplicate block will run each block multiple times.
es: El bloque Duplicado ejecutará cada bloque varias veces.
fr: Le bloc Dupliquer exécutera chaque bloc plusieurs fois.
hi: डुप्लीकेट ब्लॉक प्रत्येक ब्लॉक को कई बार चलाएगा।
mr: डुप्लिकेट ब्लॉक प्रत्येक ब्लॉक अनेक वेळा चालवेल.
pt: O bloco Duplicar executará cada bloco múltiplas vezes.
te: డ్యూప్లికేట్ బ్లాక్ ప్రతి బ్లాక్ను అనేకసారి అమలు చేస్తుంది.
tr: yinelenen blok her bloğu birden çok kez çalıştıracaktır
ur: ڈپلیکیٹ بلاک ہر بلاک کو متعدد بار چلائے گا۔
zh_cn: Duplicate 块将多次运行每个块。
