Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Return block will return a value from an action.
es: El bloque Volver (Return) devolverá un valor de una acción.
fr: Le bloc Retour renverra une valeur à partir d'une action.
hi: रिटर्न ब्लॉक एक क्रिया से मूल्य लौटाएगा।
mr: रिटर्न ब्लॉक कृतीतून एक मूल्य परत करेल.
pt: O bloco Retornar retornará um valor de uma ação.
te: రిటర్న్ బ్లాక్ యాక్షను నుండి విలువ తిరిగి అందిస్తుంది.
tr: return bloğu bir eylemden bir değer döndürecektir
ur: ریٹرن بلاک ایک عمل سے ایک قدر واپس کرے گا۔
zh_cn: Return块将从一个动作返回一个值。

source: return
es: retorno
fr: retour
hi: लौटाएं
ja: リターン
mr: परत
pt: retornar
te: రిటర్న్
tr: geri dönüş
ur: واپسی
zh_cn: 返回

source: The Return to URL block will return a value to a webpage.
es: El bloque Volver a URL devolverá un valor a una página web.
fr: Le bloc Retour à URL renverra une valeur à une page web.
hi: रिटर्न टू यूआरएल ब्लॉक एक मूल्य को एक वेबपेज को लौटाएगा।
mr: रिटर्न टू URL ब्लॉक वेबपेजला एक मूल्य परत करेल.
pt: O bloco Retornar para URL retornará um valor para uma página da Internet.
te: రిటర్న్ టు URL బ్లాక్ ఒక విలువను వెబ్పేజీకి తిరిగి అందిస్తుంది.
tr: return to url bloğu bir web sayfasına bir değer döndürecektir
ur: یو آر ایل پر واپسی بلاک ویب صفحہ پر ایک قدر واپس کرے گا۔
zh_cn: Return to URL块将值返回到网页。

source: return to URL
es: retorno a URL
fr: retour à URL
hi: यूआरएल पर लौटाएं
ja: URLに戻ります
mr: URL वर परत
pt: retornar para URL
te: URL కి ఫంక్షన్ నుండి విలువ తిరిగి అందిస్తుంది
tr: url'ye dön
ur: یو آر ایل پر واپس جائیں۔
zh_cn: 返回到URL

source: The Calculate block returns a value calculated by an action.
es: El bloque Calcular devuelve un valor calculado por una acción.
fr: Le bloc Calculer renvoie une valeur calculée par une action.
hi: कैलक्यूलेट ब्लॉक एक क्रिया द्वारा गणना किए गए मूल्य को लौटाता है।
mr: कॅल्क्युलेट ब्लॉक कृतीद्वारे गणना केलेले मूल्य परत करतो.
pt: O bloco Calcular retorna um valor calculado por uma ação.
te: కాలక్యూలేట్ బ్లాక్ ఒక యాక్షన్ ద్వారా కలిగిన ఒక విలువను తిరిగి అందిస్తుంది.
tr: calculate bloğu bir eylem tarafından hesaplanan bir değer döndürür
ur: کیلکولیٹ بلاک ایک عمل کے ذریعے شمار کی جانے والی قدر لوٹاتا ہے۔
zh_cn: Calculate块返回一个动作计算的值。

source: calculate
es: calcular
fr: calculer
hi: गणना
ja: 計算する
mr: गणना करा
pt: calcular
te: కాలక్యూలేట్
tr: hesaplamak
ur: حساب لگانا
zh_cn: 计算

source: The Do block is used to initiate an action.
es: El bloque Hacer se utiliza para iniciar una acción.
fr: Le bloc Faire est utilisé pour initier une action.
hi: डू ब्लॉक का उपयोग क्रिया आरंभ करने के लिए किया जाता है।
ja: <h2>アクションブロック（指定）</h2><br>指定したアクションブロックを実行する。
mr: डू ब्लॉक एक कृती आरंभ करण्यासाठी वापरला जातो.
pt: O bloco Agir é usado para iniciar uma ação.
te: డూ బ్లాక్ ఒక యాక్షన్ను ప్రారంభించడానికి ఉపయోగిస్తారు.
tr: do bloğu bir eylem başlatmak için kullanılır
ur: ڈو بلاک ایک کارروائی شروع کرنے کے لیے استعمال ہوتا ہے۔
zh_cn: Do块用于启动一个动作。

source: The Arg block contains the value of an argument passed to an action.
es: El bloque Arg contiene el valor de un argumento pasado a una acción.
fr: Le bloc Arg contient la valeur d'un argument passé à une action.
hi: आर्ग ब्लॉक में एक क्रिया को पारित किए गए एक तर्क का मूल्य होता है।
mr: आर्ग ब्लॉक कृतीला पास झालेल्या आर्ग्युमेंटचे मूल्य समाविष्ट करतो.
pt: O bloco Arg contém o valor de um argumento passado a uma ação.
te: ఆర్గ్ బ్లాక్ యాక్షన్ కి పాసు చేయబడిన ఆర్గ్యుమెంట్ యొక్క విలువను కలిగి ఉంది.
tr: arg bloğu bir eyleme aktarılan bir bağımsız değişkenin değerini içerir
ur: آرگ بلاک میں کسی عمل کو بھیجی گئی دلیل کی قدر ہوتی ہے۔
zh_cn: Arg块包含传递给动作的参数值。

source: Invalid argument
es: argumento no válido
fr: Argument invalide
hi: अवैध तर्क
ja: 無効な議論
mr: अवैध आर्ग्युमेंट
pt: Argumento inválido
te: చెల్లని ఆర్గ్యుమెంట్
tr: geçersiz argüman
ur: غلط دلیل
zh_cn: 无效参数

source: In the example, it is used with the One of block to choose a random phase.
es: En el ejemplo, se usa con el bloque Uno para elegir una fase aleatoria.
fr: Dans l'exemple, il est utilisé avec le bloc One of pour choisir une phase aléatoire.
hi: उदाहरण में, यह वन ऑफ ब्लॉक के साथ एक यादृच्छिक चरण चयन करने के लिए उपयोग किया गया है।
ja: <br><br>図の例は、決まったアクションではなく、２つのうちどちらか１つのアクションをランダムに実行させる。
mr: उदाहरणात, ते एक रँडम फेज निवडण्यासाठी वन ऑफ ब्लॉकसह वापरले जाते.
pt: No exemplo, é usado com o bloco Um para escolher aleatoriamente uma fase.
te: ఉదాహరణకు, ఇది ఒక యాదృచ్ఛిక దశని ఎంపికొండితో ఉపయోగిస్తారు.
tr: örnekte
ur: مثال میں، یہ ایک بے ترتیب مرحلے کا انتخاب کرنے کے لیے ون آف بلاک کے ساتھ استعمال ہوتا ہے۔
zh_cn: 在示例中，它与One of块一起使用以选择随机阶段。

source: The Listen block is used to listen for an event such as a mouse click.
es: El bloque de escucha se usa para escuchar un evento como un clic del ratón.
fr: Le bloc Listen est utilisé pour écouter un événement tel qu'un clic de souris.
hi: लिसन ब्लॉक का उपयोग एक घटना के लिए सुनने के लिए किया जाता है, जैसे कि माउस क्लिक।
ja: <h2>イベントブロック（受け取り）</h2><br>特定のイベントに対して、その発生を受け取るたびに実行するアクションを１つ決めておくことができる。
mr: लिसन ब्लॉक माउस क्लिकसारख्या इव्हेंटसाठी ऐकण्यासाठी वापरला जातो.
pt: O bloco Ouvir é usado para escutar um evento, como um clique do mouse.
te: శ్రవించడానికి గుండాపోతం మొదలు పెట్టడానికి లిస్టెన్ బ్లాక్ ఉపయోగిస్తారు.
tr: listen bloğu fare tıklaması gibi bir olayı dinlemek için kullanılır
ur: سننے والے بلاک کو ماؤس کلک جیسے ایونٹ کو سننے کے لیے استعمال کیا جاتا ہے۔
zh_cn: Listen块用于监听事件，例如鼠标点击。

source: When the event happens, an action is taken.
es: Cuando ocurre el evento, se realiza una acción.
fr: Lorsque l'événement se produit, une action est déclenchée.
hi: जब घटना होती है, तो क्रिया की जाती है।
ja: <br><br>イベントの発生は、各スクリプトが【イベントのたびにアクション】で指定したアクションの引きがねとしてはたらく。
mr: इव्हेंट घडल्यावर, एक कृती केली जाते.
pt: Quando o evento acontece, uma ação é executada.
te: ఈ ఘటన జరగానే, ఒక యాక్షన్ ప్రారంభిస్తారు.
tr: olay gerçekleştiğinde
ur: جب واقعہ ہوتا ہے، ایک کارروائی کی جاتی ہے.
zh_cn: 当事件发生时，会执行一个动作。

source: on
es: cuando
fr: sur
hi: पर
ja: のとき
mr: ऑन
pt: ligado
te: పై
tr: açık
ur: پر
zh_cn: 开启

source: event
es: señal
fr: événement
hi: घटना
ja: イベント
mr: इव्हेंट
pt: evento
te: ఇవెంట్
tr: olay
ur: واقعہ
zh_cn: 事件

source: The Broadcast block is used to trigger an event.
es: El bloque Emitir se utiliza para desencadenar un evento.
fr: Le bloc Broadcast est utilisé pour déclencher un événement.
hi: ब्रॉडकास्ट ब्लॉक एक घटना को ट्रिगर करने के लिए किया जाता है।
ja: <h2>イベントブロック（発生）</h2><br>指定した名前のイベントをすべてのネズミに送る。イベントの発生は、各スクリプトが【イベントのたびにアクション】で指定したアクションの引きがねとしてはたらく。
mr: ब्रॉडकास्ट ब्लॉक इव्हेंट ट्रिगर करण्यासाठी वापरला जातो.
pt: O bloco Emitir é usado para acionar um evento.
te: ఇవెంట్ను ప్రేరేపించడానికి బ్రాడ్కాస్ట్ బ్లాక్ ఉపయోగిస్తారు.
tr: yayın bloğu bir olayı tetiklemek için kullanılır
ur: براڈکاسٹ بلاک کسی ایونٹ کو متحرک کرنے کے لیے استعمال ہوتا ہے۔
zh_cn: Broadcast块用于触发事件。

source: broadcast
es: emitir
fr: diffuser
hi: प्रसारण
ja: イベント発生
mr: प्रसारण
pt: transmissão
te: బ్రాడ్కాస్ట్
tr: yayın
ur: نشر
zh_cn: 广播

source: Each Start block is a separate voice.
es: Cada bloque de inicio es una voz separada.
fr: Chaque bloc Start est une voix distincte.
hi: प्रत्येक स्टार्ट ब्लॉक एक अलग आवाज है।
ja: <h2>スタートブロック</h2><br>実行ボタンがおされると、スタートブロックが実行される。
mr: प्रत्येक स्टार्ट ब्लॉक वेगळी आवाज आहे.
pt: Cada bloco Iniciar é uma voz separada.
te: ప్రతి ప్రారంభ బ్లాక్ ఒక విశిష్ట ధ్వని.
tr: her bir başlangıç bloğu ayrı bir sestir
ur: ہر اسٹارٹ بلاک ایک الگ آواز ہے۔
zh_cn: 每个Start块是一个独立的声音。

source: It is often used for storing a phrase of music that is repeated.
es: A menudo se utiliza para almacenar una frase de música que se repite.
fr: Il est souvent utilisé pour stocker une phrase musicale qui est répétée.
hi: इसे अक्सर एक बार फिराया जाने वाले संगीत के वाक्य को स्टोर करने के लिए उपयोग किया जाता है।
ja: <br><br>何度も実行する音楽のフレーズなどにアクションを作っておくと便利。
mr: ते पुनरावृत्ती होणारी संगीताची वाक्यांश साठवण्यासाठी वापरली जाते.
pt: É freqüentemente usado para armazenar uma frase de música que é repetida.
te: అది చిక్కగా ప్రతిపాదన చేసే సంగీతం యొక్క పదాన్ని నిల్వించడానికి సామాన్యంగా ఉపయోగిస్తారు.
tr: genellikle tekrarlanan bir müzik cümlesini saklamak için kullanılır
ur: یہ اکثر موسیقی کے فقرے کو ذخیرہ کرنے کے لیے استعمال ہوتا ہے جسے دہرایا جاتا ہے۔
zh_cn: 它通常用于存储重复的音乐短语。

source: define temperament
es: definir el temperamento
fr: définir le tempérament
hi: ताम्बुल निर्धारित करें
ja: 音律を明確にする
mr: स्वभाव परिभाषित करा
pt: definir temperamento
te: నిర్ణయించు స్వభావం
tr: mizacı tanımlamak
ur: مزاج کی وضاحت کریں
zh_cn: 定义律制

source: mouse index heap
es: valor en la pila de ratón
fr: tas d'index de la souris
hi: माउस सूची भंडार
ja: ネズミヒープに番号をふる
mr: माऊस इंडेक्स हीप
te: మౌస్ సూచి హీప్
tr: fare dizin yığını
ur: ماؤس انڈیکس کا ڈھیر
zh_cn: 鼠标索引堆

source: turtle index heap
es: valor en la pila de tortuga
fr: tas d'index de la tortue
hi: टर्टल सूची भंडार
ja: タートル ヒープに番号をふる
mr: कासव इंडेक्स हीप
te: టర్టిల్ సూచి హీప్
tr: turtle dizin yığını
ur: کچھی انڈیکس کا ڈھیر
zh_cn: 乌龟索引堆

source: The Mouse index heap block returns a value in the heap at a specified location for a specified mouse.
es: El bloque de valor en la pila de ratón devuelve un valor en el almacenamiento dinámico en una ubicación específica para un mouse específico.
fr: Le bloc Tas d'index de la souris renvoie une valeur dans le tas à un emplacement spécifié pour une souris spécifiée.
hi: माउस इंडेक्स हीप ब्लॉक एक निर्दिष्ट स्थान पर एक निर्दिष्ट माउस के लिए हीप में एक मूल्य लौटाता है।
mr: माऊस इंडेक्स हीप ब्लॉक निर्दिष्ट माऊससाठी निर्दिष्ट स्थानावर हीपमधील एक मूल्य परतवतो.
te: మౌస్ సూచి హీప్ బ్లాక్ ఒక నిర్దిష్ట స్థానంలో నిర్దిష్ట మౌస్ కోసం హీప్లో విలువను తరిస్తుంది.
tr: fare dizini yığın bloğu
ur: ماؤس انڈیکس ہیپ بلاک مخصوص ماؤس کے لیے مخصوص جگہ پر ہیپ میں ایک قدر واپس کرتا ہے۔
zh_cn: Mouse索引堆块返回指定鼠标在堆中指定位置的值。

source: The Turtle index heap block returns a value in the heap at a specified location for a specified turtle.
es: El bloque de valor en la pila de tortuga devuelve un valor en el almacenamiento dinámico en una ubicación específica para un mouse específico.
fr: Le bloc Tas d'index de la tortue renvoie une valeur dans le tas à un emplacement spécifié pour une tortue spécifiée.
hi: टर्टल इंडेक्स हीप ब्लॉक एक निर्दिष्ट स्थान पर एक निर्दिष्ट कछुआ के लिए हीप में एक मूल्य लौटाता है।
mr: कासव इंडेक्स हीप ब्लॉक निर्दिष्ट कासवासाठी निर्दिष्ट स्थानावर हीपमधील एक मूल्य परतवतो.
te: టర్టిల్ సూచి హీప్ బ్లాక్ ఒక నిర్దిష్ట స్థానంలో నిర్దిష్ట టర్టిల్ కోసం హీప్లో విలువను తరిస్తుంది.
tr: the turtle index heap bloğu
ur: ٹرٹل انڈیکس ہیپ بلاک مخصوص کچھوے کے لیے مخصوص جگہ پر ہیپ میں ایک قدر واپس کرتا ہے۔
zh_cn: Turtle索引堆块返回指定乌龟在堆中指定位置的值。

source: Yertle
hi: यर्टल
ja: ヤートル
mr: यर्टल
te: యర్టెల్
ur: یرٹل

source: mouse name
es: renombrar ratón
fr: nom de la souris
hi: माउस नाम
ja: ネズミの名前
mr: माऊसचे नाव
pt: nome do ratinho
te: మౌస్ పేరు
tr: fare adı
ur: ماؤس کا نام
zh_cn: 鼠标名称

source: turtle name
es: renombrar tortuga
fr: nom de la tortue
hi: कछुआ नाम
ja: ネズミの名前
mr: कासवाचे नाव
pt: nome da tartaruga
te: టర్టిల్ పేరు
tr: kaplumbağa adı
ur: کچھوے کا نام
zh_cn: 乌龟名称

source: stop mouse
es: parar ratón
fr: arrêter la souris
hi: माउस रोकें
ja: ネズミを止める
mr: माऊस थांबवा
pt: parar ratinho
te: మౌస్ ఆపుకోండి
tr: fareyi durdur
ur: ماؤس کو روکو
zh_cn: 停止鼠标

source: The Stop mouse block stops the specified mouse.
es: El bloque parar ratón parar el ratón especificado.
fr: Le bloc Arrêter la souris arrête la souris spécifiée.
hi: स्पष्ट किए गए माउस को रोक देता है।
mr: स्टॉप माऊस ब्लॉक निर्दिष्ट माऊस थांबवतो.
pt: O bloco Parar ratinho para o ratinho especificado.
te: నిర్దిష్టమైన మౌస్‌ను ఆపుకోసం స్టాప్ మౌస్ బ్లాక్.
tr: stop mouse bloğu belirtilen fareyi durdurur
ur: اسٹاپ ماؤس بلاک مخصوص ماؤس کو روکتا ہے۔
zh_cn: 停止鼠标块停止指定的鼠标。

source: stop turtle
es: detener tortuga
fr: arrêter la tortue
hi: टर्टल रोकें
ja: ネズミを止める
mr: कासव थांबवा
pt: parar tartaruga
te: టర్టిల్ ఆపుకోండి
tr: kaplumbağayı durdur
ur: کچھی کو روکو
zh_cn: 停止乌龟

source: The Stop turtle block stops the specified turtle.
es: El bloque parar tortuga parar el ratón especificado.
fr: Le bloc Arrêter la tortue arrête la tortue spécifiée.
hi: स्पष्ट किए गए कछुए को रोक देता है।
mr: स्टॉप कासव ब्लॉक निर्दिष्ट कासव थांबवतो.
te: నిర్దిష్టమైన టర్టిల్‌ను ఆపుకోసం స్టాప్ టర్టిల్ బ్లాక్.
tr: stop turtle bloğu belirtilen kaplumbağayı durdurur
ur: اسٹاپ ٹرٹل بلاک مخصوص کچھوے کو روکتا ہے۔
zh_cn: 停止乌龟块停止指定的乌龟。

source: Cannot find mouse
es: No se puede encontrar ratón
fr: Impossible de trouver la souris
hi: माउस नहीं मिल सकता
ja: ネズミが見つかりません。
mr: माऊस सापडत नाही
pt: Não foi possível encontrar o ratinho
te: మౌస్ కనబడదు
tr: fare bulunamıyor
ur: ماؤس نہیں مل سکتا
zh_cn: 找不到鼠标

source: Cannot find turtle
es: No se puede encontrar tortuga.
fr: Impossible de trouver la tortue
hi: कछुआ नहीं मिल सकता
ja: タートルが見つかりません。
mr: कासव सापडत नाही
pt: Não foi possível encontrar a tartaruga
te: టర్టిల్ కనబడదు
tr: kaplumbağayı bulamıyor
ur: کچھوا نہیں مل سکتا
zh_cn: 找不到乌龟

source: start mouse
es: comenzar ratón
fr: démarrer la souris
hi: माउस शुरू करें
ja: ネズミをスタート
mr: माऊस सुरू करा
pt: iniciar ratinho
te: మౌస్ ప్రారంభించండి
tr: fareyi başlat
ur: ماؤس شروع کریں
zh_cn: 启动鼠标

source: The Start mouse block starts the specified mouse.
es: El bloque comenzar ratón inicia el ratón especificado.
fr: Le bloc Démarrer la souris démarre la souris spécifiée.
hi: स्पष्ट किए गए माउस को शुरू करता है।
mr: स्टार्ट माऊस ब्लॉक निर्दिष्ट माऊस सुरू करतो.
pt: O bloco Iniciar ratinho inicia o ratinho especificado.
te: నిర్దిష్టమైన మౌస్‌ను ప్రారంభించిస్తుంది.
tr: fare başlat bloğu belirtilen fareyi başlatır
ur: اسٹارٹ ماؤس بلاک مخصوص ماؤس کو شروع کرتا ہے۔
zh_cn: 启动鼠标块启动指定的鼠标。

source: start turtle
es: iniciar tortuga
fr: démarrer la tortue
hi: टरटल चालू करें
ja: ネズミをスタートする
mr: कासव सुरू करा
pt: iniciar tartaruga
te: టర్టిల్ ప్రారంభించండి
tr: kaplumbağa başlat
ur: کچھی شروع کرو
zh_cn: 启动乌龟

source: The Start turtle block starts the specified turtle.
es: El bloque comenzar tortuga inicia el ratón especificado.
fr: Le bloc Démarrer la tortue démarre la tortue spécifiée.
hi: स्टार्ट टरटल ब्लॉक निर्दिष्ट की गई कछुआ को शुरू करता है।
mr: स्टार्ट कासव ब्लॉक निर्दिष्ट कासव सुरू करतो.
te: నిర్దిష్టమైన టర్టిల్‌ను ప్రారంభించిస్తుంది.
tr: start turtle bloğu belirtilen kaplumbağayı başlatır
ur: اسٹارٹ ٹرٹل بلاک مخصوص کچھی کو شروع کرتا ہے۔
zh_cn: 启动乌龟块启动指定的乌龟。

source: Mouse is already running.
es: Ratón ya ha comenzado.
fr: La souris est déjà en cours d'exécution.
hi: माउस पहले से ही चल रहा है।
ja: ネズミはすでに動いています。
mr: माऊस आधीच चालू आहे.
pt: O ratinho está sendo executado.
te: మౌస్ ఇప్పటికే ప్రవర్తిస్తోంది.
tr: fare zaten çalışıyor
ur: ماؤس پہلے ہی چل رہا ہے۔
zh_cn: 鼠标已经在运行。

source: Turtle is already running.
es: Tortuga ya ha comenzado.
fr: La tortue est déjà en cours d'exécution.
hi: टरटल पहले से ही चल रहा है।
ja: タートルはすでに動いています。
mr: कासव आधीच चालू आहे.
pt: A tartaruga está sendo executada.
te: టర్టిల్ ఇప్పటికే ప్రవర్తిస్తోంది.
tr: kaplumbağa zaten koşuyor
ur: کچھوا پہلے ہی چل رہا ہے۔
zh_cn: 乌龟已经在运行。

source: Cannot find start block
es: No se puede encontrar el bloque de inicar.
fr: Impossible de trouver le bloc de démarrage
hi: स्टार्ट ब्लॉक नहीं मिल सकता
ja: 「スタート」ブロックが見つかりません。
mr: प्रारंभ ब्लॉक सापडत नाही
pt: Não foi possível encontrar o bloco iniciar
te: ప్రారంభించడానికి బ్లాక్ కనబడదు
tr: başlangıç bloğunu bulamıyor
ur: کچھ پہلے ہی چل رہا ہے۔
zh_cn: 找不到启动块

source: mouse color
es: color de ratón
fr: couleur de la souris
hi: माउस कलर
ja: ネズミの色
mr: माऊसचा रंग
pt: cor do ratinho
te: మౌస్ రంగు
tr: fare rengi
ur: ماؤس کا رنگ
zh_cn: 鼠标颜色

source: The Mouse color block returns the pen color of the specified mouse.
es: El bloque de color del ratón devuelve el color del lápiz del ratón especificado.
fr: Le bloc Couleur de la souris renvoie la couleur du stylo de la souris spécifiée.
hi: माउस कलर ब्लॉक निर्दिष्ट माउस का पेन कलर वापस करता है।
mr: माऊस रंग ब्लॉक निर्दिष्ट माऊसचा पेन रंग परतवतो.
pt: O bloco cor do Ratinho retorna a cor da caneta do ratinho especificado.
te: నిర్దిష్టమైన మౌస్ కోసం పెన్ రంగును తరిస్తుంది.
tr: fare rengi bloğu belirtilen farenin kalem rengini döndürür
ur: ماؤس کلر بلاک مخصوص ماؤس کا قلمی رنگ لوٹاتا ہے۔
zh_cn: 鼠标颜色块返回指定鼠标的画笔颜色。

source: turtle color
es: color de tortuga
fr: couleur de la tortue
hi: कछुआ कलर
ja: タートルの色
mr: कासवाचा रंग
te: టర్టిల్ రంగు
tr: kaplumbağa rengi
ur: کچھوے کا رنگ
zh_cn: 乌龟颜色

source: The Turtle color block returns the pen color of the specified turtle.
es: El bloque de color de la tortuga devuelve el color del lápiz de la tortuga especificado.
fr: Le bloc Couleur de la tortue renvoie la couleur du stylo de la tortue spécifiée.
hi: कछुआ कलर ब्लॉक निर्दिष्ट कछुए का पेन कलर वापस करता है।
mr: कासव रंग ब्लॉक निर्दिष्ट कासवाचा पेन रंग परतवतो.
te: నిర్దిష్టమైన టర్టిల్ కోసం పెన్ రంగును తరిస్తుంది.
tr: the turtle color bloğu belirtilen kaplumbağanın kalem rengini döndürür
ur: ٹرٹل کلر بلاک مخصوص کچھوے کا قلمی رنگ لوٹاتا ہے۔
zh_cn: 乌龟颜色块返回指定乌龟的画笔颜色。

source: mouse heading
es: rumbo de ratón
fr: direction de la souris
hi: माउस हेडिंग
ja: ネズミの進む角度
mr: माऊस हेडिंग
pt: rumo do ratinho
te: మౌస్ హెడింగ్
tr: fare başlığı
ur: ماؤس کی سرخی
zh_cn: 鼠标朝向

source: The Mouse heading block returns the heading of the specified mouse.
es: El bloque de rumbo del ratón devuelve el rumbo del lápiz del ratón especificado.
fr: Le bloc Direction de la souris renvoie la direction de la souris spécifiée.
hi: माउस हेडिंग ब्लॉक निर्दिष्ट माउस की हेडिंग वापस करता है।
mr: माऊस हेडिंग ब्लॉक निर्दिष्ट माऊसचे शीर्षक परतवतो.
pt: O bloco rumo do Ratinho retorna a orientação do ratinho especificado.
te: నిర్దిష్టమైన మౌస్ కోసం హెడింగ్ ను తరిస్తుంది.
tr: fare başlığı bloğu belirtilen farenin başlığını döndürür
ur: ماؤس ہیڈنگ بلاک مخصوص ماؤس کی سرخی واپس کرتا ہے۔
zh_cn: 鼠标朝向块返回指定鼠标的朝向。

source: turtle heading
es: rumbo de tortuga
fr: direction de la tortue
hi: कछुआ हेडिंग
ja: タートルの進む角度
mr: कासव हेडिंग
te: టర్టిల్ హెడింగ్
tr: kaplumbağa yönü
ur: کچھی کی سرخی
zh_cn: 乌龟朝向

source: The Turtle heading block returns the heading of the specified turtle.
es: El bloque de rumbo de la tortuga devuelve el rumbo del lápiz de la tortuga especificado.
fr: Le bloc Direction de la tortue renvoie la direction de la tortue spécifiée.
hi: कछुआ हेडिंग ब्लॉक निर्दिष्ट कछुए की हेडिंग वापस करता है।
mr: कासव हेडिंग ब्लॉक निर्दिष्ट कासवाचे शीर्षक परतवतो.
te: నిర్దిష్టమైన టర్టిల్ కోసం హెడింగ్‌ను తరిస్తుంది.
tr: the turtle heading bloğu belirtilen kaplumbağanın başlığını döndürür
ur: ٹرٹل ہیڈنگ بلاک مخصوص کچھوے کی سرخی لوٹاتا ہے۔
zh_cn: 乌龟朝向块返回指定乌龟的朝向。

source: set mouse
es: fijar ratón
fr: régler la souris
hi: माउस सेट करें
ja: ネズミを設定
mr: माऊस सेट करा
pt: Definir ratinho
te: మౌస్ స్థానాన్ని సెట్ చేయండి
tr: fareyi ayarla
ur: ماؤس سیٹ کریں
zh_cn: 设置鼠标

source: set turtle
es: fijar tortuga
fr: régler la tortue
hi: कछुआ सेट करें
ja: タートルを設定
mr: कासव सेट करा
te: టర్టిల్ స్థానాన్ని సెట్ చేయండి
tr: kaplumbağa ayarla
ur: کچھی سیٹ کریں
zh_cn: 设置乌龟

source: The Set mouse block sends a stack of blocks to be run by the specified mouse.
es: El bloque de ratón establecer envía una pila de bloques para que los ejecute el ratón especificado.
fr: Le bloc Régler la souris envoie une pile de blocs à exécuter par la souris spécifiée.
hi: सेट माउस ब्लॉक एक स्टैक ब्लॉक को निर्दिष्ट माउस द्वारा चलाए जाने के लिए भेजता है।
mr: सेट माऊस ब्लॉक निर्दिष्ट माऊसद्वारे चालवण्यासाठी ब्लॉक्सचा स्टॅक पाठवतो.
pt: O bloco Define ratinho envia uma pilha de blocos para ser executada pelo ratinho especificado.
te: నిర్దిష్టమైన మౌస్ ద్వారా అభివృద్ధి చేయబడిన బ్లాక్ల స్టాక్ను పంపిస్తుంది.
tr: set mouse bloğu belirtilen fare tarafından çalıştırılmak üzere bir blok yığını gönderir
ur: سیٹ ماؤس بلاک مخصوص ماؤس کے ذریعے چلانے کے لیے بلاکس کا ایک ڈھیر بھیجتا ہے۔
zh_cn: 设置鼠标块发送一组积木给指定的鼠标执行。

source: The Set turtle block sends a stack of blocks to be run by the specified turtle.
es: El bloque de tortuga establecer envía una pila de bloques para que los ejecute el tortuga especificado.
fr: Le bloc Régler la tortue envoie une pile de blocs à exécuter par la tortue spécifiée.
hi: सेट कछुआ ब्लॉक एक स्टैक ब्लॉक को निर्दिष्ट कछुआ द्वारा चलाए जाने के लिए भेजता है।
mr: सेट कासव ब्लॉक निर्दिष्ट कासवद्वारे चालवण्यासाठी ब्लॉक्सचा स्टॅक पाठवतो.
te: నిర్దిష్టమైన టర్టిల్ ద్వారా అభివృద్ధి చేయబడిన బ్లాక్ల స్టాక్ను పంపిస్తుంది.
tr: set turtle bloğu
ur: سیٹ ٹرٹل بلاک مخصوص کچھوے کے ذریعے چلانے کے لیے بلاکس کا ایک ڈھیر بھیجتا ہے۔
zh_cn: 设置乌龟块发送一组积木给指定的乌龟执行。

source: mouse y
es: ratón y
fr: souris y
hi: माउस वाई
ja: ネズミのy座標
mr: माऊस y
pt: ratinho y
te: మౌస్ Y స్థానం
tr: fare y
ur: ماؤس y
zh_cn: 滑鼠座標 y

source: The Y mouse block returns the Y position of the specified mouse.
es: El bloque del ratón Y devuelve la posición Y del ratón especificado.
fr: Le bloc Y souris renvoie la position Y de la souris spécifiée.
hi: Y माउस ब्लॉक निर्दिष्ट माउस की Y स्थिति वापस करता है।
mr: Y माऊस ब्लॉक निर्दिष्ट माऊसची Y स्थिती परतवतो.
pt: O bloco ratinho Y retorna a posição Y do ratinho especificado.
te: నిర్దిష్టమైన మౌస్ కోసం Y స్థానాన్ను తరిస్తుంది.
tr: y fare bloğu belirtilen farenin y konumunu döndürür
ur: Y ماؤس بلاک مخصوص ماؤس کی Y پوزیشن لوٹاتا ہے۔
zh_cn: 鼠标 Y 坐标块返回指定鼠标的 Y 位置。

source: turtle y
es: tortuga y
fr: tortue y
hi: कछुआ वाई
ja: タートルのy座標
mr: कासव y
pt: tartaruga y
te: టర్టిల్ Y స్థానం
tr: kaplumbağa y
ur: کچھی y
zh_cn: 乌龟 Y 坐标

source: The Y turtle block returns the Y position of the specified turtle.
es: El bloque de la tortuga Y devuelve la posición Y de la tortuga especificado.
fr: Le bloc Y tortue renvoie la position Y de la tortue spécifiée.
hi: Y कछुआ ब्लॉक निर्दिष्ट कछुए की Y स्थिति वापस करता है।
mr: Y कासव ब्लॉक निर्दिष्ट कासवाची Y स्थिती परतवतो.
te: నిర్దిష్టమైన టర్టిల్ కోసం Y స్థానాన్ను తరిస్తుంది.
tr: the y turtle bloğu belirtilen kaplumbağanın y konumunu döndürür
ur: Y ٹرٹل بلاک مخصوص کچھوے کی Y پوزیشن لوٹاتا ہے۔
zh_cn: 乌龟 Y 坐标块返回指定乌龟的 Y 位置。

source: mouse x
es: ratón x
fr: souris x
hi: माउस एक्स
ja: ネズミのx座標
mr: माऊस x
pt: ratinho x
te: మౌస్ X స్థానం
tr: fare x
ur: ماؤس ایکس
zh_cn: 滑鼠座標 x

source: The X mouse block returns the X position of the specified mouse.
es: El bloque del ratón X devuelve la posición X del ratón especificado.
fr: Le bloc X souris renvoie la position X de la souris spécifiée.
hi: X माउस ब्लॉक निर्दिष्ट माउस की X स्थिति वापस करता है।
mr: X माऊस ब्लॉक निर्दिष्ट माऊसची X स्थिती परतवतो.
pt: O bloco ratinho X retorna a posição X do ratinho especificado
te: నిర్దిష్టమైన మౌస్ కోసం X స్థానాన్ను తరిస్తుంది.
tr: x fare bloğu belirtilen farenin x konumunu döndürür
ur: X ماؤس بلاک مخصوص ماؤس کی X پوزیشن واپس کرتا ہے۔
zh_cn: 鼠标 X 坐标块返回指定鼠标的 X 位置。

source: turtle x
es: tortuga x
fr: tortue x
hi: कछुआ एक्स
ja: タートルのx座標
mr: कासव x
pt: tartaruga x
te: టర్టిల్ X స్థానం
tr: kaplumbağa x
ur: کچھی ایکس
zh_cn: 乌龟 X 坐标

source: The X turtle block returns the X position of the specified turtle.
es: El bloque de la tortuga X devuelve la posición X de la tortuga especificado.
fr: Le bloc X tortue renvoie la position X de la tortue spécifiée.
hi: X कछुआ ब्लॉक निर्दिष्ट कछुए की X स्थिति वापस करता है।
mr: X कासव ब्लॉक निर्दिष्ट कासवाची X स्थिती परतवतो.
te: నిర్దిష్టమైన టర్టిల్ కోసం X స్థానాన్ను తరిస్తుంది.
tr: the x turtle bloğu belirtilen kaplumbağanın x konumunu döndürür
ur: ایکس ٹرٹل بلاک مخصوص کچھوے کی X پوزیشن لوٹاتا ہے۔
zh_cn: 乌龟 X 坐标块返回指定乌龟的 X 位置。

source: mouse notes played
es: notas jugadas de ratón
fr: notes jouées par la souris
hi: माउस बजाए गए स्वर
ja: ネズミの演奏した音符の数
mr: माऊसने वाजवलेल्या नोट्स
pt: notas de ratinho tocadas
te: మౌస్ ప్లే చేసిన నోట్లు
tr: fare notaları çalındı
ur: ماؤس نوٹس کھیلا
zh_cn: 鼠标已弹奏的音符数
