Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: Warning: Your sample cannot be loaded because it is >1MB.
es: Advertencia: Su muestra no se puede cargar porque es >1 MB.
fr: Attention : votre échantillon ne peut pas être chargé car il est supérieur à 1 Mo.
ja: ワーニング：音色サンプルは> 1MBであるため 読み込むことができません。
mr: इशारा: तुमचा नमुना लोड केला जाऊ शकत नाही कारण तो >1MB आहे.
tr: warning
ur: انتباہ: آپ کا نمونہ لوڈ نہیں کیا جا سکتا کیونکہ یہ 1MB> ہے۔
zh_cn: 警告：您的采样无法加载，因为文件大于1MB。

source: Toggle Mic
es: Alternar el micrófono
fr: Activer/Désactiver le micro
ja: マイクの切り替え
mr: माइक टॉगल करा
tr: geçişli mikrofon
ur: مائک کو ٹوگل کریں۔
zh_cn: 切换麦克风

source: Playback
es: Reproducir
fr: Lecture
ja: 再生
mr: प्लेबॅक
ur: پلے بیک
zh_cn: 播放

source: reference tone
es: tono de referencia
fr: ton de référence
hi: संदर्भ स्वर
ja: 参照ピッチ
mr: संदर्भ टोन
te: రెఫరెన్స్ టోన్
tr: referans tonu
ur: حوالہ ٹون
zh_cn: 参考音

source: back to 2:1 octave space
es: volver al espacio de octava 2: 1
fr: retour à l'espace d'octave 2:1
hi: 2:1 ऑक्टेव स्थान पर वापस जाएं
ja: 2:1 オクターヴ・スペースに戻る
mr: 2:1 ऑक्टेव्ह स्पेसवर परत
te: 2:1 ఆక్టేవ్ స్పేస్‌కు తిరిగి వెళ్ళ
ur: واپس 2:1 آکٹیو اسپیس پر
zh_cn: 返回到2:1倍频程间距

source: edit
es: editar
fr: modifier
hi: संपादित करें
ja: 編集する
mr: संपादित करा
te: సవరించు
tr: düzenleme
ur: ترمیم کریں
zh_cn: 编辑

source: done
es: terminado
fr: terminé
hi: किया हुआ
ja: 終った
mr: झाले
te: పూర్తి
tr: tamamlandı
ur: ہو گیا
zh_cn: 完成

source: ratio
es: proporción
hi: अनुपात
ja: 比率
mr: अनुपात
te: అనుపాతం
tr: oran
ur: تناسب
zh_cn: 比率

source: interval
es: intervalo
fr: intervalle
hi: अंतराल
ja: 音と音の間の間隔
mr: मध्यांतर
pt: intervalo
te: అంతరంవర్తన
tr: aralık
ur: وقفہ وقفہ
zh_cn: 音程

source: non scalar
es: no escalar
fr: non scalaire
hi: गैर स्केलर
ja: 音階内ではない
mr: गैर स्केलर
te: అనుమానాత్మక
tr: skaler olmayan
ur: غیر اسکیلر
zh_cn: 非标量

source: ratios
es: proporcións
hi: अनुपात
ja: 比率
mr: अनुपात
te: అనుపాతాలు
tr: oranlar
ur: تناسب
zh_cn: 比率

source: arbitrary
es: arbitrario
fr: arbitraire
hi: मनमाना
ja: 自由意思
mr: मनमानी
te: కార్యాచారం
tr: keyfi
ur: من مانی
zh_cn: 任意

source: number of divisions
es: número de divisiones
fr: nombre de divisions
hi: विभाजनों की संख्या
ja: 分配の数
mr: विभागांची संख्या
te: విభజనల సంఖ్య
tr: bölüm sayısı
ur: ڈویژنوں کی تعداد
zh_cn: 分割数量

source: preview
es: preestreno
fr: aperçu
hi: पूर्वावलोकन
ja: 試す
mr: पूर्वावलोकन
te: ప్రొవియూ
tr: ön izleme
ur: پیش نظارہ
zh_cn: 预览

source: The Number of divisions is too large.
es: El número de divisiones es demasiado grande.
fr: Le nombre de divisions est trop grand.
mr: विभागांची संख्या खूप मोठी आहे.
tr: bölüm sayısı çok fazla
ur: ڈویژنز کی تعداد بہت زیادہ ہے۔
zh_cn: 分割数量过大。

source: recursion
es: recursividad
fr: récursion
hi: पुनरावर्तन
ja: 反復
mr: पुनरावृत्ती
te: పునరావృత్తి
tr: özyineleme
ur: تکرار
zh_cn: 递归

source: The octave ratio has changed. This changes temperament significantly.
es: La proporción de octavas ha cambiado. Esto cambia el temperamento de manera significativa.
fr: Le ratio d'octave a changé. Cela change considérablement le tempérament.
hi: ऑक्टेव अनुपात बदल गया है। यह स्वभाव को काफी बदल देता है।
mr: ऑक्टेव्ह अनुपात बदलला आहे. यामुळे स्वभाव लक्षणीय बदलतो.
te: ఆక్టేవ్ అనుపాతం మారింది. ఇది సారాంశంగా మారిపోతుంది.
tr: oktav oranı değişti
ur: آکٹیو کا تناسب بدل گیا ہے۔ اس سے مزاج میں نمایاں تبدیلی آتی ہے۔
zh_cn: 倍频比已更改，这会显著改变音律。

source: Table
es: Tabla
hi: तालिका
ja: グリッド
mr: टेबल
pt: Mesa
te: టేబుల్
tr: Tablo
ur: میز
zh_cn: 表格

source: Add pitches
es: añadir tonos
fr: Ajouter des hauteurs
hi: स्वर जोड़ें
ja: 音高を足す
mr: पिचेस जोडा
pt: Adicionar tons
te: పిచ్లు చేర్చండి
tr: pitches ekle
ur: پچز شامل کریں۔
zh_cn: 添加音高

source: Save tempo
es: Guardar tempo
fr: Enregistrer le tempo
hi: ताल सहेजें
ja: テンポを保存
mr: टेम्पो जतन करा
te: టెంపో భద్రపరచండి
tr: tempo kaydet
ur: ٹیمپو محفوظ کریں۔
zh_cn: 保存节奏

source: speed up
es: acelerar
fr: accélérer
hi: तेजी से बढ़ाएं
ja: 速くする
mr: गती वाढवा
pt: acelerar
te: వేగం పెరగండి
tr: hızlandırmak
ur: تیز
zh_cn: 加快速度

source: slow down
es: retardar
fr: ralentir
hi: धीमे से बढ़ाएं
ja: 遅くする
mr: गती कमी करा
pt: diminuir
te: నిధానంగా చేయండి
tr: yavaşla
ur: سست
zh_cn: 减慢速度

source: Adjust the tempo with the buttons.
es: Ajusta el tempo con los botones.
fr: Ajustez le tempo avec les boutons.
hi: बटन के साथ ताल को समायोजित करें।
ja: １分あたりの拍数でテンポを決められます。
mr: बटणांसह टेम्पो समायोजित करा.
pt: Ajustar o tempo com os botões.
te: బటన్లు ఉపయోగించి టెంపోను సరిచేయండి.
tr: tempoyu düğmelerle ayarlayın
ur: بٹنوں کے ساتھ ٹیمپو کو ایڈجسٹ کریں۔
zh_cn: 使用按钮调整节奏。

source: Please enter a number between 30 and 1000
es: Por favor, introduzca un número entre 30 y 1000.
fr: Veuillez entrer un nombre entre 30 et 1000
ja: ３０から１０００までの数字を入力してください。
mr: कृपया 30 आणि 1000 दरम्यान एक संख्या प्रविष्ट करा
tr: lütfen 30 ile 1000 arasında bir sayı girin
ur: براہ کرم 30 اور 1000 کے درمیان نمبر درج کریں۔
zh_cn: 请输入30到1000之间的数字

source: The beats per minute must be between 30 and 1000.
es: Los latidos por minuto deben estar entre 30 y 1000.
fr: Les battements par minute doivent être compris entre 30 et 1000.
hi: प्रति मिनट बीट 30 और 1000 के बीच होना चाहिए।
ja: 1分あたりの拍の数は、30から1000までのはんいでせっていしてください。
mr: प्रति मिनिट बीट्स 30 आणि 1000 दरम्यान असावेत.
pt: As batidas por minuto devem ser entre 30 e 1.000.
te: ప్రతి నిమిషాలకు ధ్రువాంకాలు 30 నుండి 1000 మధ్యలో ఉండాలి.
tr: dakika başına vuruş sayısı 30 ile 1000 arasında olmalıdır
ur: دھڑکن فی منٹ 30 اور 1000 کے درمیان ہونی چاہیے۔
zh_cn: 每分钟节拍数必须在30到1000之间。

source: The beats per minute must be below 1000.
es: Los latidos por minuto deben estar por debajo de 1000.
fr: Les battements par minute doivent être inférieurs à 1000.
hi: प्रति मिनट बीट 1000 के नीचे होना चाहिए।
ja: 1分あたりの拍の数は、最大1000です。
mr: प्रति मिनिट बीट्स 1000 च्या खाली असणे आवश्यक आहे.
te: ప్రతి నిమిషాలకు ధ్రువాంకాలు 1000 కంటే కిందిగా ఉండాలి.
tr: dakika başına vuruş sayısı 1000'in altında olmalıdır
ur: دھڑکن فی منٹ 1000 سے کم ہونی چاہیے۔
zh_cn: 每分钟节拍数必须低于1000。

source: The beats per minute must be above 30
es: Los latidos por minuto deben ser superiores a 30.
fr: Les battements par minute doivent être supérieurs à 30
hi: प्रति मिनट बीट 30 के ऊपर होना चाहिए
ja: １分あたりの拍の数には、３０より大きいあたいをせっていしてください。
mr: प्रति मिनिट बीट्स 30 च्या वर असणे आवश्यक आहे
te: ప్రతి నిమిషాలకు ధ్రువాంకాలు 30 కంటే పాకా ఉండాలి
tr: dakika başına vuruş sayısı 30'un üzerinde olmalıdır
ur: فی منٹ کی دھڑکنیں 30 سے ​​زیادہ ہونی چاہئیں
zh_cn: 每分钟节拍数必须高于30

source: Synthesizer
es: Sintetizador
fr: Synthétiseur
hi: सिंथेसाइज़र
ja: シンセサイザー
mr: सिंथेसायझर
pt: Sintetizador
te: సింథిసైజర్
ur: سنتھیسائزر
zh_cn: 合成器

source: Effects
es: Efectos
fr: Effets
hi: प्रभाव
ja: 音響効果
mr: परिणाम
pt: Efeitos
te: ప్రభావాలు
tr: Efektler
ur: اثرات
zh_cn: 效果

source: Add filter
es: Agregar un filtro
fr: Ajouter un filtre
hi: फ़िल्टर जोड़ें
ja: フィルターを加える
mr: फिल्टर जोडा
pt: Adicionar filtro
te: ఫిల్టర్ జోడించండి
tr: filtre ekle
ur: فلٹر شامل کریں۔
zh_cn: 添加滤波器

source: Click on buttons to open the timbre design tools.
es: Haga clic en los botones para abrir las herramientas de diseño de timbre.
fr: Cliquez sur les boutons pour ouvrir les outils de conception de timbre.
hi: टिम्बर डिज़ाइन टूल्स खोलने के लिए बटन पर क्लिक करें।
ja: ボタンをクリックするとカスタム音色ツールが開きます。
mr: टिंबर डिझाइन टूल्स उघडण्यासाठी बटणांवर क्लिक करा.
pt: Clique nos botões para abrir as ferramentas de definição do timbre.
te: టింబ్రె డిజైన్ సాధనాలను తెరవడానికి బటన్‌లలో నొక్కండి.
tr: tını tasarım araçlarını açmak için düğmelere tıklayın
ur: ٹمبر ڈیزائن ٹولز کو کھولنے کے لیے بٹنوں پر کلک کریں۔
zh_cn: 点击按钮打开音色设计工具。

source: harmonicity
es: armonía
fr: harmonicité
hi: सवारी
ja: 倍音の音色
mr: हार्मोनिसिटी
pt: harmonicidade
te: హార్మనిసిటీ
tr: armoniklik
ur: ہم آہنگی
zh_cn: 谐波性

source: vibrato amount
es: cantidad de vibrato
fr: quantité de vibrato
hi: वाइब्रेटो मात्रा
ja: ビブラートの速さ
mr: व्हायब्रेटो रक्कम
pt: quantidade de vibrato
te: విబ్రాటో మొత్తం
tr: vibrato miktarı
ur: کمپن کی مقدار
zh_cn: 颤音量

source: Filter already present.
es: filtro ya presente
fr: Filtre déjà présent.
hi: फ़िल्टर पहले से मौजूद है।
ja: フィルターは もう 存在しています。
mr: फिल्टर आधीच उपस्थित आहे.
te: ఫిల్టర్ ఇప్పటికే ఉంది.
tr: filtre zaten mevcut
ur: فلٹر پہلے سے موجود ہے۔
zh_cn: 滤波器已存在。

source: distortion amount
es: cantidad de distorsión
fr: quantité de distorsion
hi: विकृति मात्रा
ja: ディストーションの大きさ
mr: विकृती रक्कम
pt: quantidade de distorção
te: విరుప్తి మొత్తం
tr: distorsiyon miktarı
ur: تحریف کی رقم
zh_cn: 失真量

source: Zoom In
es: Hacer zoom
fr: Agrandir
hi: ज़ूम इन
ja: ズームイン
mr: झूम इन
te: పైగా జూమ్ చేయండి
tr: yakınlaştır
ur: زوم ان
zh_cn: 放大

source: Zoom Out
es: Alejar
fr: Dézoomer
hi: ज़ूम आउट
ja: ズームアウト
mr: झूम आउट
te: దూరంగా జూమ్ చేయండి
tr: uzaklaştır
ur: زوم آؤٹ
zh_cn: 缩小

source: Export
es: Exportar
fr: Exporter
hi: निर्यात करें
ja: テーブルをほぞん
mr: निर्यात करा
pt: Exportar
te: ఎగుమతి
tr: Dışa Aktarma
ur: برآمد کریں۔
zh_cn: 导出

source: Sort
es: Ordenar
fr: Trier
hi: क्रमबद्ध करें
ja: ならべなおす
mr: वर्गीकृत करा
pt: Ordenar
te: వర్గీకరించండి
tr: Sıralama
ur: چھانٹنا
zh_cn: 排序

source: Click on the table to add notes.
es: Haga clic en la tabla para agregar notas.
fr: Cliquez sur la table pour ajouter des notes.
hi: नोट्स जोड़ने के लिए तालिका पर क्लिक करें.
ja: ます目をクリックするとメロディやリズムを作れます。
mr: नोट्स जोडण्यासाठी टेबलवर क्लिक करा.
pt: Clique na mesa para adicionar notas.
te: గానాలను జోడించడానికి టేబుల్లో క్లిక్ చేయండి.
tr: not eklemek için tabloya tıklayın
ur: نوٹ شامل کرنے کے لیے ٹیبل پر کلک کریں۔
zh_cn: 点击表格添加音符。

source: tuplet value
es: valor del tuplet
fr: valeur de tuple
hi: ट्यूपलेट मूल्य
ja: 何連符価
mr: टुपलेट मूल्य
pt: valor de tuplet
te: ట్యూప్లెట్ విలువ
tr: tuplet değer
ur: tuplet قدر
zh_cn: 复音值

source: Share
es: Compartir
fr: Partager
hi: साझा करें
ja: シェア
mr: शेअर करा
pt: Compartilhar
te: షేర్
ur: شیئر کریں۔
zh_cn: 分享

source: Flags
es: Banderas
fr: Drapeaux
hi: फ़्लैग्स
ja: 旗
mr: ध्वज
pt: Bandeiras
te: ధ్వజాలు
ur: جھنڈے
zh_cn: 标志

source: No results found.
es: No se han encontrado resultados.
fr: Aucun résultat trouvé.
ja: 検索の結果に何もはありません
mr: कोणतेही परिणाम सापडले नाहीत.
pt: Não foram encontrados resultados
te: ఫలితాలు కనిపించలేదు
ur: کوئی نتیجہ نہیں ملا۔
zh_cn: 未找到结果。

source: Remix of
es: Remix de
fr: Remix de
ja: のリミックス
mr: चे रिमिक्स
pt: Remixar de
te: రీమిక్స్ చేసినది
ur: کا ریمکس
zh_cn: 混音自

source: Cannot connect to server
es: No es posible conectar con el servidor.
fr: Impossible de se connecter au serveur
ja: サーバに接続できません
mr: सर्व्हरशी जोडले जाऊ शकत नाही
pt: Não foi possível conectar ao servidor
te: సర్వర్‌కు కనెక్ట్ అవ్వడం అసాధ్యం
ur: سرور سے منسلک نہیں ہو سکتا
zh_cn: 无法连接到服务器

source: All Projects
es: todos los proyectos
fr: Tous les projets
hi: सभी परियोजनाएं
ja: 全てのプロジェクト
mr: सर्व प्रकल्प
pt: Todos os projetos
te: అన్ని ప్రాజెక్టులు
ur: تمام پروجیکٹس
zh_cn: 所有项目

source: My Projects
es: Mis proyectos
fr: Mes projets
hi: मेरी परियोजनाएं
ja: 自分のプロジェクト
mr: माझे प्रकल्प
pt: Meus projetos
te: నా ప్రాజెక్టులు
ur: میرے پروجیکٹس
zh_cn: 我的项目

source: Examples
es: ejemplos
fr: Exemples
hi: उदाहरण
ja: プロジェクトの見本
mr: उदाहरणे
pt: Exemplos
te: ఉదాహరణలు
ur: مثالیں
zh_cn: 示例

source: Art
es: arte
hi: कला
ja: アート
mr: कला
pt: Arte
te: కళా
ur: فن
zh_cn: 艺术

source: Math
es: mates
fr: Mathématiques
hi: गणित
ja: 算数
mr: गणित
pt: Matemática
te: గణితం
ur: ریاضی
zh_cn: 数学

source: Interactive
es: interactivo
fr: Interactif
hi: इंटरएक्टिव
ja: インタラクティブ
mr: परस्परसंवादी
pt: Interativo
te: ఇంటరాక్టివ్
ur: انٹرایکٹو
zh_cn: 互动

source: Design
es: diseño
fr: Conception
hi: डिज़ाइन
ja: デザイン
mr: डिझाइन
te: డిజైన్
ur: ڈیزائن
zh_cn: 设计

source: Game
es: juego
fr: Jeu
hi: खेल
ja: ゲーム
mr: खेळ
pt: Jogo
te: ఆట
ur: کھیل
zh_cn: 游戏

source: Code Snippet
es: fragmento de código
fr: Extrait de code
hi: कोड स्निपेट
ja: 短いコード
mr: कोड स्निपेट
te: కోడ్ స్నిపెట్
ur: کوڈ کا ٹکڑا
zh_cn: 代码片段

source: View published project
es: Ver proyecto publicado
fr: Voir le projet publié
hi: प्रकाशित परियोजना देखें
ja: 公開されたプロジェクトを見る
mr: प्रकाशित प्रकल्प पहा
pt: Visualizar projeto publicado
te: ప్రచురించబడిన ప్రాజెక్ట్‌ను వీక్షించండి
ur: شائع شدہ پروجیکٹ دیکھیں
zh_cn: 查看已发布项目

source: Publish project
es: Publicar proyecto
fr: Publier le projet
hi: परियोजना प्रकाशित करें
ja: プロジェクトを公開する
mr: प्रकल्प प्रकाशित करा
pt: Publicar projeto
te: ప్రాజెక్ట్‌ను ప్రచురించండి
ur: پروجیکٹ شائع کریں۔
zh_cn: 发布项目

source: Edit project
es: Editar proyecto
fr: Modifier le projet
hi: परियोजना संपादित करें
ja: プロジェクトを編集する
mr: प्रकल्प संपादित करा
pt: Editar projeto
te: ప్రాజెక్ట్‌ను సవరించండి
ur: پروجیکٹ میں ترمیم کریں۔
zh_cn: 编辑项目

source: Delete project
es: Borrar proyecto
fr: Supprimer le projet
hi: परियोजना हटाएं
ja: プロジェクトを消す
mr: प्रकल्प हटवा
pt: Excluir projeto
te: ప్రాజెక్ట్‌ను తొలగించండి
ur: پروجیکٹ کو حذف کریں۔
zh_cn: 删除项目

source: Download project
es: Descargar proyecto
fr: Télécharger le projet
hi: परियोजना डाउनलोड करें
ja: プロジェクトをダウンロードする
mr: प्रकल्प डाउनलोड करा
pt: Baixar projeto
te: ప్రాజెక్ట్‌ను డౌన్‌లోడ్ చేయండి
ur: پروجیکٹ ڈاؤن لوڈ کریں۔
zh_cn: 下载项目

source: Duplicate project
es: Duplucar proyecto
fr: Dupliquer le projet
hi: परियोजना की प्रतिलिपि बनाएं
ja: プロジェクトをコピーする
mr: डुप्लिकेट प्रकल्प
pt: Duplicar projeto
te: ప్రాజెక్ట్‌ను నకలు చేయండి
ur: ڈپلیکیٹ پروجیکٹ
zh_cn: 复制项目

source: anonymous
es: anónimo
fr: anonyme
hi: अनामक
ja: 匿名
mr: अनामिक
pt: anônimo
te: అనామస్
ur: گمنام
zh_cn: 匿名

source: Error: Report could not be submitted. Try again later.
es: Error: No se pudo enviar el informe. Inténtalo de nuevo más tarde.
fr: Erreur : Le rapport n'a pas pu être soumis. Réessayez plus tard.
hi: त्रुटि: रिपोर्ट सबमिट नहीं की जा सकी। बाद में पुन: प्रयास करें।
ja: エラー：通報ができませんでした。後で再度試してください。
mr: त्रुटी: अहवाल सादर केला जाऊ शकला नाही. नंतर पुन्हा प्रयत्न करा.
pt: Erro: o relatório não pode ser submetido. Tente mais tarde.
te: పొరపాటు: నివేదన చేయలేదు. తర్వాత ప్రయత్నించండి.
ur: خرابی: رپورٹ پیش نہیں کی جا سکی۔ بعد میں دوبارہ کوشش کریں۔
zh_cn: 错误：无法提交报告。请稍后再试。

source: Thank you for reporting this project. A moderator will review the project shortly, to verify violation of the Sugar Labs Code of Conduct.
es: Gracias por reportar este proyecto. Un moderador revisará el proyecto en breve para verificar la violación del Código de conducta de Sugar Labs.
fr: Merci de signaler ce projet. Un modérateur examinera le projet sous peu pour vérifier la violation du code de conduite de Sugar Labs.
hi: इस परियोजना की रिपोर्ट करने के लिए धन्यवाद। एक मॉडरेटर जल्दी ही परियोजना की समीक्षा करेगा, ताकि यह सुगर लैब्स कोड ऑफ कंडक्ट का उल्लंघन सत्यापित किया जा सके।
ja: このプロジェクトを通報して下さってありがとうございます。モデレータが間もなく、プロジェクトを見ます。
mr: हा प्रकल्प अहवाल दिल्याबद्दल धन्यवाद. शुगर लॅब्स आचारसंहितेचे उल्लंघन सत्यापित करण्यासाठी काही वेळातच एक मॉडरेटर प्रकल्पाचे पुनरावलोकन करेल.
pt: Obrigado por enviar este projeto. Um moderador irá realizar uma pequena revisão do projeto, para verificar se há violação do Código de Conduta do Sugar Labs.
te: ఈ ప్రాజెక్ట్‌ను నివేదించడానికి ధన్యవాదాలు. ఈ ప్రాజెక్ట్‌ను Sugar Labs కోడ్ ఆఫ్ కండక్ట్ లోపాలను ఖచితం చేయడానికి కార్యదర్శకుడు శీఘ్రం పరిశీలిస్తారు.
ur: اس منصوبے کی اطلاع دینے کے لیے آپ کا شکریہ۔ شوگر لیبز کے ضابطہ اخلاق کی خلاف ورزی کی توثیق کرنے کے لیے ایک ماڈریٹر جلد ہی پروجیکٹ کا جائزہ لے گا۔
zh_cn: 感谢您举报此项目。版主将很快审核该项目，以确认是否违反了 Sugar Labs 行为准则。

source: Report Project
es: Informe de proyecto
fr: Signaler le projet
hi: परियोजना की रिपोर्ट करें
ja: プロジェクトを通報する
mr: प्रकल्पाचा अहवाल द्या
pt: Enviar projeto
te: ప్రాజెక్ట్‌ను నివేదించు
ur: رپورٹ پروجیکٹ
zh_cn: 举报项目

source: Project Reported
es: Proyecto informado
fr: Projet signalé
hi: परियोजना की रिपोर्ट की गई
ja: プロジェクトは通報されました
mr: प्रकल्प अहवालित
pt: Projeto enviado
te: ప్రాజెక్ట్ నివేదించబడింది
ur: پروجیکٹ کی اطلاع دی گئی۔
zh_cn: 项目已被举报

source: Report description required
es: Descripción requerida
fr: Description du rapport requise
hi: रिपोर्ट विवरण आवश्यक है
ja: レポート表記が必要です
mr: अहवालाचे वर्णन आवश्यक आहे
pt: Descrição do relatório necessária
te: నివేదన వివరాలు అవసరం
ur: رپورٹ کی تفصیل درکار ہے
zh_cn: 必须填写举报描述

source: Report description too long
es: La descripción es demasiado larga.
fr: Description du rapport trop longue
hi: रिपोर्ट विवरण बहुत लंबा है
ja: レポート表記が長すぎます
mr: अहवालाचे वर्णन खूप लांब आहे
pt: Descrição do relatório muito longa.
te: నివేదన వివరాలు అతిపెద్దవి
ur: رپورٹ کی تفصیل بہت لمبی ہے۔
zh_cn: 举报描述过长

source: Feature unavailable - cannot connect to server. Reload Music Blocks to try again.
es: Característica no disponible: no se puede conectar al servidor. Vuelve a cargar Bloques de Música para intentarlo de nuevo.
fr: Fonctionnalité indisponible - impossible de se connecter au serveur. Rechargez Music Blocks pour réessayer.
ja: エラー：サーバに接続できません。ミュージック・ブロックスをリロードし、再度試して下さい。
mr: वैशिष्ट्य अनुपलब्ध - सर्व्हरशी जोडले जाऊ शकत नाही. पुन्हा प्रयत्न करण्यासाठी म्युझिक ब्लॉक्स रीलोड करा.
pt: Funcionalidade indisponível - não foi possível conectar ao servidor. Reinicie o Music Blocks para tentar novemente.
te: విశేషము - సర్వర్‌కు కనెక్ట్ అవ్వడం అసాధ్యం. మ్యూజిక్ బ్లాక్స్‌ను మళ్ళీ రిలోడ్ చేయండి.
ur: فیچر دستیاب نہیں ہے - سرور سے منسلک نہیں ہو سکتا۔ دوبارہ کوشش کرنے کے لیے میوزک بلاکس کو دوبارہ لوڈ کریں۔
zh_cn: 功能不可用 - 无法连接到服务器。请重新加载 Music Blocks 再试一次。

source: This field is required
es: Este campo es requerido.
fr: Ce champ est requis
ja: この項目は必須項目です
mr: हे क्षेत्र आवश्यक आहे
pt: Este campo é necessário
te: ఈ క్షేత్రం అవసానమైనది
ur: یہ فیلڈ درکار ہے۔
zh_cn: 此字段为必填项

source: Title too long
es: Título es demasiado largo.
fr: Titre trop long
ja: タイトルが長すぎます
mr: शीर्षक खूप लांब आहे
pt: Título muito longo
te: టైటిల్ అతికాలం
ur: عنوان بہت لمبا ہے۔
zh_cn: 标题过长

source: Description too long
es: La descripción es demasiado largo.
fr: Description trop longue
ja: 表記が長すぎます
mr: वर्णन खूप लांब आहे
pt: Descrição muito longa
te: వివరణ అతికాలం
ur: تفصیل بہت لمبی ہے۔
zh_cn: 描述过长

source: Server Error
es: Error del Servidor
fr: Erreur du serveur
ja: サーバーエラー
mr: सर्व्हर त्रुटी
pt: Erro no servidor
te: సర్వర్ లోపం
ur: سرور کی خرابی۔
zh_cn: 服务器错误

source: Try Again
es: Inténtalo de nuevo
fr: Réessayer
ja: もう一度使い直してください。
mr: पुन्हा प्रयत्न करा
pt: Tentar novamente
te: ప్రయాసం చేయండి
ur: دوبارہ کوشش کریں۔
zh_cn: 重试

source: Open in Music Blocks
es: Abrir en Bloques de Música
fr: Ouvrir dans Music Blocks
hi: म्यूजिक ब्लॉक्स में खोलें
ja: ミュージック・ブロックスで開きます
mr: म्युझिक ब्लॉक्समध्ये उघडा
pt: Abrir no Music Blocks
te: సంగీత బ్లాక్స్‌లో తెరవండి
ur: میوزک بلاکس میں کھولیں۔
zh_cn: 在 Music Blocks 中打开

source: Open in Turtle Blocks
es: Abierto en TortuBloques
fr: Ouvrir dans Turtle Blocks
ja: タートル ブロックスで開きます
mr: टर्टल ब्लॉक्समध्ये उघडा
te: టర్టిల్ బ్లాక్స్‌లో తెరువు చేయండి
ur: ٹرٹل بلاکس میں کھولیں۔
zh_cn: 在 Turtle Blocks 中打开

source: Show more tags
es: Mostrar más etiquetas
fr: Afficher plus de tags
hi: और टैग दिखाएं
ja: タッグをもっと見る
mr: अधिक टॅग दाखवा
pt: Mostrar mais etiquetas
te: ఇంకా ట్యాగ్‌లను చూపించండి
ur: مزید ٹیگز دکھائیں
zh_cn: 显示更多标签

source: Show fewer tags
es: Mostrar menos etiquetas
fr: Afficher moins de tags
hi: कम टैग दिखाएं
ja: タッグを非表示
mr: कमी टॅग दाखवा
pt: Mostrar algumas etiquetas
te: తక్కువ ట్యాగ్‌లను చూపించండి
ur: کم ٹیگز دکھائیں
zh_cn: 显示较少标签

source: Planet
es: Planeta
fr: Planète
hi: ग्रह
ja: プラネット
mr: ग्रह
pt: Planeta
te: ప్లానెట్
ur: سیارہ
zh_cn: 星球

source: Close Planet
es: Cerrar Planeta
fr: Fermer Planète
hi: प्लैनेट बंद करें
ja: プラネットを閉じる
mr: ग्रह बंद करा
pt: Fechar Planeta
te: ప్లానెట్‌ను మూయండి
ur: سیارہ بند کریں۔
zh_cn: 关闭星球

source: Open project from file
es: Abrir proyecto desde archivo
fr: Ouvrir le projet à partir d'un fichier
hi: फ़ाइल से परियोजना खोलें
ja: ファイルからプロジェクトを開く
mr: फाईलमधून प्रकल्प उघडा
pt: Carregar arquivo de projeto
te: ఫైలు నుండి ప్రాజెక్ట్ తెరవండం
ur: فائل سے پروجیکٹ کھولیں۔
zh_cn: 从文件打开项目

source: Local
hi: स्थानीय
ja: ローカル
mr: स्थानिक
te: స్థానిక
ur: مقامی
zh_cn: 本地

source: Global
hi: वैश्विक
ja: グローバル
mr: वैश्विक
te: గ్లోబల్
ur: عالمی
zh_cn: 全局

source: Search for a project
es: Buscar un proyecto
fr: Rechercher un projet
hi: परियोजना के लिए खोजें
ja: プロジェクト検索
mr: प्रकल्प शोधा
pt: Buscar um projeto
te: ఒక ప్రాజెక్ట్ కోసం శోధించండి
ur: ایک پروجیکٹ تلاش کریں۔
zh_cn: 搜索项目

source: Tags (max 5)
es: Etiquetas (max 5)
hi: टैग (अधिकतम 5)
ja: タッグ（最大5個）
mr: टॅग (कमाल 5)
pt: Etiquetas (max 5)
te: ట్యాగ్‌లు (గరిష్టం 5)
ur: ٹیگز (زیادہ سے زیادہ 5)
zh_cn: 标签（最多 5 个）

source: Description
es: Descripción
hi: विवरण
ja: 記入
mr: वर्णन
pt: Descrição
te: వివరణ
ur: تفصیل
zh_cn: 描述

source: Submit
es: Presentar
fr: Soumettre
hi: सबमिट
ja: 確認
mr: प्रस्तुत करा
pt: Submeter
te: సమర్పించు
ur: جمع کروائیں۔
zh_cn: 提交

source: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
ja: キャンセル
mr: रद्द करा
pt: Cancelar
te: రద్దు చేయి
ur: منسوخ کریں۔
zh_cn: 取消

source: Explore Projects
es: Explorar proyectos
fr: Explorer les projets
hi: परियोजनाएं अन्वेषण करें
ja: プロジェクトを探す
mr: प्रकल्पांचा शोध घ्या
pt: Explorar projetos
te: ప్రాజెక్టులను అన్వేషించండి
ur: پروجیکٹس دریافت کریں۔
zh_cn: 探索项目

source: Most recent
es: Más reciente
fr: Le plus récent
hi: सबसे हाल का
ja: 一番最近
mr: सर्वात अलीकडील
pt: Mais recentes
te: చాలా ఇటము
ur: تازہ ترین
zh_cn: 最新

source: Most liked
es: Más gustado
fr: Le plus aimé
hi: सबसे अधिक पसंद किया गया
ja: 「いいね」の一番ある
mr: सर्वाधिक आवडलेले
pt: Mais curtidos
te: అంగడాలు చాలా చేసినవి
ur: سب سے زیادہ پسند کیا
zh_cn: 最受喜爱

source: Most downloaded
es: Más descargados
fr: Le plus téléchargé
hi: सबसे अधिक डाउनलोड किया गया
ja: ダウンロードの一番ある
mr: सर्वाधिक डाउनलोड केलेले
pt: Mais baixados
te: అక్షరాల వరకు
ur: سب سے زیادہ ڈاؤن لوڈ
zh_cn: 下载最多

source: Sort by
es: Ordenar por
fr: Trier par
hi: क्रमबद्ध करें
ja: ～で整理する
mr: यादीनुसार वर्गीकृत करा
pt: Ordenar por
te: మరియు
ur: ترتیب دیں
zh_cn: 排序方式

source: Load More Projects
es: Cargar más proyectos
fr: Charger plus de projets
ja: プロジェクトをもっとロードする
mr: अधिक प्रकल्प लोड करा
pt: Carregar mais projetos
te: ప్రాజెక్టులను మరింత లోడ్ చేయండి
ur: مزید پروجیکٹس لوڈ کریں۔
zh_cn: 加载更多项目

source: Last Updated
es: Ãltima actualización
fr: Dernière mise à jour
ja: 最後の更新
mr: शेवटचे अद्यतनित
pt: Última atualização
te: చాలా ఇటము
ur: آخری تازہ کاری
zh_cn: 最后更新

source: Creation Date
es: Fecha de creación
fr: Date de création
ja: 作成日
mr: निर्मिती तारीख
pt: Data de criação
te: సృష్టించబడిన తేదీ
ur: تخلیق کی تاریخ
zh_cn: 创建日期

source: Number of Downloads:
es: Numero de descargas:
fr: Nombre de téléchargements :
ja: ダウンロード数
mr: डाउनलोडची संख्या:
pt: Número de Downloads:
te: డౌన్లోడ్ సంఖ్య:
ur: ڈاؤن لوڈز کی تعداد:
zh_cn: 下载次数：

source: Number of Likes:
es: Número de me gusta:
fr: Nombre de likes :
ja: 「いいね」の数
mr: आवडींची संख्या:
pt: Núumero de curtidas
te: లైక్స్ సంఖ్య:
ur: پسندیدگیوں کی تعداد:
zh_cn: 点赞数：

source: Tags:
es: Etiquetas:
ja: タッグ
mr: टॅग:
pt: Etiquetas
te: ట్యాగ్‌లు:
ur: ٹیگز:
zh_cn: 标签：

source: Report projects which violate the <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">Sugar Labs Code of Conduct</a>.
ur: ان منصوبوں کی اطلاع دیں جو <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">شوگر لیبز کے ضابطہ اخلاق</a> کی خلاف ورزی کرتے ہیں.

source: Reason for reporting project
es: Razón para informar el proyecto
fr: Raison de signaler le projet
ja: プロジェクトを通報する理由
mr: प्रकल्पाचा अहवाल देण्याचे कारण
pt: Razão para enviar projeto
te: ప్రాజెక్టును నివేదించడానికి కారణము
ur: پروجیکٹ کی اطلاع دینے کی وجہ
zh_cn: 举报项目原因

source: Download as File
es: Descargar como archivo
fr: Télécharger en tant que fichier
ja: ファイルでダウンロードする
mr: फाईल म्हणून डाउनलोड करा
pt: Baixar com arquivo
te: ఫైల్‌గా డౌన్‌లోడ్ చేయండి
ur: فائل کے طور پر ڈاؤن لوڈ کریں۔
zh_cn: 下载为文件

source: motion x
es: x del acelerómetro
fr: mouvement x
hi: 'x'दिशा में गतिवान
ja: x座標の動き
mr: x चलऩ
pt: movimento x
te: అంతర్గతి x
ur: تحریک x
zh_cn: 运动 x

source: motion y
es: y del acelerómetro
fr: mouvement y
hi: 'y'दिशा में गतिवान
ja: y座標の動き
mr: y चलऩ
pt: movimento y
te: అంతర్గతి y
ur: تحریک y
zh_cn: 运动 y

source: motion z
es: z del acelerómetro
fr: mouvement z
hi: 'z'दिशा में गतिवान
ja: z座標の動き
mr: z चलऩ
pt: movimento z
te: అంతర్గతి z
ur: تحریک z
zh_cn: 运动 z

source: publish
es: publicar
fr: publier
hi: प्रकाशित करें
ja: プロジェクトをフェースブックにアップロードする
mr: प्रकाशित
pt: publicar
te: ప్రచురించండి
ur: شائع کریں
zh_cn: 发布
