Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: power
es: poder
fr: puissance
hi: शक्ति
ja: 指数
mr: शक्ती
pt: poder
te: శక్తి
ur: طاقت
zh_cn: 乘方

source: base
hi: आधार
ja: ベース
mr: तळ
te: ఆధారం
ur: بنیاد
zh_cn: 底数

source: floor
es: piso
fr: plancher
hi: मंज़िल
ja: 床
mr: मजला
pt: chão
te: ఫ్లోర్
ur: فرش
zh_cn: 向下取整

source: ceiling
es: techo
fr: plafond
hi: उच्चतम सीमा
ja: 天井
mr: छत
pt: teto
te: సీలింగ్
ur: چھت
zh_cn: 向上取整

source: to degrees
es: a grados
fr: en degrés
hi: डिग्री में
ja: 度数法へ変換
mr: अंश
pt: para graus
te: డిగ్రీలకు
ur: ڈگریوں تک
zh_cn: 转为角度

source: to radians
es: a radianes
fr: en radians
hi: रेडियंस में
ja: ラジアンへ変換
mr: त्रिज्यी कडे
pt: para radianos
te: రేడియన్లకు
ur: ریڈین کو
zh_cn: 转为弧度

source: get calories
es: obtener calorías
fr: obtenir des calories
hi: कैलोरी लें
ja: カロリーをとる
mr: कैलरी काडा
pt: obter calorias
te: కేలరీలను పొందండి
ur: کیلوری حاصل کریں
zh_cn: 获取卡路里

source: get protein
es: obtener proteínas
fr: obtenir des protéines
hi: प्रोटीन मिलता है
ja: たんぱく質をとる
mr: प्रोटीन काडा
pt: obter proteínas
te: ప్రోటీన్‌ని పొందండి
ur: پروٹین حاصل کریں
zh_cn: 获取蛋白质

source: get carbs
es: obtener carbohidratos
fr: obtenir des glucides
hi: कार्बोहायड्रेट लो
ja: 炭水化物
mr: कार्ब्स काडा
pt: obter carboidratos
te: కార్బోహైడ్రేట్స్‌ని పొందండి
ur: کاربوہائیڈریٹ حاصل کریں
zh_cn: 获取碳水化合物

source: get fiber
es: obtener fibra
fr: obtenir des fibres
hi: रेशा मिलता है
ja: 食物繊維をとる
mr: फाइबर \ तंतू काडा
pt: obter fibra
te: ఫైబర్‌ని పొందండి
ur: فائبر حاصل کریں
zh_cn: 获取纤维

source: get fat
es: obtener grasas
fr: obtenir des graisses
hi: चर्बी लें
ja: 太る
mr: चरबी सांगा
pt: ficar gordo
te: కొబ్బరిని పొందండి
ur: موٹا ہو جاؤ
zh_cn: 获取脂肪

source: get name
es: obtener nombre
fr: obtenir le nom
hi: नाम उपलब्ध करें
ja: 名前を獲得する
mr: नाव सांगा
pt: obter nome
te: పేరుని పొందండి
ur: نام حاصل کریں
zh_cn: 获取名称

source: calories
es: calorías
hi: कैलोरी
ja: カロリー
mr: कॅलरीज
pt: calorias
te: కేలరీలు
ur: کیلوریز
zh_cn: 卡路里

source: protein
es: proteína
fr: protéines
hi: प्रोटीन
ja: たんぱく
mr: प्रोटीन
pt: proteína
te: ప్రోటీన్
ur: پروٹین
zh_cn: 蛋白质

source: carbs
es: carbohidratos
fr: glucides
hi: कार्बोहायड्रेट
ja: 炭水化物
mr: कार्ब्स
pt: carboidratos
te: కార్బోహైడ్రేట్స్
ur: کاربوہائیڈریٹ
zh_cn: 碳水化合物

source: fiber
es: fibra
fr: fibres
hi: रेशा
ja: 食物繊維
mr: धागा
pt: fibra
te: ఫైబర్
ur: فائبر
zh_cn: 纤维

source: fat
es: grasa
fr: graisses
hi: चर्बी
ja: 脂肪
mr: चरबी
pt: gordo
te: కొబ్బరి
ur: چربی
zh_cn: 脂肪

source: eat
es: comer
fr: manger
hi: खाएं
ja: 食べる
mr: खाणे
pt: comer
te: తినండి
ur: کھاؤ
zh_cn: 吃

source: digest meal
es: digerir
fr: digérer le repas
hi: भोजन हज़म करना
ja: 食事を熟す
mr: जेवण पचवणे
pt: digerir refeição
te: జీర్ణ ఆహారం
ur: کھانا ہضم کرنا
zh_cn: 消化餐食

source: apple
es: manzana
fr: pomme
hi: सेब
ja: りんご
mr: सफरचंद
pt: maçã
te: ఆపిల్
ur: سیب
zh_cn: 苹果

source: banana
fr: banane
hi: केला
ja: バナナ
mr: केळी
te: ఆరటి
ur: کیلا
zh_cn: 香蕉

source: wheat bread
es: pan
fr: pain de blé
hi: गेहूं की रोटी
ja: 麦パン
mr: गहू चे ब्रेड / घवाचे ब्रेड
pt: pão
te: గోధుమ బ్రెడ్
ur: گندم کی روٹی
zh_cn: 全麦面包

source: corn
es: maíz
fr: maïs
hi: मकई
ja: コーン
mr: मक्का
pt: milho
te: మొక్కజొన్న
ur: مکئی
zh_cn: 玉米

source: potato
es: papa
fr: pomme de terre
hi: आलू
ja: 芋
mr: बटाटा
pt: batata
te: ఆలుగడ్డ
ur: آلو
zh_cn: 土豆

source: sweet potato
es: boñato
fr: patate douce
hi: शकरकन्द
ja: スイートポテト
mr: रताळे
pt: batata doce
te: చిలకడదొర
ur: میٹھا آلو
zh_cn: 红薯

source: tomato
es: tomate
fr: tomate
hi: टमाटर
ja: トマト
mr: टोमॅटो
pt: tomate
te: టమాట
ur: ٹماٹر
zh_cn: 番茄

source: broccoli
es: brócoli
fr: brocoli
hi: ब्रोकली
ja: ブロッコリー
mr: ब्रोकोली
pt: brócolis
te: బ్రోకలి
ur: بروکولی
zh_cn: 西兰花

source: rice and beans
es: arroz y frijoles
fr: riz et haricots
hi: चावल और फली
ja: ご飯と豆
mr: तांदूळ आणि सोयाबीनचे
pt: arroz e feijão
te: బియ్యం మరియు బీన్స్
ur: چاول اور پھلیاں
zh_cn: 米饭和豆子

source: tamale
es: tamal
hi: तमालि
ja: タマレ
mr: टमाले
te: తమాలే
ur: تملے
zh_cn: 塔玛莱

source: cheese
es: queso
fr: fromage
hi: चीज़
ja: チーズ
mr: चीज
pt: queijo
te: చీజ్
ur: پنیر
zh_cn: 奶酪

source: chicken
es: pollo
fr: poulet
hi: चूज़ा
ja: 鶏肉
mr: कोंबडी
pt: frango
te: కోడి
ur: چکن
zh_cn: 鸡肉

source: fish
es: pescado
fr: poisson
hi: मछली
ja: 魚
mr: मासे
pt: peixe
te: చేప
ur: مچھلی
zh_cn: 鱼

source: beef
es: carne de res
fr: bœuf
hi: गाय का गोश्त
ja: 牛肉
mr: गोमांस
pt: carne
te: మాంసం
ur: گائے کا گوشت
zh_cn: 牛肉

source: cake
es: pastel
fr: gâteau
hi: केक
ja: ケーキ
mr: केक
pt: bolo
te: కేక్
ur: کیک
zh_cn: 蛋糕

source: cookie
es: galleta
fr: biscuit
hi: कुकी
ja: クッキー
mr: कुकी
pt: biscoito
te: కుకీ
ur: کوکی
zh_cn: 饼干

source: water
es: agua
fr: eau
hi: जल
ja: 水
mr: पाणी
pt: água
te: నీటి
ur: پانی
zh_cn: 水

source: Days ahead must be in the range of -1 to 5.
es: Los días siguientes deben estar en el rango de -1 a 5.
fr: Les jours à venir doivent être compris entre -1 et 5.
ja: 日にちは -１から５までの数でなくてはなりません
mr: आगामी दिवस -1 ते 5 च्या श्रेणीत असावे.
pt: Dias a frente devem estar entre -1 e 5
te: రోజులు ముందుగా -1 నుండి 5 లలో ఉండాలి.
ur: آنے والے دن -1 سے 5 کی حد میں ہونے چاہئیں.

source: forecast
es: pronóstico
fr: prévisions
hi: पूर्वानुमान
ja: 天気予報
mr: अंदाज
pt: previsão
te: అంగడి
ur: پیشن گوئی
zh_cn: 天气预报

source: city
es: ciudad
fr: ville
hi: शहर
ja: 市
mr: शहर
pt: cidade
te: నగరం
ur: شہر
zh_cn: 城市

source: day
es: día
fr: jour
hi: दिन
ja: 曜日
mr: दिवस
pt: dia
te: రోజు
ur: دن
zh_cn: 天

source: high
es: alta
fr: maximum
hi: ऊंचा
ja: 高
mr: उच्च
pt: alto
te: అధిక
ur: اعلی
zh_cn: 高

source: low
es: baja
fr: minimum
hi: नीचा
ja: 低
mr: कमी
pt: baixo
te: కనిష్ఠ
ur: کم
zh_cn: 低

source: blink
es: parpadear
fr: clignoter
ja: 点滅する
mr: पिटपिट
pt: piscar
te: బ్లింక్
ur: پلک جھپکنا
zh_cn: 闪烁

source: led
ja: 発光ダイオード
mr: एलईडी
te: ఎలిడి
ur: قیادت

source: light intensity
es: intensidad de luz
fr: intensité lumineuse
ja: 光の強さ
mr: प्रकाश तीव्रता
pt: intensidade da luz
te: కాంతి తీవ్రత
ur: روشنی کی شدت
zh_cn: 光照强度

source: infrared light (left)
es: luz infrarroja (izquierda)
fr: lumière infrarouge (gauche)
ja: 赤外光 （左）
mr: इन्फ्रारेड लाइट (डावा)
pt: luz infravermelha (esquerda)
te: ఇన్ఫ్రారెడ్ లైట్ (ఎడమ)
ur: اورکت روشنی (بائیں)
zh_cn: 红外光（左）

source: infrared light (right)
es: luz infrarroja (derecha)
fr: lumière infrarouge (droite)
ja: 赤外光 （右）
mr: इन्फ्रारेड लाइट (उजवा)
pt: luz infravermelha (direita)
te: ఇన్ఫ్రారెడ్ లైట్ (కుడి)
ur: اورکت روشنی (دائیں)
zh_cn: 红外光（右）

source: move
es: mover
fr: mouvement
hi: सरकाय
ja: 動き出し
mr: हलवा
pt: mover
te: చలింపు
ur: حرکت کریں
zh_cn: 移动

source: Do Re Mi Fa Sol La Ti Do
es: Do Re Mi Fa Sol La Si Do
fr: Do Ré Mi Fa Sol La Ti Do
hi: डो रे मी फा सोल ला टी डो
ja: ド レ ミ ファ ソ ラ シ ド
mr: डो रे मी फा सोल ला ती डो
te: డో రే మి ఫా సోల్ లా టి డో
zh_cn: 哆 来 米 发 唆 拉 西 哆

source: sensors
te: సెన్సర్స్
zh_cn: 传感器

source: media
te: మీడియా
zh_cn: 媒体

source: Save turtle artwork as SVG
es: Guardar la ilustración de la tortuga como SVG
fr: Enregistrer l'œuvre de la tortue en tant que SVG
hi: टर्टल आर्टवर्क को SVG के रूप में सहेजें
ja: アートをSVGで保存
mr: कासवाची कलाकृती SVG म्हणून जतन करा
pt: Salvar ilustração da tartaruga como SVG
te: SVG రూపకలాబద్దం నాటించండి
tr: kaplumbağa resmini svg olarak kaydet
zh_cn: 将海龟图形保存为SVG

source: Click this button to expand or collapse the auxiliary toolbar.
zh_cn: 点击此按钮以展开或收起辅助工具栏

source: perfect octave
zh_cn: 完全八度

source: xor
hi: एक्सओआर
te: జార్
zh_cn: 异或

source: x
hi: एक्स
ja: xざひょう（よこ）
zh_cn: X座標

source: y
hi: वाई
ja: yざひょう（たて）
zh_cn: Y座標

source: rhythm1
es: ritmo
fr: rythme1
hi: ताल1
ja: 連符（かけ算）
mr: रिदम1
pt: ritmo1
te: రిదం1
tr: ritim1
zh_cn: 节奏1

source: AM synth
es: AM sintetizador
fr: synthé AM
hi: ए.एम. सिंथ
ja: AM シンセ
mr: एएम सिंथ
pt: sintetizador AM
te: AM సింథ్
zh_cn: AM 合成器

source: tremolo
hi: ट्रेमोलो
ja: トレモロ
mr: ट्रेमोलो
te: ట్రెమోలో
zh_cn: 颤音

source: arg
hi: तर्क
mr: आर्ग
te: ఆర్గ్
zh_cn: 参数

source: bezier
ja: ベジェ曲線
te: బేజియర్
zh_cn: 贝塞尔曲线

source: show1
es: mostrar
fr: afficher1
ja: スタンプ
pt: mostrar1
te: ప్రదర్శించు1
zh_cn: 显示1

source: modulation index
es: índice de modulación
fr: indice de modulation
hi: मॉड्यूलेशन सूची
ja: モジュレーションインデックス
mr: मॉड्युलेशन निर्देशांक
pt: índice de modulação
te: మాడ్యూలేషన్ సూచి
tr: modülasyon indeksi
zh_cn: 调制指数

source: A-Z
ja: 「A-Z」の順番
mr: ए-झेड
te: వర్గీకరణ
zh_cn: 按字母排序

source: exp
fr: exposant
hi: ऍक्स्प
mr: घातांक
te: ఎక్స్పొనెంషన్
zh_cn: 指数

source: ti la sol fa mi re do
es: si la sol fa mi re do
fr: ti la sol fa mi ré do
hi: ती ला सोल फा मी रे दो
ja: シ ラ ソ ファ ミ レ ド
mr: ती ला सोल फा मी रे दो
pt: si la sol fa mi re do
te: టి లా సోల్ ఫా మి రే దో

source: 日本語
fr: Japonais
mr: जपानी

source: 한국어
fr: Coréen
mr: कोरियन

source: にほんご
fr: Nihongo
mr: जपानी

source: 中文
fr: Chinois
mr: चिनी

source: ภาษาไทย
fr: Thaï
mr: थाई

source: igbo
mr: इग्बो

source: MIDI
hi: मिडी
mr: एमआयडीआय

source: Delete \"<span id=\"deleter-title\"></span>\"?
es: Borrar \"<span id=\"deleter-title\"></span>\"?
fr: Supprimer \"<span id=\"deleter-title\"></span>\"?
hi: \<span id=\"deleter-title\"></span> को हटाएं?
ja: \"<span id=\"deleter-title\"></span>\"を消しますか？
mr: \"<span id=\"deleter-title\"></span>\" हटवायचे?
pt: Excluir \"<span id=\"deleter-title\"></span>\"?
te: తొలగించు \"<span id=\"deleter-title\"></span>\"?

source: Permanently delete project \"<span id=\"deleter-name\"></span>\"?
es: Eliminar permanentemente el proyecto \"<span id=\"deleter-name\"></span>\"?
fr: Supprimer définitivement le projet \"<span id=\"deleter-name\"></span>\"?
hi: क्या आप \<span id=\"deleter-name\"></span> परियोजना को स्थायी रूप से हटाना चाहते हैं?
ja: \"<span id=\"deleter-name\"></span>\"を完全消しますか？
mr: प्रकल्प \"<span id=\"deleter-name\"></span>\" कायमस्वरूपी हटवायचा?
pt: Excluir permnentemente o projeto \"<span id=\"deleter-name\"></span>\"?
te: ప్రాజెక్ట్ \"<span id=\"deleter-name\"></span>\" స్థాయిలో తొలగించాలా?

source: Report projects which violate the <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">Sugar Labs Code of Conduct</a>.
es: Reportar proyectos que violen <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">el código de conducta de Sugar Labs</a>.
fr: Signalez les projets qui violent le <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">code de conduite de Sugar Labs</a>.
ja: <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">シュガー・ラボ
mr: जे प्रकल्प <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">शुगर लॅब्स आचारसंहिता</a> चे उल्लंघन करतात त्यांचा अहवाल द्या.
pt: Avisar sobre projetos que violam o <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">Código de Conduta do Sugar Labs</a>.
te: ప్రోజెక్టులను అనుసరించిన <a href=\"https://github.com/sugarlabs/sugar-docs/blob/master/CODE_OF_CONDUCT.md\" target=\"_blank\">షుగార్ లాబ్స్ కోడ్ ఆఫ్ కండక్ట్</a> ను ఉల్లంఘించండి.

source: Nothing in the trash to restore.
es: Nada en la basura para restaurar.
fr: Rien dans la corbeille à restaurer.

source: Octave value must be between 1 and 10.
es: El bloqueo de silencio no se puede eliminar.

source: To delete a block, just right-click on it, then you will be able to see the delete option
es: Para eliminar un bloque, simplemente haz clic derecho sobre él, luego podrás ver la opción de eliminar.
fr: Pour supprimer un bloc, faites simplement un clic droit dessus, puis vous pourrez voir l'option de suppression
ja: ブロックを消すには、ブロックを右クリックすると「消す」オプションが表示されます。

source: To copy a block, just right-click on it, then you will be able to see the copy option
es: Para copiar un bloque, simplemente haz clic derecho sobre él, luego podrás ver la opción de copiar.
fr: Pour copier un bloc, faites simplement un clic droit dessus, puis vous pourrez voir l'option de copie
ja: ブロックをコピーには、ブロックを右クリックすると「コピー」オプションが表示されます。

source: To extract a block, just right-click on it, then you will be able to see the extract option
es: Para extraer un bloque, simplemente haz clic derecho sobre él, luego podrás ver la opción de extracción.
fr: Pour extraire un bloc, faites simplement un clic droit dessus, puis vous pourrez voir l'option d'extraction

source: Save audio from your project as WAV.
es: Guarda audio de tu proyecto como WAV.
fr: Enregistrer l'audio de votre projet en tant que WAV.
hi: अपनी परियोजना से ऑडियो को डब्लूएवी के रूप में सहेजें।
ja: プロジェクトの音をWAVで保存
te: మీ ప్రాజెక్ట్ ను WAV రూపంలో ఆడియోని భద్రపరచండి.

source: Save your project to as an ABC file.
es: Guarda tu proyecto como un archivo ABC.
fr: Enregistrez votre projet en tant que fichier ABC.
hi: अपनी परियोजना को एक एबीसी फ़ाइल के रूप में सहेजें।
ja: プロジェクトをABCで保存
te: మీ ప్రాజెక్ట్ ను ABC ఫైల్ గా భద్రపరచండి.

source: Save your project to as a Lilypond file.
es: Guarde el proyecto como un archivo de LilyPond.
fr: Enregistrez votre projet en tant que fichier Lilypond.
hi: अपनी परियोजना को एक लिलीपॉंड फ़ाइल के रूप में सहेजें।
ja: 作成した音楽を、コンピューター上でがくふをえがくファイル（Lilypondファイル）に変えてほぞんする。
te: మీ ప్రాజెక్ట్ ను Lilypond ఫైల్ గా భద్రపరచండి.

source: Show or hide a coordinate grid.
es: Mostrar u ocultar las rejillas de coordenadas.
fr: Afficher ou masquer une grille de coordonnées.
hi: कोआर्डिनेट ग्रिड दिखाएँ या छुपाएँ।
ja: カンバス上にほうがん（ざひょう）や中心の角度を表示したり、かくしたりできる。
te: ఒక కోఆర్డినేట్ గ్రిడ్‌ను చూపించాలి లేదా దాచాలి.

source: Expand/collapse collapsable blocks
es: Expandir/contraer los bloques
fr: Développer/réduire les blocs rétractables
hi: विकल्प/संकुचन योग्य ब्लॉक्स को विस्तृत/संकुचित करें
ja: ブロックを広げる/折りたたむ
te: పెరగాలి/కుగాలి మాడిన బ్లాక్‌లను విస్తరించండి/మూసివేయండి

source: Show these messages.
es: Mostrar estos mensajes.
fr: Afficher ces messages.
hi: इन संदेशों को दिखाएँ।
ja: ミスター・マウスによる、ミュージック・ブロックスの説明を表示する。
te: ఈ సందేశాలను చూపించండి.

source: y3
es: y
ja: yざひょうち（ネズミ）

source: x3
es: x
ja: xざひょうち（ネズミ）

source: x2
es: x
ja: よこいどう

source: y2
es: y
ja: たていどう

source: x1
es: x
ja: xざひょう（ネズミ）

source: y1
es: y
ja: yざひょう（ネズミ）

source: हिंदी
fr: Hindi

source: عربى
fr: Arabe

source: తెలుగు
fr: Télougou

source: עִברִית
fr: Hébreu
tr: ערִית

source: The Number to pitch block will convert a pitch number to a pitch name.
fr: Le bloc Numéro à hauteur convertira un numéro de hauteur en un nom de hauteur.

source: show
te: చూపు

source: Clean
te: శుభ్రపరుచు

source: You have chosen key
te: మీరు ఎంచుకున్నారు కీ

source: for your pitch preview.
te: మీ పిచ్ ప్రివ్యూ కోసం

source: grid
te: గ్రిడ్

source: Toggle JavaScript Editor
te: JavaScript ఎడిటర్‌ను టాగిల్ చేయండి

source: Full Screen
te: పూర్తి స్క్రీన్

source: 한국인
te: కొరియన్

source: Cartesian+polar
te: కార్టీషియన్ + పోలార్

source: Lilypond cannot process pickup of
te: Lilypondకు pickup ప్రాసెస్ చేయబడదు

source: music
te: సంగీతం

source: save
te: భద్రపరచండి

source: Run slow
te: ప్రాజెక్ట్‌ను నిధానంగా పరికరించండి

source: Refresh your browser to change to advanced mode.
te: ముందుగానే మోడ్ మార్చడానికి మీ బ్రౌజర్‌ను రిఫ్రెష్ చేయండి.

source: Refresh your browser to change to beginner mode.
te: మొదటి విద్యార్థి మోడ్‌కు మార్చడానికి మీ బ్రౌజర్‌ను రిఫ్రెష్ చేయండి.

source: Show/hide block
te: బ్లాక్ ను చూపు/దాచు

source: envelope
te: ఎన్వలప్

source: filter
te: ఫిల్టర్

source: duration (ms)
te: అవధి (మి.సె.)

source: duplicate
te: డ్యూప్లికేట్

source: stop
te: పైన

source: invert
te: పిచ్ వామకాలానికి రోటేట్ చేస్తుంది

source: n^th Modal Pitch takes the pattern of pitches in semitones for a mode and makes each point a degree of the mode,
te: n^th మోడల్ పిచ్ మోడ్లో సెమీటోన్ల పాటను తీసేసారు మరియు ప్రతి పాయింట్‌ను మోడ్ యొక్క ఒక డిగ్రీగా చేస్తారు,

source: N^th Modal Pitch takes a number as an input as the n^th degree for the given mode. 0 is the first position, 1 is the second, -1 is the note before the first etc.
te: N^th మోడల్ పిచ్ మోడ్ కోసం ఇన్‌పుట్ గా సంఖ్య ను తీసుకునిస్తుంది చివరి డిగ్రీ గా. 0 అందుకే మొదటి స్థానం, 1 అందుకే రెండవ, -1 అందుకే మొదటి ముందు గా ముందు ఉంది మరియు ఇతరు అనేకండి.

source: clear
te: క్లియర్

source: oscillator
te: ఆసిలేటర్

source: delay
te: విలంబన

source: hide blocks
te: భాగాలను దాచు

source: The Scalar Step Block must be used inside of a Note Block.
te: స్కేలార్ స్టెప్ బ్లాక్ నోట్ బ్లాక్ లో ఉపయోగించాలి.

source: The Scalar Step Block must be preceded by a Pitch Block.
te: స్కేలార్ స్టెప్ బ్లాక్ పిచ్ బ్లాక్ ద్వారా ముందుకు వాడాలి.

source: meantone
te: మీంటోన్

source: New action block generated!
te: కొత్త యాక్షన్ బ్లాక్ సృష్టించబడింది!

source: close
te: మూస

source: duration
te: అవధి

source: Publish Project
te: ప్రచురించు ప్రాజెక్ట్

source: play
te: ఆడుకొను
