Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: Perfect fifth
es: Quinta perfecta
fr: Quinte parfaite
ja: 完全5度
mr: संपूर्ण पाचवा
tr: mükemmel beşinci
ur: کامل پانچواں
zh_cn: 完全五度

source: Diminished sixth
es: Sexto disminuido
fr: Sixte diminuée
ja: 減6度
mr: कमी सहावा
tr: eksiltilmiş altıncı
ur: پتلا چھٹا
zh_cn: 减六度

source: Minor sixth
es: Sexto menor
fr: Sixte mineure
ja: 短6度
mr: लहान सहावा
tr: minör altılı
ur: معمولی چھٹا
zh_cn: 小六度

source: Augmented fifth
es: Quinta aumentada
fr: Quinte augmentée
ja: 増5度
mr: वाढलेला पाचवा
tr: artırılmış beşinci
ur: اگنمنٹ پانچواں
zh_cn: 增五度

source: Major sixth
es: Sexto mayor
fr: Sixte majeure
ja: 長6度
mr: मोठा सहावा
tr: büyük altıncı
ur: میجر چھٹا
zh_cn: 大六度

source: Diminished seventh
es: Séptimo disminuido
fr: Septième diminuée
ja: 減7度
mr: कमी सातवा
tr: eksiltilmiş yedili
ur: ساتویں نمبر پر
zh_cn: 减七度

source: Minor seventh
es: Séptimo menor
fr: Septième mineure
ja: 短7度
mr: लहान सातवा
tr: minör yedili
ur: معمولی ساتواں
zh_cn: 小七度

source: Augmented sixth
es: Sexto aumentado
fr: Sixte augmentée
ja: 増6度
mr: वाढलेला सहावा
tr: artırılmış altıncı
ur: اگست چھٹا
zh_cn: 增六度

source: Major seventh
es: Séptimo mayor
fr: Septième majeure
ja: 長7度
mr: मोठा सातवा
tr: majör yedili
ur: میجر ساتواں
zh_cn: 大七度

source: Diminished octave
es: Octavo disminuido
fr: Octave diminuée
ja: 減8度
mr: कमी सप्तक
tr: eksiltilmiş oktav
ur: متحرک آکٹیو
zh_cn: 减八度

source: Perfect octave
es: Octavo perfecto
fr: Octave parfaite
ja: 完全8度
mr: संपूर्ण सप्तक
tr: mükemmel oktav
ur: کامل آکٹیو
zh_cn: 完全八度

source: Augmented seventh
es: Séptimo aumentado
fr: Septième augmentée
ja: 増7度
mr: वाढलेला सातवा
tr: artırılmış yedili
ur: ساتویں نمبر پر

source: Minor ninth
es: Novena menor
fr: Neuvième mineure
ja: 短9度
mr: लहान नववा
tr: minör dokuzlu
ur: معمولی نویں

source: Augmented octave
es: Octavo aumentado
fr: Octave augmentée
ja: 増8度
mr: वाढलेले सप्तक
tr: artırılmış oktav
ur: اگنمنٹ آکٹیو
zh_cn: 增八度

source: Major ninth
es: Novena mayor
fr: Neuvième majeure
ja: 長9度
mr: मोठा नववा
tr: majör dokuzuncu
ur: میجر نویں
zh_cn: 大九度

source: Diminished tenth
es: Décima disminuida
fr: Dixième diminuée
ja: 減10度
mr: कमी दहावा
tr: eksiltilmiş onda bir
ur: دسویں تاریخ
zh_cn: 减十度

source: Minor tenth
es: Décima menor
fr: Dixième mineure
ja: 短10度
mr: लहान दहावा
tr: minör onda bir
ur: معمولی دسویں
zh_cn: 小十度

source: Augmented ninth
es: Novena aumentada
fr: Neuvième augmentée
ja: 増9度
mr: वाढलेला नववा
tr: artırılmış dokuzuncu
ur: اگمنٹ نویں
zh_cn: 增九度

source: Major tenth
es: Décima mayor
fr: Dixième majeure
ja: 長10度
mr: मोठा दहावा
tr: büyük onuncu
ur: میجر دسویں
zh_cn: 大十度

source: Diminished eleventh
es: Undécimo disminuido
fr: Onzième diminuée
ja: 減11度
mr: कमी अकरावा
tr: eksiltilmiş onbirinci
ur: گیارہویں
zh_cn: 减十一度

source: Perfect eleventh
es: Undécimo perfecto
fr: Onzième parfaite
ja: 完全11度
mr: संपूर्ण अकरावा
tr: mükemmel onbi̇ri̇nci̇
ur: کامل گیارہویں
zh_cn: 纯十一度

source: Augmented tenth
es: Décima aumentada
fr: Dixième augmentée
ja: 増10度
mr: वाढलेला दहावा
tr: artırılmış onda bir
ur: اگیمنٹ دسویں
zh_cn: 增十度

source: Diminished twelfth
es: Doce disminuido
fr: Douzième diminuée
ja: 減12度
mr: कमी बारावा
tr: eksiltilmiş onikinci
ur: پتلا ہوا بارہویں
zh_cn: 减十二度

source: Augmented eleventh
es: Undécimo aumentado
fr: Onzième augmentée
ja: 増11度
mr: वाढलेला अकरावा
tr: artırılmış onbirinci
ur: اگمنٹ گیارہویں
zh_cn: 增十一度

source: Perfect twelfth
es: Doce perfecto
fr: Douzième parfaite
ja: 完全12度
mr: संपूर्ण बारावा
tr: mükemmel oni̇ki̇nci̇
ur: کامل بارہویں
zh_cn: 纯十二度

source: Diminished thirteenth
es: Decimotercero disminuido
fr: Treizième diminuée
ja: 減13度
mr: कमी तेरावा
tr: azaltılmış onüçüncü
ur: دیمین تیرہویں
zh_cn: 减十三度

source: Minor thirteenth
es: Doce menor
fr: Treizième mineure
ja: 短13度
mr: लहान तेरावा
tr: minör onüçüncü
ur: معمولی تیرہویں
zh_cn: 小十三度

source: Augmented fifth, plus an octave
es: Quinta aumentada, más una octava
fr: Quinte augmentée, plus une octave
ja: 増12度
mr: वाढलेला पाचवा, एक सप्तक
tr: augmented fifth
ur: اگمنٹڈ پانچواں ، اور اس کے علاوہ ایک آکٹیو
zh_cn: 增五度加八度

source: Major thirteenth
es: Decimotercero mayor
fr: Treizième majeure
ja: 長13度
mr: मोठा तेरावा
tr: on üçüncü büyük
ur: میجر تیرہویں
zh_cn: 大十三度

source: Diminished seventh, plus an octave
es: Séptimo disminuido, más una octava
fr: Septième diminuée, plus une octave
ja: 減14度
mr: कमी सातवा, एक सप्तक
tr: eksiltilmiş yedili
ur: ساتویں ، اور ایک آکٹیو کے علاوہ
zh_cn: 减七度加八度

source: 1st 2nd 3rd 4th 5th 6th 7th 8th 9th 10th 11th 12th
es: 1Âº 2Âº 3Âº 4Âº 5Âº 6Âº 7Âº 8Âº 9Âº 10Âº 11Âº 12Âº
fr: 1er 2e 3e 4e 5e 6e 7e 8e 9e 10e 11e 12e
hi: 1वा 2वा 3वा 4वा 5वा 6वा 7वा 8वा 9वा 10वा 11वा 12वा
ja: １度 2度 3度 4度 5度 6度 7度 8度 9度 10度 11度 12度
mr: १ला २रा ३रा ४था ५वा ६वा ७वा ८वा ९वा १०वा ११वा १२वा
pt: 1º 2º 3º 4º 5º 6º 7º 8º 9º 10º 11º 12º
te: 1వ 2వ 3వ 4వ 5వ 6వ 7వ 8వ 9వ 10వ 11వ 12వ
ur: پہلا 2 واں تیسرا 4 واں 5 واں 6 واں 7 8 واں 9 واں 10 واں 11 واں 12 واں
zh_cn: 第一 第二 第三 第四 第五 第六 第七 第八 第九 第十 第十一 第十二

source: augmented
es: aumentado
fr: augmenté
hi: बढ़ाया हुआ
ja: オーギュメント（増）
mr: वाढलेला
pt: aumentado
te: అభ్యంగం
ur: بڑھا ہوا
zh_cn: 增音程

source: diminished
es: disminuido
fr: diminué
hi: कम
ja: ディミニッシュ（減）
mr: कमी
pt: diminuído
te: తగినిపడించబడింది
tr: eksiltilmiş
ur: کم
zh_cn: 减音程

source: perfect
es: perfecto
fr: parfait
hi: पूर्ण
ja: パーフェクト（完全）
mr: संपूर्ण
pt: perfeito
te: పరిపూర్ణ
tr: mükemmel
ur: کامل
zh_cn: 纯音程

source: chromatic
es: cromático
fr: chromatique
hi: क्रोमैटिक
ja: クロマティック音階
mr: क्रोमॅटिक
pt: cromático
te: క్రోమాటిక్
tr: kromatik
ur: رنگین
zh_cn: 半音阶

source: algerian
es: argelino
fr: algérien
hi: अल्जीरियन
ja: アルジェリア音階
mr: अल्जेरियन
pt: algeriano
te: అల్జీరియన్
tr: Cezayir
ur: الجزائر

source: spanish
es: español
fr: espagnol
hi: स्पेनिश
ja: スペイン音階
mr: स्पॅनिश
pt: espanhol
te: స్పానిష్
tr: ispanyolca
ur: ہسپانوی
zh_cn: 西班牙调式

source: octatonic
fr: octatonique
hi: ऑक्टाटॉनिक
ja: オクタトニック・スケール
mr: ऑक्टाटोनिक
pt: octatônico
te: ఆక్టాటోనిక్
tr: oktatonik
ur: آکٹٹونک
zh_cn: 八音阶

source: harmonic major
es: armónico mayor
fr: majeur harmonique
hi: हार्मोनिक मेजर
ja: ハーモニック・メジャー（和声長音階）
mr: हार्मोनिक मेजर
pt: harmônico maior
te: హార్మోనిక్ మేజర్
tr: armonik majör
ur: ہارمونک میجر
zh_cn: 和声大调

source: natural minor
es: natural menor
fr: mineur naturel
hi: नैचुरल माइनर
ja: 自然短音階
mr: नैसर्गिक लहान
pt: menor natural
te: న్యాచరల్ మైనర్
tr: doğal minör
ur: قدرتی معمولی
zh_cn: 自然小调

source: harmonic minor
es: armónico menor
fr: mineur harmonique
hi: हार्मोनिक माइनर
ja: 和声短音階
mr: हार्मोनिक लहान
pt: harmônico menor
te: హార్మోనిక్ మైనర్
tr: armonik minör
ur: ہارمونک معمولی
zh_cn: 和声小调

source: melodic minor
es: melódico menor
fr: mineur mélodique
hi: मेलोडिक माइनर
ja: 旋律短音階
mr: मेलोडिक लहान
pt: menor melódico
te: మెలోడిక్ మైనర్
tr: melodik minör
ur: میلوڈک معمولی
zh_cn: 旋律小调

source: dorian
es: dorio
fr: dorien
hi: डोरियन
ja: ドリアン音階
mr: डोरियन
pt: doriano
te: డోరియన్
ur: ڈورین
zh_cn: 多利安调式

source: phrygian
es: frigio
fr: phrygien
hi: फ्रिजियन
ja: フリジアン音階
mr: फ्रिजियन
pt: phrygianiano
te: ఫ్రిజియన్
ur: فریگین
zh_cn: 弗利几亚调式

source: lydian
es: lidio
fr: lydien
hi: लिडियन
ja: リディアン音階
mr: लिडियन
pt: lydiano
te: లిడియన్
ur: لڈیان
zh_cn: 利底亚调式

source: mixolydian
es: mixolidio
fr: mixolydien
hi: मिक्सोलिडियन
ja: ミクソリディアン音階
mr: मिक्सोलिडियन
pt: mixolydiano
te: మిక్సొలిడియన్
ur: مکسولیڈین
zh_cn: 米克索利底亚调式

source: locrian
fr: locrien
hi: लोक्रियन
ja: ロクリアン音階
mr: लोक्रीयन
pt: locriano
te: లొక్రియన్
ur: لوکرین
zh_cn: 洛克利亚调式

source: jazz minor
es: jazz menor
fr: mineur jazz
hi: जैज माइनर
ja: オルタード音階
mr: जाझ लहान
pt: jazz menor
te: జాజ్ మైనర్
tr: caz yan dalı
ur: جاز معمولی
zh_cn: 爵士小调

source: bebop
hi: बीबॉप
ja: ビバップ音階
mr: बेबॉप
te: బిబొప్
ur: بیپ

source: arabic
es: arábica
fr: arabe
hi: अरबी
ja: アラビア音階
mr: अरबी
pt: arábico
te: అరబిక్
tr: arapça
ur: عربی
zh_cn: 阿拉伯调式

source: byzantine
es: bizantino
fr: byzantin
hi: बाइज़ंटाइन
ja: ビザンティン
mr: बायझेंटाईन
pt: bizantino
te: బిజంటీన్
ur: بازنطینی
zh_cn: 拜占庭调式

source: enigmatic
es: enigmático
fr: énigmatique
hi: एनिगमैटिक
ja: ヴェルディの音階
mr: एनीगमॅटिक
pt: enigmático
te: ఎనిగ్మాటిక్
tr: esrarengiz
ur: خفیہ
zh_cn: 谜样调式

source: ethiopian
es: etíope
fr: éthiopien
hi: इथियोपियन
ja: エチオピア音階
mr: इथिओपियन
pt: etiopiano
te: ఇథియోపియన్
tr: etiyopyalı
ur: ایتھوپیا
zh_cn: 埃塞俄比亚调式

source: geez
hi: गीज़
ja: ゲエズ音階
mr: गीझ
te: గీజ్
ur: گیز

source: hindu
es: hindú
fr: hindou
hi: हिन्दू
ja: ヒンドゥー音階
mr: हिंदू
te: హిందూ
ur: ہندو
zh_cn: 印度调式

source: hungarian
es: húngaro
fr: hongrois
hi: हंगेरियन
ja: ハンガリー音階
mr: हंगेरियन
pt: húngaro
te: హంగేరియన్
ur: ہنگری
zh_cn: 匈牙利调式

source: romanian minor
es: romano menor
fr: mineur roumain
hi: रोमानियन माइनर
ja: ルーマニア・マイナー音階
mr: रोमानियन लहान
pt: romano menor
te: రొమానియన్ మైనర్
tr: romanyali küçük
ur: رومن معمولی
zh_cn: 罗马尼亚小调

source: spanish gypsy
es: gitana española
fr: gitan espagnol
hi: स्पैनिश जिप्सी
ja: スパニッシュ・ジプシー音階
mr: स्पॅनिश जिप्सी
pt: espanhol cigano
te: స్పానిష్ జిప్సి
tr: ispanyol çingene
ur: ہسپانوی خانہ بدوش
zh_cn: 西班牙吉普赛调式

source: maqam
hi: मकाम
ja: マカーム音階
mr: मक़ाम
pt: maqamo
te: మాకం
tr: makam
ur: مام

source: minor blues
es: blues menor
fr: blues mineur
hi: माइनर ब्लूज
ja: マイナー・ブルース音階
mr: लहान ब्लूज
pt: blues menor
te: మైనర్ బ్లూస్
tr: minör blues
ur: معمولی بلیوز
zh_cn: 小调布鲁斯

source: major blues
es: blues mayor
fr: blues majeur
hi: मेजर ब्लूज
ja: メジャー・ブルース音階
mr: मोठा ब्लूज
pt: blues maior
te: మేజర్ బ్లూస్
tr: büyük blues
ur: بڑے بلیوز
zh_cn: 大调布鲁斯

source: whole tone
es: tono completo
fr: ton entier
hi: होल टोन
ja: ホールトーン音階
mr: संपूर्ण टोन
pt: tom inteiro
te: హోల్ టోన్
tr: tüm ton
ur: پورا لہجہ
zh_cn: 全音音阶

source: minor pentatonic
es: pentatonic minor
fr: pentatonique mineur
hi: माइनर पेंटाटॉनिक
ja: マイナー・ペンタトニック音階
mr: लहान पेंटाटोनिक
pt: pentatônico menor
te: మైనర్ పెంటటోనిక్
tr: minör pentatonik
ur: معمولی پینٹاٹونک
zh_cn: 小调五声音阶

source: major pentatonic
es: pentatonic mayor
fr: pentatonique majeur
hi: मेजर पेंटाटॉनिक
ja: メジャー・ペンタトニック音階
mr: मोठा पेंटाटोनिक
pt: pentatônico maior
te: మేజర్ పెంటటోనిక్
tr: majör pentatonik
ur: اہم پینٹاٹونک
zh_cn: 大调五声音阶

source: chinese
es: chino
fr: chinois
hi: चाइनीज़
ja: 中国音階
mr: चायनीज
pt: chinês
te: చైనీస్
tr: çin
ur: چینی
zh_cn: 中国调式

source: egyptian
es: egipcio
fr: égyptien
hi: इज़िप्शियन
ja: エジプト音階
mr: इजिप्शियन
pt: egípcio
te: ఎజిప్షియన్
tr: Mısır
ur: مصری
zh_cn: 埃及调式

source: hirajoshi
hi: हिराजोशी
ja: 平調子
mr: हिराजोशी
te: హిరజోషి
ur: ہیرجوشی
zh_cn: 平调式

source: Japan
es: Japón
fr: Japon
hi: जापान
ja: 日本
mr: जपान
pt: Japão
te: జపాన్
tr: Japonya
ur: جاپان
zh_cn: 日本调式

source: in
ja: 陰音階
mr: मध्ये
pt: em
te: ఇన్
ur: میں

source: minyo
hi: मिन्यो
ja: 民謡音階
mr: मिन्यो
te: మిన్యో
ur: منیو
zh_cn: 民谣调式

source: fibonacci
hi: फिबोनाची
ja: フィボナッチ音階
mr: फिबोनाची
te: ఫిబొనాచి
ur: فبونیکی
zh_cn: 斐波那契

source: custom
es: personalizado
fr: personnalisé
hi: अनुकूलित
ja: オリジナル
mr: सानुकूल.
pt: personalizar
te: అనుకూలం
tr: özel
ur: کسٹم
zh_cn: 自定义

source: highpass
fr: passe-haut
hi: हाईपास
ja: ハイパス・フィルター
mr: हायपास
te: హైపాస్ ఫిల్టర్
ur: ہائی پاس
zh_cn: 高通滤波器

source: lowpass
fr: passe-bas
hi: लोपास
ja: ローパス・フィルター
mr: लोपास
te: లోపాస్
ur: کم پاس
zh_cn: 低通滤波器

source: bandpass
fr: passe-bande
hi: बैंडपास
ja: バンドパス・フィルター
mr: बँडपास
te: బ్యాండ్‌పాస్
ur: بینڈ پاس
zh_cn: 带通滤波器

source: highshelf
fr: étagère haute
hi: हाईशेल्फ
ja: ハイシェルフ・フィルター
mr: हायशेल्फ
te: హై‌షెల్ఫ్
ur: ہائی شیلف
zh_cn: 高架滤波器

source: lowshelf
fr: étagère basse
hi: लोशेल्फ
ja: ローシェルフ・フィルター
mr: लोशेल्फ
te: లో‌షెల్ఫ్
ur: لوشیلف
zh_cn: 低架滤波器

source: notch
hi: नॉच
ja: ノッチ・フィルター
mr: नॉच
pt: entalhe
te: నాచ్
tr: çentik
ur: نوچ
zh_cn: 陷波滤波器

source: allpass
fr: passe-tout
hi: ऑलपास
ja: オールパスフィルター
mr: ऑलपास
te: ఆల్‌పాస్
ur: آل پاس
zh_cn: 全通滤波器

source: peaking
fr: crête
hi: पीकिंग
ja: ピーク・フィルタ
mr: पीकिंग
pt: pico
te: పికింగ్
tr: zirve
ur: جھانکنا
zh_cn: 峰值滤波器

source: sine
fr: sinusoïde
hi: साइन
ja: サイン波
mr: साइन.
pt: sino
te: సైన్
tr: sinüs
ur: سائن
zh_cn: 正弦波

source: square
es: cuadrado
fr: carré
hi: वर्ग
ja: 四角の波
mr: चौरस.
pt: quadrado
te: చదరం
tr: kare
ur: مربع
zh_cn: 方波

source: triangle
es: triángulo
hi: त्रिकोण
ja: 三角の波
mr: त्रिकोण.
pt: triângulo
te: ముక్కోన
tr: üçgen
ur: مثلث
zh_cn: 三角波

source: sawtooth
es: diente de sierra
fr: dent de scie
hi: सॉटूथ
ja: ぎざぎざの波
mr: सॉटूथ.
pt: dente de serra
te: ముక్కోని
tr: testere dişi
ur: چوٹوتھ
zh_cn: 锯齿波

source: even
es: par
fr: pair
hi: सम
ja: 偶数
mr: सम
pt: par
te: సమం
tr: çift
ur: یہاں تک کہ یہاں تک بھی
zh_cn: 偶数

source: odd
es: impar
fr: impair
hi: विषम
ja: 奇数
mr: विषम
pt: ímpar
te: అసమం
tr: tek
ur: عجیب
zh_cn: 奇数

source: scalar
es: escalar
fr: scalair
hi: स्कैलर
ja: 音階的
mr: स्केलर
pt: escalar
te: స్కాలర్
tr: skaler
ur: اسکیلر
zh_cn: 标量

source: piano
hi: पियानो
ja: ピアノ
mr: पियानो.
te: పియానో
tr: piyano
ur: پیانو
zh_cn: 钢琴

source: violin
es: violín
fr: violon
hi: वायलिन
ja: バイオリン
mr: व्हायोलिन.
pt: violino
te: వయలిన్
tr: keman
ur: وایلن
zh_cn: 小提琴

source: viola
fr: alto
hi: वायोला
ja: ビオラ
mr: व्हायोला.
te: వాయలా
tr: viyola
ur: وایلا
zh_cn: 中提琴

source: xylophone
es: xilófono
hi: क्सीलोफ़ोन
ja: 木琴
mr: झायलोफोन.
te: జ్యానతి
tr: ksilofon
ur: زائلفون
zh_cn: 木琴

source: vibraphone
es: vibráfono
hi: वाइब्राफ़ोन
ja: 鉄琴
mr: वाईब्राफोन.
te: వైబ్రఫోన్
tr: vibrafon
ur: وابرا فون
zh_cn: 颤音琴

source: cello
es: violonchelo
fr: violoncelle
hi: चेलो
ja: チェロ
mr: सेलो.
pt: violoncelo
te: సెల్లో
tr: viyolonsel
ur: سیلو
zh_cn: 大提琴

source: double bass
es: contrabajo
fr: contrebasse
hi: डबल बास
ja: ダブルベース
mr: डबल बास.
te: డబుల్ బాస్
tr: kontrbas
ur: ڈبل باس
zh_cn: 低音提琴

source: guitar
es: guitarra
fr: guitare
hi: गिटार
ja: ギター
mr: गिटार.
pt: guitarra
te: గిటార్
tr: gitar
ur: گٹار
zh_cn: 吉他

source: sitar
ur: ستار
zh_cn: 锡塔尔琴

source: acoustic guitar
es: guitarra acustica
fr: guitare acoustique
hi: एकॉस्टिक गिटार
ja: アコースティック
mr: अकौस्टिक गिटार.
pt: violão acústico
te: ఆకస్టిక్ గిటార్
tr: akustik gitar
ur: دونک گٹار
zh_cn: 原声吉他

source: flute
es: flauta
fr: flûte
hi: बांसुरी
ja: フルート
mr: बासरी.
pt: flauta
te: ఫ్లూట్
tr: flüt
ur: بانسری
zh_cn: 长笛

source: clarinet
es: clarinete
fr: clarinette
hi: क्लैरिनेट
ja: クラリネット
mr: क्लारिनेट.
pt: Clarineta
te: క్లారినెట్
tr: klarnet
ur: کلیرینیٹ
zh_cn: 单簧管

source: saxophone
es: saxofón
hi: सैक्सोफोन
ja: サクソフォン
mr: सॅक्सोफोन.
pt: saxofone
te: సాక్సోఫోన్
tr: saksafon
ur: سیکسفون
zh_cn: 萨克斯管

source: tuba
hi: ट्यूबा
ja: チューバ
mr: टुबा.
te: ట్యూబా
ur: ٹوبا
zh_cn: 大号

source: trumpet
es: trompeta
fr: trompette
hi: ट्रंपेट
ja: トランペット
mr: तुरही.
pt: trumpete
te: ట్రంపెట్
tr: trompet
ur: ترہی
zh_cn: 小号

source: oboe
fr: hautbois
hi: ओबो
ja: オーボエ
mr: ओबो.
te: ఒబో
tr: obua
ur: اوبو
zh_cn: 双簧管

source: trombone
es: trombón
hi: ट्रॉम्बोन
ja: トロンボーン
mr: ट्रोम्बोन.
te: ట్రాంబోన్
tr: trombon
ur: ٹرومبون
zh_cn: 长号

source: electronic synth
es: sintetizador electronico
fr: synthétiseur électronique
hi: इलेक्ट्रॉनिक सिंथ
ja: シンセサイザー
mr: इलेक्ट्रॉनिक सिंथ.
pt: sintetizador eletrônico
te: ఎలక్ట్రానిక్ సింత్
tr: elektronik synth
ur: الیکٹرانک سنتھ
zh_cn: 电子合成器

source: simple 1
hi: सिम्पल 1
ja: シンプル１
mr: सरल 1.
pt: simples 1
te: సింపుల్ 1
tr: basit 1
ur: آسان 1
zh_cn: 简单1

source: simple 2
hi: सिम्पल 2
ja: シンプル２
mr: सोपे २
pt: simples 2
te: సింపుల్ 2
tr: basit 2
ur: آسان 2
zh_cn: 简单2

source: simple 3
hi: सिम्पल 3
ja: シンプル３
mr: सोपे ३
pt: simples 3
te: సింపుల్ 3
tr: basit 3
ur: آسان 3
zh_cn: 简单3

source: simple 4
hi: सिम्पल 4
ja: シンプル４
mr: सोपे ४
pt: simples 4
te: సింపుల్ 4
tr: basit 4
ur: آسان 4
zh_cn: 简单4

source: white noise
es: ruido blanco
fr: bruit blanc
ja: ホワイトノイズ
mr: पांढरा आवाज.
pt: ruído branco
te: వైట్ నాయిజ్
tr: beyaz gürültü
ur: سفید شور
zh_cn: 白噪音

source: brown noise
es: ruido marrón
fr: bruit brun
hi: ब्राउन नॉइज़
ja: ブラウンノイズ
mr: तपकिरी आवाज.
pt: ruído marrom
te: బ్రౌన్ నాయిస్
tr: kahverengi gürültü
ur: بھوری شور
zh_cn: 棕色噪音

source: pink noise
es: ruido rosa
fr: bruit rose
hi: पिंक नॉइज़
ja: ピンクノイズ
mr: गुलाबी आवाज.
pt: ruído rosa
te: పింక్ నాయిస్
tr: pembe gürültü
ur: گلابی شور
zh_cn: 粉红噪音

source: snare drum
es: tambor militar pequeño
fr: caisse claire
hi: स्नेयर ड्रम
ja: スネアドラム
mr: स्नेर ड्रम.
pt: tarola
te: స్నేర్ డ్రమ్
tr: trampet
ur: پھندا ڈرم
zh_cn: 军鼓

source: kick drum
es: tambor de patada
fr: grosse caisse
hi: किक ड्रम
ja: キックドラム
mr: किक ड्रम.
pt: bumbo
te: కిక్ డ్రమ్
tr: tekme davulu
ur: کک ڈرم
zh_cn: 大鼓

source: tom tom
hi: टॉम टॉम
ja: タムタム
mr: टॉम टॉम.
te: టామ్ టామ్
ur: ٹام
zh_cn: 通通鼓

source: floor tom
es: piso tom
fr: tom de sol
hi: फ्लोर टॉम
ja: フロアタム
mr: फ्लोर टॉम.
pt: tom baixo
te: ఫ్లోర్ టామ్
tr: zemin tom
ur: ٹام
zh_cn: 落地鼓

source: bass drum
es: tambor de bajo
fr: grosse caisse
hi: बेस ड्रम
ja: バスドラム
mr: बास ड्रम.
te: బాస్ డ్రమ్
tr: bas davul
ur: باس ڈرم
zh_cn: 低音鼓

source: cup drum
es: taza de tambor
fr: tambour en coupe
hi: कप ड्रम
ja: カップドラム
mr: कप ड्रम.
pt: tambor de taça
te: కప్ డ్రం
tr: fincan tamburu
ur: کپ ڈرم
zh_cn: 杯鼓

source: darbuka drum
es: darbuka
fr: darbouka
hi: दरबूका ड्रम
ja: ダブカドラム
mr: दारबुका ड्रम.
pt: tambor de darbuka
te: డార్బుకా డ్రం
tr: darbuka davulu
ur: ڈاربوکا ڈرم
zh_cn: 达布卡鼓

source: hi hat
fr: charleston
hi: हाई हैट
ja: ハイハット
mr: हाय हॅट.
te: హై హ్యాట్
tr: merhaba şapka
ur: ہائے ہیٹ
zh_cn: 踩镲

source: ride bell
es: campana de paseo
fr: cloche ride
hi: राइड बेल
ja: ライドベル
mr: राइड बेल.
pt: pequeno sino
te: రైడ్ బెల్
tr: çana binmek
ur: سواری کی گھنٹی
zh_cn: 骑铃

source: cow bell
es: campana de vaca
fr: cloche de vache
hi: काउ बेल
ja: カウベル
mr: काऊ बेल.
pt: sino de vaca
te: కౌ బెల్
tr: inek çanı
ur: گائے کی گھنٹی
zh_cn: 牛铃

source: japanese drum
es: tambor japonés
fr: tambour japonais
hi: जापानी ड्रम
ja: 太鼓
mr: जपानी ढोल
te: జపనీస్ డ్రమ్
tr: japon davulu
ur: جاپانی ڈرم
zh_cn: 日本鼓

source: japanese bell
es: campana japonesa
fr: cloche japonaise
hi: जापानी बेल
ja: 鉦
mr: जपानी बेल.
te: జపనీస్ బెల్
tr: japon çanı
ur: جاپانی گھنٹی
zh_cn: 日本铃

source: triangle bell
es: campana triangular
fr: triangle
hi: त्रिकोण बेल
ja: トライアングル
mr: त्रिकोण बेल.
pt: sino triângular
te: ట్రయాంగిల్ బెల్
tr: üçgen çan
ur: مثلث گھنٹی
zh_cn: 三角铃

source: finger cymbals
es: castañuelas
fr: cymbalettes
hi: फिंगर सिम्बल्स
ja: フィンガーシンバル
mr: फिंगर सिम्बल्स.
pt: estalar de dedos
te: ఫింగర్ సింబల్స్
tr: parmak zilleri
ur: انگلی کی جھلیوں
zh_cn: 指钹

source: chime
es: campaneo
fr: carillon
hi: चाइम
ja: チャイム
mr: चाइम.
pt: carrilhão
te: చైమ్
tr: çan
ur: چمچہ
zh_cn: 风铃

source: gong
hi: गॉंग
ja: ドラ
mr: गाँग.
te: గాంగ్
ur: گونگ
zh_cn: 锣

source: clang
es: estruendo
fr: cliquetis
hi: क्लैंग
ja: カチャカチャ
mr: क्लँग.
te: క్లాంగ్
ur: کلانگ
zh_cn: 叮当声

source: crash
es: choque
hi: क्रैश
ja: クラッシュ
mr: क्रॅश.
pt: bater
te: క్రాష్
tr: çarpma
ur: کریش
zh_cn: 撞击声

source: bottle
es: botella
fr: bouteille
hi: बॉटल
ja: 空きびん
mr: बॉटल.
pt: garrafa
te: బాటిల్
tr: şişe
ur: بوتل
zh_cn: 瓶子声

source: clap
es: palmada
fr: claquement
hi: क्लैप
ja: てびょうし
mr: क्लॅप.
pt: palmas
te: క్లాప్
tr: alkış
ur: تالیاں
zh_cn: 拍手声

source: slap
es: bofetada
fr: claque
hi: स्लैप
ja: ピシャリ
mr: स्लॅप.
pt: tapa
te: స్లాప్
tr: tokat
ur: تھپڑ مارا
zh_cn: 拍打声

source: splash
es: salpicadura
fr: éclaboussure
hi: स्प्लैश
ja: しぶき
mr: स्प्लॅश.
te: స్ప్లాష్
tr: sıçrama
ur: سپلیش
zh_cn: 水花声

source: bubbles
es: burbujas
fr: bulles
hi: बबल्स
ja: あわ
mr: बुडबुडे
pt: bolhas
te: బబుల్స్
tr: baloncuklar
ur: بلبلوں
zh_cn: 气泡声

source: raindrop
es: gota de agua
fr: goutte de pluie
hi: रेनड्रॉप
ja: 雨のしずく
mr: पावसाचा थेंब
te: రెయిండ్రాప్
tr: yağmur damlası
ur: رندروپ
zh_cn: 雨滴声

source: cat
es: gato
fr: chat
hi: बिल्ली
ja: ねこ
mr: मांजर
pt: gato
te: క్యాట్
tr: kedi
ur: بلی
zh_cn: 猫

source: cricket
es: grillo
fr: grillon
hi: क्रिकेट
ja: こおろぎ
mr: झिंगे
pt: grilo
te: క్రికెట్
tr: kriket
ur: کرکٹ
zh_cn: 蟋蟀声

source: dog
es: perro
fr: chien
hi: कुत्ता
ja: いぬ
mr: कुत्रा
pt: cachorro
te: డాగ్
tr: köpek
ur: کتا
zh_cn: 狗

source: banjo
hi: बैंजो
ja: バンジョー
mr: बँजो.
te: బ్యాంజో
ur: بینجو
zh_cn: 班卓琴

source: koto
hi: कोतो
ja: こと
mr: कोटो.
te: కోటో
ur: کوٹو
zh_cn: 琴

source: dulcimer
hi: डल्सिमर
ja: ダルシマー
mr: डल्सिमर.
te: డల్సిమర్
tr: santur
ur: ڈولکیمر
zh_cn: 扬琴

source: electric guitar
es: guitarra electrica
fr: guitare électrique
hi: इलेक्ट्रिक गिटार
ja: エレキギター
mr: इलेक्ट्रिक गिटार.
pt: Guitarra elétrica
te: ఎలక్ట్రిక్ గిటార్
tr: elektro gitar
ur: الیکٹرک گٹار
zh_cn: 电吉他

source: bassoon
es: fagot
fr: basson
hi: बैसून
ja: バスーン
mr: बॅसून.
te: బాసూన్
tr: fagot
ur: باسون
zh_cn: 巴松管

source: celeste
fr: célesta
hi: सेलेस्ट
ja: セレスタ
mr: सेलेस्टे.
te: సెలెస్ట్
ur: سیلسٹ
zh_cn: 颤音琴

source: equal
es: igual
fr: égal
hi: इक्वल
ja: 平均律
mr: समान
pt: igual
te: సమాన
tr: eşit
ur: برابر
zh_cn: 平均律

source: Pythagorean
es: Pitagórico
fr: Pythagoricien
hi: पिथागोरियन
ja: ピタゴラス音律
mr: पायथागोरियन
pt: Pitagórico
te: పైతాగోరియన్
tr: Pisagorcu
ur: پائیٹاگورین
zh_cn: 毕达哥拉斯律

source: just intonation
es: solo entonación
fr: intonation juste
hi: जस्ट इंटोनेशन
ja: 純正律
mr: फक्त ट्यूनिंग
pt: apenas entonação
te: కేవల సరళ సమాంతరం
tr: sadece tonlama
ur: صرف بدیہی
zh_cn: 纯律

source: Meantone
ja: 中全音律
mr: मिन्टोन
ur: مینٹون
zh_cn: 中庸律

source: major 7th
es: 7mo mayor
fr: septième majeure
hi: मेजर 7वां
ja: 長七の和音（メイジャー・セブンス)
mr: मोठा ७वा
te: మేజర్ 7వ
tr: majör 7'li
ur: اہم 7 واں
zh_cn: 大七度

source: minor 7th
es: 7mo menor
fr: septième mineure
hi: माइनर 7वां
ja: 短七の和音（マイナー・セブンス）
mr: लहान ७वा
te: మైనర్ 7వ
tr: minör 7'li
ur: معمولی 7 واں
zh_cn: 小七度

source: dominant 7th
es: 7ma dominante
fr: septième dominante
hi: डॉमिनेंट 7वां
ja: 属七の和音（ドミナント・セブンス）
mr: प्रभावी ७वा
te: డామినెంట్ 7వ
tr: baskın 7'li
ur: غالب 7 واں
zh_cn: 属七度

source: minor-major 7th
es: 7mo menor-mayor
fr: septième mineure-majeure
hi: माइनर-मेजर 7वां
ja: 短三長七の和音（マイナー・メイジャー・セブンス）
mr: लहान-मोठा ७वा
te: మైనర్-మేజర్ 7వ
ur: معمولی میجر 7 واں
zh_cn: 小大七度

source: fully-diminished 7th
es: 7Âº completamente disminuido
fr: septième complètement diminuée
hi: फुली-डिमिनिश 7वां
ja: 減七の和音（ディミニッシュト・セブンス）
mr: पूर्णपणे कमी ७वा
te: పూర్ణం-డిమినిష్డ్ 7వ
ur: مکمل طور پر ختم شدہ 7 ویں
zh_cn: 完全减七度

source: half-diminished 7th
es: 7Âº medio disminuido
fr: septième demi-diminuée
hi: हाफ-डिमिनिश 7वां
ja: 減五短七の和音（ハーフ・ディミニッシュト）
mr: अर्धवट कमी ७वा
te: హాఫ్-డిమినిష్డ్ 7వ
ur: نصف جہتی 7 ویں
zh_cn: 半减七度

source: Equal (12EDO)
es: Igual (12EDO)
fr: Égal (12EDO)
ja: 12平均律
mr: समान (१२ईडीओ)
tr: eşit (12edo) (Bağlam
ur: مساوی (12 ای ڈی او)مساوی (7EDO)
zh_cn: 十二平均律

source: Equal (5EDO)
es: Igual (5EDO)
fr: Égal (5EDO)
ja: 5平均律
mr: समान (५ईडीओ)
tr: eşit (5edo) (Bağlam
ur: مساوی (5EDO)
zh_cn: 五平均律

source: Equal (7EDO)
es: Igual (7EDO)
fr: Égal (7EDO)
ja: 7平均律
mr: समान (७ईडीओ)
tr: eşit (7edo) (Bağlam
ur: مساوی (7EDO)
zh_cn: 七平均律

source: Equal (19EDO)
es: Igual (19EDO)
fr: Égal (19EDO)
ja: 19平均律
mr: समान (१९ईडीओ)
tr: eşit (19edo) (Bağlam
ur: مساوی (19 ای ڈی او)
zh_cn: 十九平均律

source: Equal (31EDO)
es: Igual (31EDO)
fr: Égal (31EDO)
ja: 31平均律
mr: समान (३१
tr: eşit (31edo) (Bağlam
ur: مساوی (31 ای ڈی او)
zh_cn: 三十一平均律

source: 5-limit Just Intonation
es: 5-Límite de entonación justa
fr: Intonation Juste à 5-Limites
ja: 5限界純正律
mr: ५-सीमित शुद्ध स्वर
ur: 5-لیمیٹ صرف ارادے
zh_cn: 五限纯律

source: Pythagorean (3-limit JI)
es: Pythagorean (3-limite EJ)
fr: Pythagoricien (JI à 3-Limites)
ja: ピタゴラス音律
mr: पायथागोरियन (३-सीमित शुद्ध स्वर)
ur: پائیٹاگورین (3-لیمیٹ جے آئی)
zh_cn: 毕达哥拉斯（三级纯律）

source: current
es: actuales
fr: actuel
hi: वर्तमान
ja: 現在の
mr: सध्याचा
pt: atual
te: ప్రస్తుత
tr: akım
ur: موجودہ
zh_cn: 当前

source: next
es: próximo
fr: suivant
hi: अगला
ja: この次の
mr: पुढील
pt: próximo
te: తరువాత
tr: sonraki
ur: اگلا
zh_cn: 下一个

source: previous
es: anterior
fr: précédent
hi: पिछला
ja: この前の
mr: मागील
pt: anterior
te: మునుపటి
tr: önceki
ur: پچھلا
zh_cn: 上一个

source: simple-2
hi: सिंपल-2
ja: シンプル・シンセ２
mr: सरल-2.
pt: simples-2
te: సింపుల్-2
ur: آسان 2

source: simple-3
hi: सिंपल-3
ja: シンプル・シンセ３
mr: सरल-3.
pt: simples-3
te: సింపుల్-3
ur: آسان 3

source: simple-4
hi: सिंपल-4
ja: シンプル・シンセ４
mr: सरल-4.
pt: simples-4
te: సింపుల్-4
ur: آسان 4

source: taiko
hi: ताइको
ja: 太鼓
mr: ताईको.
te: టైకో
ur: تائیکو
