Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: eg guitar violin snare drum etc.
es: por ejemplo, guitarra, violín, tambor
fr: par exemple guitare, violon, caisse claire, etc.
hi: जैसे गिटार वायलिन स्नेयर ड्रम आदि।
ja: <br>
mr: उदा. गिटार वायोलिन स्नेर ड्रम इ.
pt: por exemplo, guitarra violino tambor snare etc.
te: ఉదా. గిటార్, వాయలిన్, స్నేయర్ డ్రం మరియు ఇతరులు.
tr: örn
ur: جیسے گٹار وائلن اسنیر ڈرم وغیرہ
zh_cn: 例如 吉他 小提琴 小军鼓 等等。

source: The default volume is 50.
es: El volumen predeterminado es 50.
fr: Le volume par défaut est de 50.
hi: डिफ़ॉल्ट वॉल्यूम 50 है।
ja: デフォルトは音量５０。
mr: डीफॉल्ट व्हॉल्यूम ५० आहे.
pt: O volume padrão é 50.
te: డిఫాల్ట్ వాల్యూమ్ 50 ఉంది.
tr: varsayılan birim 50'dir
ur: پہلے سے طے شدہ حجم 50 ہے۔
zh_cn: 默认音量是50。

source: The range is 0 for silence to 100 for full volume.
es: El rango es de 0 para el silencio a 100 para el volumen completo.
fr: La plage va de 0 pour le silence à 100 pour le volume maximal.
hi: स्नेहिलता के लिए 0 से पूर्ण वॉल्यूम के लिए 100।
ja: ０から１００までのすうちをせっていできる。<br><br>
mr: शांततेसाठी श्रेणी 0 ते पूर्ण आवाजासाठी 100 आहे.
pt: O intervalo é de 0 para o silêncio e 100 para o volume total.
te: వాల్యూమ్ యొక్క శాంతత కోసం 0 నుండి పూర్తి వాల్యూమ్ కోసం 100 వరకు ఉంది.
tr: dür. (Bağlam: aralık sessizlik için 0
ur: خاموشی کے لیے رینج 0 سے مکمل والیوم کے لیے 100 ہے۔
zh_cn: 范围是0表示静音，100表示最大音量。

source: set panning
es: establecer panorámica
fr: régler la panoramique
hi: पैनिंग सेट करें
ja: ステレオを設定
mr: पॅनिंग सेट करा
te: ప్యానింగ్ ను సెట్ చేయండి
tr: kaydırmayı ayarla
ur: پیننگ سیٹ کریں
zh_cn: 设置声像

source: The Set Panning block sets the panning for all synthesizers.
es: El bloque Establecer Panorámica establece el panorama para todos los sintetizadores.
fr: Le bloc Régler la panoramique règle la panoramique pour tous les synthétiseurs.
hi: सेट पैनिंग ब्लॉक सभी सिंथाइज़र्स के लिए पैनिंग सेट करता है।
mr: सेट पॅनिंग ब्लॉक सर्व सिंथेसायझरसाठी पॅनिंग सेट करतो.
te: సెట్ పానింగ్ బ్లాక్ అన్ని సింథెసైజర్ల కోసం పానింగ్ను సెట్ చేస్తుంది.
tr: set panning bloğu tüm synthesizer'lar için kaydırmayı ayarlar
ur: سیٹ پیننگ بلاک تمام سنتھیسائزرز کے لیے پیننگ سیٹ کرتا ہے۔
zh_cn: Set Panning 块设置所有合成器的声像。

source: Warning: Sound is coming out from only the left or right side.
es: Advertencia: El sonido sale solo del lado izquierdo o derecho.
fr: Attention : Le son ne sort que du côté gauche ou droit.
hi: चेतावनी: ध्वनि केवल बाएं या दाएं ओर से आ रही है।
ja: ワーニング：音は右か左だけのスピーカーから出ている
mr: इशारा: आवाज फक्त डाव्या किंवा उजव्या बाजूने येत आहे.
te: హెచ్చరిక: ధ్వని కేవలం ఎడమ లేదా కుడి వైపున నుండి వస్తుంది.
tr: uyarı
ur: انتباہ: آواز صرف بائیں یا دائیں طرف سے آرہی ہے۔
zh_cn: 警告：声音仅从左侧或右侧发出。

source: set master volume
es: filar volumen maestro
fr: régler le volume principal
hi: मास्टर वॉल्यूम सेट करें
ja: 全体の音量をせってい
mr: मास्टर आवाज सेट करा
pt: definir volume mestre
te: "మాస్టర్ వాల్యూమ్ ను సెట్ చేయండి.
tr: ana ses seviyesini ayarla
ur: ماسٹر حجم مقرر کریں
zh_cn: 设置主音量

source: The Set master volume block sets the volume for all synthesizers.
es: El bloque Ajuste volumen maestro establece el volumen para todos los sintetizadores.
fr: Le bloc Régler le volume principal règle le volume pour tous les synthétiseurs.
hi: सेट मास्टर वॉल्यूम ब्लॉक सभी सिंथाइज़र्स के लिए वॉल्यूम सेट करता है।
ja: <h2>全体の音量をせっていブロック</h2><br>全体の音量をせっていする。
mr: सेट मास्टर वॉल्यूम ब्लॉक सर्व सिंथेसायझरचा आवाज सेट करतो.
pt: O bloco Definir volume mestre define o volume para todos os sintetizadores.
te: సెట్ మాస్టర్ వాల్యూమ్ బ్లాక్ అన్ని సింథెసైజర్ల కోసం వాల్యూమ్ను సెట్ చేస్తుంది.
tr: set master volume bloğu tüm synthesizer'lar için ses seviyesini ayarlar
ur: سیٹ ماسٹر والیوم بلاک تمام سنتھیسائزرز کے لیے والیوم سیٹ کرتا ہے۔
zh_cn: Set master volume 块设置所有合成器的音量。

source: The Set relative volume block changes the volume of the contained notes.
es: El bloque Fijar volumen relativo cambia el volumen de las notas contenidas.
fr: Le bloc Régler le volume relatif change le volume des notes contenues.
hi: सेट रिलेटिव वॉल्यूम ब्लॉक शामिल नोट्स की वॉल्यूम को बदलता है।
mr: सेट रिलेटिव्ह वॉल्यूम ब्लॉक समाविष्ट नोट्सचा आवाज बदलतो.
pt: O bloco Define de volume relativo altera o volume das notas contidas.
te: సెట్ రిలేటివ్ వాల్యూమ్ బ్లాక్ ఉన్న నోట్ల వాల్యూమ్ను మార్చిపెడతాయి.
tr: set relative volume bloğu içerdiği notaların ses seviyesini değiştirir
ur: سیٹ رشتہ دار والیوم بلاک موجود نوٹوں کے حجم کو تبدیل کرتا ہے۔
zh_cn: Set relative volume 块改变包含音符的音量。

source: set relative volume
es: fijar volumen relativo
fr: régler le volume relatif
hi: रिलेटिव वॉल्यूम सेट करें
ja: 相対音量を設定
mr: सापेक्ष आवाज सेट करा
pt: definir volume relativo
te: రిలేటివ్ వాల్యూమ్ ను సెట్ చేయండి.
tr: göreli hacmi ayarla
ur: رشتہ دار حجم مقرر کریں
zh_cn: 设置相对音量

source: decrescendo
fr: décrescendo
hi: डेक्रेसेंडो
ja: デクレシェンド
mr: डिक्रेसेंडो
te: డెక్రెసెండో
ur: کمی
zh_cn: 渐弱

source: crescendo
hi: क्रेशेंडो
ja: クレシェンド
mr: क्रेसेंडो
te: క్రిస్సెండో
ur: عروج
zh_cn: 渐强

source: one
es: uno
fr: un
ja: １度
mr: एक
tr: bir
ur: ایک
zh_cn: 一

source: two
es: dos
fr: deux
ja: ２度
mr: दोन
tr: iki
ur: دو
zh_cn: 二

source: three
es: tres
fr: trois
ja: ３度
mr: तीन
tr: üç
ur: تین
zh_cn: 三

source: four
es: cuatro
fr: quatre
ja: ４度
mr: चार
tr: dört
ur: چار
zh_cn: 四

source: five
es: cinco
fr: cinq
ja: ５度
mr: पाच
tr: beş
ur: پانچ
zh_cn: 五

source: six
es: seis
ja: ６度
mr: सहा
tr: altı
ur: چھ
zh_cn: 六

source: seven
es: siete
fr: sept
ja: ７度
mr: सात
tr: yedi
ur: سات
zh_cn: 七

source: eight
es: ocho
fr: huit
ja: ８度
mr: आठ
tr: sekiz
ur: آٹھ
zh_cn: 八

source: nine
es: nueve
fr: neuf
ja: ９度
mr: नऊ
tr: dokuz
ur: نو
zh_cn: 九

source: below
es: abajo
fr: en dessous
ja: 下
mr: खाली
tr: aşağıda
ur: نیچے
zh_cn: 下方

source: above
es: arriba
fr: au-dessus
ja: 上
mr: वर
tr: yukarıda
ur: اوپر
zh_cn: 上方

source: plus
es: más
ja: と
mr: अधिक
tr: artı
ur: پلس
zh_cn: 加

source: Adding missing pitch number 0.
es: Agregar el número de tono que falta 0.
fr: Ajout du numéro de hauteur manquant 0.
hi: गायन संख्या 0 जोड़ी जा रही है।
ja: ピッチ数値「0」を加える
mr: गहाळ पिच नंबर 0 जोडत आहे.
pt: Adicionando o número de tom ausente 0.
te: కనిపించిన పిచ్ సంఖ్య 0 ను జోడిస్తోంది.
tr: eksik perde numarası 0 ekleniyor
ur: گمشدہ پچ نمبر 0 شامل کرنا۔
zh_cn: 添加缺失的音高编号0。

source: Ignoring pitch numbers less than zero or greater than eleven.
es: Ignorando los números de tono menos de cero o más de once.
fr: Ignorant les numéros de hauteur inférieurs à zéro ou supérieurs à onze.
hi: 0 से कम या 11 से अधिक स्वर संख्याओं को अनदेखा कर रहा है।
ja: ピッチ数値の数のうち、0未満あるいは11より大きい数は無視します。
mr: शून्यापेक्षा कमी किंवा अकरापेक्षा जास्त पिच नंबर दुर्लक्षित करत आहे.
pt: Ignorando números de tom menores que zero ou maiores que onze.
te: సిరికొన్ని లేదా పదినాలు కంటే ఎక్కువ పిచ్ సంఖ్యలను ప్రతిక్షణానికి ప్రమాదించబడుతుంది.
tr: sıfırdan küçük veya on birden büyük perde sayılarını yok saymak
ur: صفر سے کم یا گیارہ سے زیادہ پچ نمبروں کو نظر انداز کرنا۔
zh_cn: 忽略小于零或大于十一的音高编号。

source: Ignoring duplicate pitch numbers.
es: Ignorando números de tono duplicados.
fr: Ignorant les numéros de hauteur en double.
hi: डुप्लिकेट स्वर संख्याओं को अनदेखा कर रहा है।
ja: 重複しているピッチ数値は無視します
mr: डुप्लिकेट पिच नंबर दुर्लक्षित करत आहे.
pt: Ignorando números de tom duplicados.
te: నకిలీవేయబడిన పిచ్ సంఖ్యలను ప్రతిక్షణానికి ప్రమాదించబడుతుంది.
tr: yinelenen perde numaralarını yok sayma
ur: ڈپلیکیٹ پچ نمبروں کو نظر انداز کرنا۔
zh_cn: 忽略重复的音高编号。

source: font
es: fuente
fr: police
hi: फ़ॉन्ट
ja: フォント
mr: फॉन्ट
te: ఫాంట్
tr: yazı tipi
ur: فونٹ
zh_cn: 字体

source: Dictionary with this name does not exist
es: No existe diccionario con este nombre
fr: Le dictionnaire avec ce nom n'existe pas
ja: この名前の辞書は存在しません。
mr: या नावाचा शब्दकोश अस्तित्वात नाही
tr: bu isimde bir sözlük mevcut değil
ur: اس نام کی لغت موجود نہیں ہے۔
zh_cn: 不存在该名称的词典

source: Key with this name does not exist in
es: La clave con este nombre no existe en
fr: La clé avec ce nom n'existe pas dans
ja: この名前のキーワードは次の辞書に入ていません：
mr: या नावाची कळ अस्तित्वात नाही
ur: اس نام کے ساتھ کلید موجود نہیں ہے۔

source: Noise Block: Did you mean to use a Note block?
es: Bloque de ruido: Quizás quiso decir utilizar un bloque de nota?
fr: Bloc Bruit: Vouliez-vous utiliser un bloc Note?
hi: नॉइज ब्लॉक: क्या आपने एक नोट ब्लॉक का इस्तेमाल करने का इरादा किया है?
ja: 音符ブロックを使いますか？
mr: नॉईज ब्लॉक: तुम्ही नोट ब्लॉक वापरण्याचा विचार केला होता का?
pt: Bloco de Ruído: Você quis usar um bloco de Notas?
te: నాయిస్ బ్లాక్: మీరు నోట్ బ్లాక్ ఉపయోగించాలా?
tr: gürültü bloğu
ur: شور بلاک: کیا آپ کا مطلب نوٹ بلاک استعمال کرنا تھا؟
zh_cn: 噪声块：您是否想使用音符块？

source: Vibrato intensity must be between 1 and 100.
es: La intensidad del vibrato debe estar entre 1 y 100.
fr: L'intensité du vibrato doit être comprise entre 1 et 100.
hi: विब्राटो तीव्रता 1 और 100 के बीच होनी चाहिए।
ja: ビブラートの大きさは、1から100までのはんいでせっていしてください。
mr: वायब्रेटो तीव्रता 1 आणि 100 दरम्यान असावी.
pt: A intensidade do vibrato deve estar entre 1 e 100.
te: విబ్రాటో ఇంటెన్సిటి 1 నుండి 100 మధ్యలో ఉండాలి.
tr: vibrato yoğunluğu 1 ile 100 arasında olmalıdır
ur: وائبراٹو کی شدت 1 اور 100 کے درمیان ہونی چاہیے۔
zh_cn: 震音强度必须在1和100之间

source: Vibrato rate must be greater than 0.
es: La velocidad del vibrato debe ser mayor que 0.
fr: La vitesse du vibrato doit être supérieure à 0.
hi: विब्राटो दर 0 से अधिक होनी चाहिए।
ja: ビブラートのはやさは、0より大きいあたいをせっていしてください。
mr: वायब्रेटो दर 0 पेक्षा जास्त असावा.
pt: A taxa de vibrato deve ser maior que 0.
te: విబ్రాటో రేట్ 0 కంటే ఎక్కువ ఉండాలి.
tr: vibrato oranı 0'dan büyük olmalıdır
ur: وائبراٹو کی شرح 0 سے زیادہ ہونی چاہیے۔
zh_cn: 震音率必须大于0

source: Depth is out of range.
es: El valor de profundidad está fuera de rango.
fr: La profondeur est hors de portée.
hi: गहराई सीमा से बाहर है।
ja: （エフェクタの）深さの数字が変域外です。
mr: खोलाई श्रेणीबाहेर आहे.
pt: A profundidade está fora do limite.
te: డెప్త్ అవుట్ ఆఫ్ రేంజ్ లో ఉంది.
tr: derinlik aralık dışında
ur: گہرائی حد سے باہر ہے۔
zh_cn: 深度超出范围。

source: Distortion must be from 0 to 100.
es: El valor de distorsión debe ser de 0 a 100.
fr: La distorsion doit être comprise entre 0 et 100.
hi: विरुपण 0 से 100 के बीच होना चाहिए।
ja: ディストーションは、0から100までのはんいでせっていしてください。
mr: विकृती 0 ते 100 दरम्यान असावी.
pt: A distorção deve ser de 0 a 100.
te: డిస్టోర్షన్ 0 నుండి 100 వరకు ఉండాలి.
tr: bozulma 0 ila 100 arasında olmalıdır
ur: تحریف 0 سے 100 تک ہونی چاہیے۔
zh_cn: 失真值必须在0到100之间。

source: Partial must be greater than or equal to 0.
es: Parcial debe ser mayor o igual a 0.
fr: La composante partielle doit être supérieure ou égale à 0.
hi: आंश 0 से अधिक या इसके बराबर होना चाहिए।
ja: 倍音が０以上である必要があります。
mr: आंशिक 0 पेक्षा जास्त किंवा समान असावे.
pt: Parcial deve ser maior ou igual a 0.
te: పార్షియల్ 0 నుండి కనీసం ఎక్కువ ఉండాలి.
tr: kısmi 0'dan büyük veya eşit olmalıdır
ur: جزوی 0 سے بڑا یا اس کے برابر ہونا چاہیے۔
zh_cn: 部分必须大于或等于0。

source: Unable to use synth due to existing oscillator
es: No se puede usar el sintetizador debido al bloqueo del oscilador.
fr: Impossible d'utiliser le synthé en raison de l'oscillateur existant
hi: मौजूदा ऑस्किलेटर के कारण सिंथ का उपयोग नहीं किया जा सकता
ja: オシレーターがあるため、シンセが使えません。
mr: विद्यमान ऑसिलेटरमुळे सिंथ वापरू शकत नाही
pt: Não é possível usar o sintetizador devido ao oscilador existente
te: ప్రస్తుత ఆసిలేటర్ కారణంగా సింథ్ ను ఉపయోగించలేరు
tr: mevcut osilatör nedeniyle synth kullanılamıyor
ur: موجودہ oscillator کی وجہ سے synth استعمال کرنے سے قاصر ہے۔
zh_cn: 由于存在振荡器，无法使用合成器。

source: The input cannot be negative.
es: La entrada no puede ser negativa.
fr: L'entrée ne peut pas être négative.
hi: इनपुट नकारात्मक नहीं हो सकता।
ja: マイナスの数値をいれることはできません。
mr: इनपुट नकारात्मक असू शकत नाही.
pt: A entrada não pode ser negativa.
te: ఇన్‌పుట్ నేగటివ్ కాకపోవడం లేదు.
tr: girdi negatif olamaz
ur: ان پٹ منفی نہیں ہو سکتا۔
zh_cn: 输入不能为负数。

source: beats per minute must be greater than
es: latidos por minuto deben ser mayores que
fr: les battements par minute doivent être supérieurs à
hi: प्रति मिनट बीट 30 से अधिक होना चाहिए
ja: １分あたりの拍の数には、これより大きい値を設定してください：
mr: बीट्स प्रति मिनिट जास्त असणे आवश्यक आहे
te: ప్రతి నిమిషాల ప్రతి నిమిషాల పెరిగిన బీటుల సంఖ్య కంటే ఎక్కువవి
tr: dakikadaki atım sayısı
ur: دھڑکن فی منٹ سے زیادہ ہونی چاہیے۔
zh_cn: 每分钟节拍数必须大于

source: maximum
es: máximo
hi: अधिकतम
ja: 最大限
mr: कमाल
te: గరిష్ట
tr: maksimum
ur: زیادہ سے زیادہ
zh_cn: 最大值

source: beats per minute is
es: latidos por minuto es
fr: les battements par minute sont
hi: प्रति मिनट बीट
ja: １分あたりの拍の数は
mr: बीट्स प्रति मिनिट आहे
te: ప్రతి నిమిషాల పెరిగిన బీటుల సంఖ్య ఉంది
tr: dakika başına vuruş
ur: دھڑکن فی منٹ ہے
zh_cn: 每分钟节拍数是

source: Take a tour
es: Hacer un recorrido
fr: Faire une visite
hi: एक यात्रा करें
ja: ツアーを始めよう
mr: एक फेरी घ्या
tr: bir tur atın
ur: ایک سیر کریں۔
zh_cn: 开始导览

source: Pause
es: Pausa
hi: रुकें
ja: 止める
mr: थांबा
pt: Pausar
te: విరామం
tr: Duraklatma
ur: توقف
zh_cn: 暂停

source: Warning: Sample is bigger than 1MB.
es: Advertencia: la muestra es más grande que 1 MB.
fr: Attention : L'échantillon est supérieur à 1 Mo.
hi: चेतावनी: सैंपल 1MB से बड़ा है।
ja: ワーニング：サンプルは１MBより大きいです。
mr: इशारा: नमुना 1MB पेक्षा मोठा आहे.
te: హెచ్చరిక: సాంపిల్ 1MB కంటే ఎక్కువది.
tr: warning
ur: انتباہ: نمونہ 1MB سے بڑا ہے۔
zh_cn: 警告：样本大于1MB。

source: New start block generated
es: Nuevo bloque de inicio generado
fr: Nouveau bloc de démarrage généré
ja: 新しい「スタート」ブロックを作りました。
mr: नवीन प्रारंभ ब्लॉक निर्माण केला
tr: yeni başlangıç bloğu oluşturuldu
ur: نیا اسٹارٹ بلاک تیار ہوا۔
zh_cn: 生成了新的开始块

source: MIDI loading. This may take some time depending upon the number of notes in the track
es: Carga MIDI. Esto puede tardar un tiempo dependiendo de la cantidad de notas en la pista.
fr: Chargement MIDI. Cela peut prendre un certain temps en fonction du nombre de notes dans le morceau
ja: 「MIDI]を読み込み中です。音符の数とトラックの数によって時間がかかるかもしれません。
mr: MIDI लोड करत आहे. ट्रॅकमधील नोट्सच्या संख्येवर अवलंबून हे काही वेळ घेऊ शकते
tr: midi yüklemesi
ur: MIDI لوڈ ہو رہا ہے۔ ٹریک میں نوٹوں کی تعداد کے لحاظ سے اس میں کچھ وقت لگ سکتا ہے۔
zh_cn: MIDI加载中。根据曲目中的音符数量，可能需要一些时间

source: Upload failed: Sample is not a .wav file.
es: Error en la carga: la muestra no es un archivo .WAV.
fr: Échec du téléchargement : L'échantillon n'est pas un fichier .wav.
hi: अपलोड विफल: सैंपल .wav फ़ाइल नहीं है।
ja: アップロードできませんでした： サンプルは .wavファイルでは ありません。
mr: अपलोड अयशस्वी: नमुना .wav फाइल नाही.
te: అప్‌లోడ్ విఫలమైంది: సాంపిల్ .wav ఫైల్ కాదు.
tr: yükleme başarısız
ur: اپ لوڈ ناکام: نمونہ .wav فائل نہیں ہے۔
zh_cn: 上传失败：样本不是.wav文件。

source: Save sample
es: Guardar muestra de audio
fr: Enregistrer l'échantillon
hi: सैंपल सहेजें
ja: 音色 サンプルを 保存
mr: नमुना जतन करा
te: సాంపిల్ భద్రపరచండి
tr: örneği kaydet
ur: نمونہ محفوظ کریں۔
zh_cn: 保存样本

source: Click in the grid to add steps to the arpeggio.
es: Haga clic en la cuadrícula para agregar pasos al arpegio.
fr: Cliquez dans la grille pour ajouter des étapes à l'arpège.
hi: आर्पेजियो में कदम जोड़ने के लिए ग्रिड में क्लिक करें।
ja: テーブルを クリックでアルペジオのピッチを加える。
mr: अर्पेजिओमध्ये पायऱ्या जोडण्यासाठी ग्रीडवर क्लिक करा.
te: ఆర్పెజియోకు చివరిని జోడించడానికి గ్రిడ్‌లో నొక్కండి.
tr: arpeje adım eklemek için ızgaraya tıklayın
ur: arpeggio میں اقدامات شامل کرنے کے لیے گرڈ میں کلک کریں۔
zh_cn: 点击网格以添加琶音步骤。

source: Play all
es: Jugar todo
fr: Tout jouer
hi: सभी बजाएं
ja: 全てさいせい
mr: सर्व वाजवा
pt: Executar tudo
te: అన్నింటిని ఆడు
tr: tümünü oynat
ur: سب کھیلیں
zh_cn: 全部播放

source: Reset
es: Reiniciar
fr: Réinitialiser
hi: रीसेट
ja: リセット
mr: रीसेट
te: రీసెట్
tr: Sıfırlama
ur: دوبارہ ترتیب دیں
zh_cn: 重置

source: Click in the circle to select strong beats for the meter.
es: Haga clic en el círculo para seleccionar ritmos fuertes para el medidor.
fr: Cliquez dans le cercle pour sélectionner les temps forts pour le mètre.
hi: मीटर के लिए मजबूत बीट्स का चयन करने के लिए वृत्त में क्लिक करें।
ja: クリックで強い拍の位置を選べます。
mr: मीटरसाठी मजबूत बीट्स निवडण्यासाठी वर्तुळात क्लिक करा.
te: మీటర్కు బలంగా పడే టక్కరిని ఎంచుకోవడానికి వైరాచించండి.
tr: Ölçü için güçlü vuruşları seçmek üzere daireye tıklayın
ur: میٹر کے لیے مضبوط دھڑکنوں کو منتخب کرنے کے لیے دائرے میں کلک کریں۔
zh_cn: 点击圆圈选择强拍。

source: Rotate counter clockwise
es: Girar en sentido antihorario
fr: Tourner dans le sens antihoraire
hi: घड़ी की उल्टी दिशा में घुमाएं
ja: 左回りにずれる
mr: काउंटर क्लॉकवाइज फिरवा
pt: Rodar no sentido anti-horário
te: ప్రాక్కాలంకే తిరిగించు
tr: saat yönünün tersine döndürmek
ur: گھڑی کی مخالف سمت میں گھمائیں۔
zh_cn: 逆时针旋转

source: Rotate clockwise
es: Girar en sentido horario
fr: Tourner dans le sens horaire
hi: घड़ी की दिशा में घुमाएं
ja: 右回りにずれる
mr: क्लॉकवाइज फिरवा
pt: Rodar no sentido horário
te: దక్షిణాకాలంకే తిరిగించు
tr: saat yönünde döndür
ur: گھڑی کی سمت گھمائیں۔
zh_cn: 顺时针旋转

source: Undo
es: Deshacer
fr: Annuler
hi: पूर्ववत् करें
ja: １つもどす
mr: पूर्ववत
pt: Desfazer
te: విస్తరించు
tr: Geri Al
ur: کالعدم
zh_cn: 撤销

source: Click in the circle to select notes for the mode.
es: Haga clic en el círculo para seleccionar notas para el modo.
fr: Cliquez dans le cercle pour sélectionner les notes pour le mode.
hi: संगीतिक मोड के लिए नोट्स का चयन करने के लिए वृत्त में क्लिक करें.
ja: クリックで音の高さを選んで音階を設定できます。
mr: मोडसाठी नोट्स निवडण्यासाठी वर्तुळात क्लिक करा.
pt: Clique no círculo para selecionar notas para o modo.
te: మోడ్ కోసం నోట్లను ఎంచుకోవడానికి వృత్తంలో నొక్కండి.
tr: modun notalarını seçmek için daireye tıklayın
ur: موڈ کے لیے نوٹس منتخب کرنے کے لیے دائرے میں کلک کریں۔
zh_cn: 点击圆圈选择调式音符。

source: New action block generated.
es: Nuevo bloque de acción creado.
fr: Nouveau bloc d'action généré.
ja: 新しいアクションを作りました。
mr: नवीन कृती ब्लॉक तयार केला.
tr: yeni eylem bloğu oluşturuldu
ur: نیا ایکشن بلاک تیار ہوا۔
zh_cn: 生成了新的动作块。

source: Add note
es: Agrega una nota
fr: Ajouter une note
hi: नोट जोड़ें
ja: 音符を足す
mr: नोट जोडा
te: గానా జోడించండి
tr: not ekle
ur: نوٹ شامل کریں۔
zh_cn: 添加音符

source: Metronome
es: Metrónomo
fr: Métronome
hi: मेट्रोनोम
ja: メトロノーム
mr: मेट्रोनोम
te: మెట్రానోమ్
tr: Metronom
ur: میٹرنوم
zh_cn: 节拍器

source: Note value
tr: nota değeri
ur: نوٹ ویلیو
zh_cn: 音符值

source: New action blocks generated.
es: Nuevo bloques de acción creado.
fr: Nouveaux blocs d'action générés.
ja: 新しいアクションを作りました。
mr: नवीन क्रिया ब्लॉक्स निर्माण केले.
tr: yeni eylem blokları oluşturuldu
ur: نئے ایکشن بلاکس بنائے گئے۔
zh_cn: 生成了新的动作块。

source: MIDI device present.
es: Dispositivo MIDI presente.
fr: Périphérique MIDI présent.
hi: MIDI उपकरण मौजूद है।
ja: MIDIデバイスが見つかりました。
mr: MIDI उपकरण उपस्थित आहे.
te: MIDI పరికరం ఉంది.
tr: midi cihazı mevcut
ur: MIDI ڈیوائس موجود ہے۔
zh_cn: 检测到MIDI设备。

source: No MIDI device found.
es: No se encontró ningún dispositivo MIDI.
fr: Aucun périphérique MIDI trouvé.
hi: कोई MIDI उपकरण नहीं मिला।
ja: MIDIデバイスが見つかりません。
mr: कोणतेही MIDI उपकरण सापडले नाही.
te: MIDI పరికరం కనబడలేదు.
tr: midi aygıtı bulunamadı
ur: کوئی MIDI آلہ نہیں ملا۔
zh_cn: 未找到MIDI设备。

source: Failed to get MIDI access in browser.
es: Error al obtener acceso MIDI en el navegador.
fr: Échec de l'accès MIDI dans le navigateur.
hi: ब्राउज़र में MIDI पहुँचने में विफल।
ja: ブラウザはMIDIのアクセスができませんでした。
mr: ब्राउझरमध्ये MIDI प्रवेश मिळविण्यात अपयश.
te: బ్రౌజర్లో MIDI ప్రాప్తి చేయడం విఫలమైంది.
tr: tarayıcıda midi erişimi sağlanamadı
ur: براؤزر میں MIDI تک رسائی حاصل کرنے میں ناکام۔
zh_cn: 浏览器中获取MIDI访问失败。

source: Click in the grid to map notes to drums.
es: Haga clic en la cuadrícula para asignar notas a sonidos de tambors
fr: Cliquez dans la grille pour mapper les notes aux tambours.
hi: ग्रिड में नोट्स को ड्रम्स से मैप करने के लिए क्लिक करें.
ja: グラフにクリックして音符をどちらのドラムに変えるか決めることができます。
mr: नोट्स ड्रम्सवर मॅप करण्यासाठी ग्रीडवर क्लिक करा.
pt: Clique na grade para mapear notas para a bateria
te: గ్రిడ్లో క్లిక్ చేసి గానాలను డ్రంస్‌కు మ్యాప్ చేయండి.
tr: notaları davullarla eşleştirmek için ızgaraya tıklayın
ur: ڈرم پر نوٹوں کا نقشہ بنانے کے لیے گرڈ میں کلک کریں۔
zh_cn: 点击网格将音符映射到鼓声。

source: Move up
es: Ascender
fr: Déplacer vers le haut
hi: ऊपर जाएं
ja: 上げる
mr: वर हलवा
pt: Mover para cima
te: పైకి జరుపు
tr: yukarı hareket et
ur: اوپر بڑھیں۔
zh_cn: 向上移动

source: Move down
es: Descender
fr: Déplacer vers le bas
hi: नीचे जाएं
ja: 下げる
mr: खाली हलवा
pt: Mover para baixo
te: క్రిందకు జరుపు
tr: aşağı hareket et
ur: نیچے کی طرف بڑھیں۔
zh_cn: 向下移动

source: Click on the slider to create a note block.
es: Haga clic en el control deslizante para crear un bloque de notas.
fr: Cliquez sur le curseur pour créer un bloc de notes.
hi: नोट ब्लॉक बनाने के लिए स्लाइडर पर क्लिक करें.
ja: スライダーで音の高さを変えます。
mr: नोट ब्लॉक तयार करण्यासाठी स्लायडरवर क्लिक करा.
te: నోట్ బ్లాక్ సృష్టించడానికి స్లైడర్ మీద క్లిక్ చేయండి.
tr: Bir not bloğu oluşturmak için kaydırıcıya tıklayın
ur: نوٹ بلاک بنانے کے لیے سلائیڈر پر کلک کریں۔
zh_cn: 点击滑块以创建音符块。

source: Play chord
es: Tocar un acorde
fr: Jouer l'accord
hi: कॉर्ड बजाएं
ja: 和音を再生する
mr: तार वाजवा
pt: Tocar acorde
te: ఛార్డ్ ప్లే చేయండి
tr: akor çal
ur: راگ بجانا
zh_cn: 播放和弦

source: Play scale
es: Tocar una escala
fr: Jouer la gamme
hi: स्केल बजाएं
ja: 音階を再生する
mr: स्केल वाजवा
pt: Executar escala
te: స్కేల్ ప్లే చేయండి
tr: oyun ölçeği
ur: پیمانہ کھیلیں
zh_cn: 播放音阶

source: Click on a note to create a new step.
es: Haga clic en una nota para crear un nuevo paso.
fr: Cliquez sur une note pour créer une nouvelle étape.
hi: नए स्टेप बनाने के लिए नोट पर क्लिक करें.
ja: ピッチをクリックすると新しい段が作れますよ。
mr: नवीन पाऊल तयार करण्यासाठी नोटवर क्लिक करा.
pt: Clique em uma nota para criar um novo passo.
te: నోట్లపై క్లిక్ చేయడానికి కొత్త స్టెప్ సృష్టించండి.
tr: Yeni bir adım oluşturmak için bir nota tıklayın
ur: نیا مرحلہ بنانے کے لیے نوٹ پر کلک کریں۔
zh_cn: 点击音符以创建新步骤。

source: Save rhythms
es: Guardar ritmos
fr: Enregistrer les rythmes
hi: तालें सहेजें
ja: リズムだけをほぞん
mr: ताल जतन करा
pt: Salvar ritmos
te: రిదయాలను భద్రపరచండి
tr: ritimleri kaydet
ur: تالوں کو بچائیں۔
zh_cn: 保存节奏

source: Save drum machine
es: Guardar la caja de ritmos
fr: Enregistrer la boîte à rythmes
hi: ड्रम मशीन सहेजें
ja: ドラムとしてほぞん
mr: ड्रम मशीन जतन करा
pt: Salvar bateria eletrônica
te: డ్రమ్ యంత్రాన్ని భద్రపరచండి
tr: davul makinesini kaydet
ur: ڈرم مشین کو بچائیں۔
zh_cn: 保存鼓机

source: Tap a rhythm
es: Toca un ritmo
fr: Tapoter un rythme
hi: एक ताल पर टैप करें
ja: リズムをタップする
mr: ताल टॅप करा
pt: Pressiona um ritmo
te: రిదయాను గొట్టండి
tr: bir ritme dokunun
ur: ایک تال کو تھپتھپائیں۔
zh_cn: 敲击节奏

source: Click on the ruler to divide it.
es: Haga clic en la regla para dividirla.
fr: Cliquez sur la règle pour la diviser.
hi: इसे विभाजित करने के लिए रुलर पर क्लिक करें।
ja: クリックするとリズムをわけることができます。
mr: ते विभाजित करण्यासाठी शासकावर क्लिक करा.
pt: Clique na régua para dividir.
te: అదను విభజించడానికి రిడర్ని క్లిక్ చేయండి.
tr: bölmek için cetvele tıklayın
ur: اسے تقسیم کرنے کے لیے حکمران پر کلک کریں۔
zh_cn: 点击刻度尺进行分割。

source: tap a rhythm
es: tocar un ritmo
fr: tapoter un rythme
hi: एक ताल टैप करें
ja: リズムをタップする
mr: ताल टॅप करा
pt: pressionar um ritmo
te: రిదయాను గొట్టండి
tr: bir ritme dokunun
ur: ایک تال کو تھپتھپائیں
zh_cn: 敲击节奏

source: Maximum value of 256 has been exceeded.
es: Se ha superado el valor máximo de 256.
fr: La valeur maximale de 256 a été dépassée.
hi: 256 का अधिकतम मूल्य पार कर गया है।
ja: リズムメーカーの音の長さは、最大２５６です。
mr: 256 चे कमाल मूल्य ओलांडले आहे.
pt: O valr máximo 256 foi ultrapassado.
te: 256 యొక్క అత్యధిక విలువ మీరింది.
tr: maksimum 256 değeri aşıldı
ur: 256 کی زیادہ سے زیادہ قدر سے تجاوز کر گیا ہے۔
zh_cn: 已超过最大值256。

source: Recording started
es: grabación comenzada
fr: Enregistrement démarré
mr: रेकॉर्डिंग सुरू झाले
tr: kayıt başladı
ur: ریکارڈنگ شروع ہو گئی۔
zh_cn: 录音开始

source: Recording complete
es: grabación completa
fr: Enregistrement terminé
mr: रेकॉर्डिंग पूर्ण झाले
tr: kayıt tamamlandı
ur: ریکارڈنگ مکمل
zh_cn: 录音完成

source: A new sample block was generated.
es: Se generó un nuevo bloque de muestra de audio.
fr: Un nouveau bloc d'échantillons a été généré.
hi: एक नया सैंपल ब्लॉक उत्पन्न हुआ था।
ja: 新しい「音色サンプル」ブロックが作りました
mr: नवीन नमुना ब्लॉक तयार केला गेला.
te: కొత్త సాంపిల్ బ్లాక్ ఉత్పన్నం చేయబడింది.
tr: yeni bir örnek blok oluşturuldu
ur: ایک نیا نمونہ بلاک تیار کیا گیا تھا۔
zh_cn: 生成了新的采样块。

source: Upload sample
es: Subir muestra de audio
fr: Télécharger l'échantillon
hi: सैंपल अपलोड करें
ja: 音色サンプルをアップロード
mr: नमुना अपलोड करा
te: సాంపిల్ అప్‌లోడ్
tr: örnek yükle
ur: نمونہ اپ لوڈ کریں۔
zh_cn: 上传采样
