Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: Load a selected plugin.
tr: seçili bir eklentiyi yükler
ur: منتخب پلگ ان لوڈ کریں۔
zh_cn: 加载选定的插件

source: Delete a selected plugin.
es: Eliminar un plugin seleccionado.
fr: Supprimer un plugin sélectionné.
hi: चयनित प्लगइन को हटाएं।
ja: せんたくしたプラグインを消す。
mr: निवडलेला प्लगइन हटवा.
pt: Excluir o plugin selecionado.
te: ఎంపిక చేసిన ప్లగిన్‌ని తొలగించండి.
tr: seçili bir eklentiyi sil
ur: منتخب پلگ ان کو حذف کریں۔
zh_cn: 删除选定的插件

source: Enable scrolling
es: Activar scroll
fr: Activer le défilement
hi: स्क्रॉलिंग सक्षम करें
ja: 自由な方向に／たて方向にスクロール
mr: स्क्रोलिंग सक्षम करा.
pt: Ativar rolagem
te: మీరు క్యాన్వాస్‌లో బ్లాక్‌లను స్క్రోల్ చేసుకోవచ్చు.
tr: kaydırmayı etkinleştir
ur: سکرولنگ کو فعال کریں
zh_cn: 启用滚动

source: You can scroll the blocks on the canvas.
es: Puedes mover los bloques por el área de trabajo
fr: Vous pouvez faire défiler les blocs sur la toile.
hi: आप कैनवास पर ब्लॉक्स को स्क्रॉल कर सकते हैं।
ja: カンバス上をドラッグそうさしたときに、画面をスクロールさせることができる方向を上下だけと上下左右に変える。
mr: आपण कॅनव्हासवर ब्लॉक्स स्क्रोल करू शकता.
pt: Você pode rolar os blocos na tela.
te: మీరు క్యాన్వాస్‌లో బ్లాక్‌లను స్క్రోల్ చేసుకోవచ్చు.
tr: tuval üzerindeki blokları kaydırabilirsiniz
ur: آپ کینوس پر بلاکس کو سکرول کرسکتے ہیں۔
zh_cn: 您可以在画布上滚动这些块

source: Switch between dark and light mode.
tr: karanlık ve aydınlık mod arasında geçiş yapın
ur: سیاہ اور ہلکے موڈ کے درمیان سوئچ کریں۔
zh_cn: 在暗模式和亮模式之间切换

source: Click to add another project into the current one.
tr: Mevcut projeye başka bir proje eklemek için tıklayın
ur: موجودہ منصوبے میں کسی اور منصوبے کو شامل کرنے کے لئے کلک کریں۔
zh_cn: 点击将另一个项目添加到当前项目中

source: Wrap Turtle
es: Envolver tortuga
fr: Envelopper la tortue
hi: टर्टल को लपेटें
ja: アートを包む
mr: टर्टल लपेटा.
te: టర్టిల్ నుండి గుర్తించండి
tr: kaplumbağa sarma
ur: لپیٹ کچھی
zh_cn: 包裹海龟

source: Turn Turtle wrapping On or Off.
es: Encender / apagar la envoltura de tortugas
fr: Activer ou désactiver l'enveloppement de la tortue.
hi: टर्टल लपेटें को चालू या बंद करें।
ja: アートを包むか・包まない
mr: टर्टल लपेटणे चालू किंवा बंद करा.
te: టర్టిల్ గుర్తించిన స్థితిని ఎటువంటి చేయండి లేదా ఆఫ్ చేయండి.
tr: kaplumbağa sargısını açın veya kapatın
ur: کچھی کو ریپنگ آن یا آف کریں۔
zh_cn: 开启或关闭海龟包裹

source: Click to set the current pitch.
tr: Geçerli perdeyi ayarlamak için tıklayın
ur: موجودہ پچ کو ترتیب دینے کے لئے کلک کریں۔
zh_cn: 点击设置当前音高

source: Converts Music Block programs to JavaScript.
tr: müzik bloğu programlarını javascript'e dönüştürür
ur: میوزک بلاک پروگراموں کو جاوا اسکرپٹ میں تبدیل کرتا ہے۔
zh_cn: 将音乐块程序转换为JavaScript

source: Restore blocks from the trash.
es: Restaurar bloques de la papelera.
fr: Restaurer les blocs de la poubelle.
hi: कचरे से ब्लॉक्स को बहाल करें।
ja: ゴミ箱にすててしまったブロックを取り出してもどす。ふくすうのブロックをすててあるときは新しい順に、ゴミ箱が空になるまでブロックを拾いもどすことができる。
mr: कचरापेटीतून ब्लॉक्स पुनर्संचयित करा.
pt: Restaurar blocos da lixeira.
te: బ్లాక్‌లను ట్రాషును నుండి పునఃప్రారంభించండి.
tr: blokları çöp kutusundan geri yükle
ur: کوڑے دان سے بلاکس کو بحال کریں۔
zh_cn: 从垃圾桶恢复块

source: Switch mode
es: Cambiar el modo
fr: Changer de mode
hi: मोड स्विच करें
ja: はってんモード／かんたんモードにする
mr: मोड बदला.
pt: Modo de troca
te: మోడ్ మార్చండి
tr: anahtar modu
ur: سوئچ موڈ
zh_cn: 切换模式

source: Switch between beginner and advance modes.
es: Cambia entre los modos principiante y avanzado.
fr: Passer entre les modes débutant et avancé.
hi: शुरुआती और उन्नत मोड के बीच स्विच करें।
ja: ミュージック・ブロックスをかんたんモード／はってんモードに切りかえる。モードによって使えるきのうやブロックの種類が変わる。
mr: प्रारंभिक आणि प्रगत मोडमध्ये बदल करा.
pt: Trocar entre o modo iniciante e o modo avançado.
te: ప్రారంభ మరియు ఆధారాభావ మోడ్‌లలో స్విచ్ చేయండి.
tr: başlangıç ve ilerleme modları arasında geçiş yapın
ur: ابتدائی اور ایڈوانس طریقوں کے درمیان سوئچ کریں۔
zh_cn: 在初学者模式和高级模式之间切换

source: Select your language preference.
es: Seleccione su preferencia de idioma.
fr: Sélectionnez votre préférence linguistique.
hi: अपनी भाषा प्राथमिकता का चयन करें।
ja: ブロックの名前などに表示される言語をえらぶ。
mr: आपली भाषा प्राधान्य निवडा.
pt: Selecionar suas preferência de idioma.
te: మీ భాషా ఇచ్చేందుకు ఎంపిక చేయండి.
tr: dil tercihinizi seçin
ur: اپنی زبان کی ترجیح منتخب کریں۔
zh_cn: 选择您的语言偏好

source: Contextual Menu for Blocks
tr: bloklar için bağlamsal menü
ur: بلاکس کے لئے سیاق و سباق مینو
zh_cn: 块的上下文菜单

source: Right-click on a block to access common actions.
ur: مشترکہ اقدامات تک رسائی کے ل a بلاک پر دائیں کلک کریں۔
zh_cn: 右键点击一个块以访问常见操作

source: Delete
es: Borrar
fr: Supprimer
hi: हटाएं
ja: 消す
mr: हटवा
pt: Excluir
te: తొలగించు
tr: Sil
ur: حذف کریں
zh_cn: 删除

source: To delete a block, right-click on it. You will see the delete option.
mr: ब्लॉक हटवण्यासाठी फक्त त्यावर उजवे-क्लिक करा, मग तुम्हाला हटवण्याचा पर्याय दिसेल
ur: کسی بلاک کو حذف کرنے کے لئے ، اس پر دائیں کلک کریں۔ آپ کو حذف کرنے کا اختیار نظر آئے گا۔
zh_cn: 要删除一个模块，请右键点击它。你会看到“删除”选项。

source: To copy a block, right-click on it. You will see the copy option.
mr: ब्लॉक कॉपी करण्यासाठी फक्त त्यावर उजवे-क्लिक करा, मग तुम्हाला कॉपी पर्याय दिसेल
ur: کسی بلاک کی کاپی کرنے کے لئے ، اس پر دائیں کلک کریں۔ آپ کاپی آپشن دیکھیں گے۔
zh_cn: 要复制一个模块，请右键点击它。你会看到“复制”选项。

source: To extract a block, right-click on it. You will see the extract option.
mr: ब्लॉक काढण्यासाठी फक्त त्यावर उजवे-क्लिक करा, मग तुम्हाला काढण्याचा पर्याय दिसेल
ur: بلاک نکالنے کے لئے ، اس پر دائیں کلک کریں۔ آپ کو نچوڑ کا آپشن نظر آئے گا۔
zh_cn: 要提取一个模块，请右键点击它。你会看到“提取”选项。

source: Keyboard shortcuts
es: Atajos de teclado
fr: Raccourcis clavier
hi: कीबोर्ड शॉर्टकट्स
ja: キーボードのショートカット
mr: कीबोर्ड शॉर्टकट.
pt: Atalhos de teclado
te: కీబోర్డ్ శార్ట్‌కట్లు
tr: klavye kısayolları
ur: کی بورڈ شارٹ کٹ
zh_cn: 键盘快捷键

source: You can type d to create a do block and r to create a re block etc.
es: Puede escribir "d" para crear un bloque "do", "r" para crear un bloque "re", etc.
fr: Vous pouvez taper d pour créer un bloc do et r pour créer un bloc re, etc.
hi: आप डू ब्लॉक बनाने के लिए डी और रे ब्लॉक बनाने के लिए आर इत्यादि टाइप कर सकते हैं।
ja: キーボードを使うと、パレットボタンからブロックをドラッグして配置するだけでなく、ボタンをおすだけでちょくせつブロックを置くことができる。<br><br>★ショートカットキー<br><em> d</em> …… 「ド」（４分音符、４オクターヴ）<br><em> r</em> …… 「レ」（４分音符、４オクターヴ）<br><em> m</em> …… 「ミ」（４分音符、４オクターヴ）<br><em> f</em> …… 「ファ」（４分音符、４オクターヴ）<br><em> s</em> …… 「ソ」（４分音符、４オクターヴ）<br><em> l</em> …… 「ラ」（４分音符、４オクターヴ）<br><em> t</em> …… 「シ」（４分音符、４オクターヴ）<br>
mr: आपण 'd' टाइप करून 'do' ब्लॉक आणि 'r' टाइप करून 're' ब्लॉक तयार करू शकता.
pt: Você pode pressionar d para criar um bloco com a nota Do e r para criar uma nota Re, etc.
te: మీరు d నొక్కి do బ్లాక్ రాయవచ్చు, మరియు r నొక్కి re బ్లాక్ రాయవచ్చు మరియు ఇతరులను చేసుకోవచ్చు.
tr: bir do bloğu oluşturmak için d ve bir re bloğu oluşturmak için r yazabilirsiniz
ur: آپ دوبارہ بلاک وغیرہ بنانے کے لئے ڈو بلاک اور r بنانے کے لئے d ٹائپ کرسکتے ہیں۔
zh_cn: 你可以输入 d 来创建一个 do 模块，输入 r 来创建一个 re 模块，等等。

source: Contextual Menu for Canvas
tr: tuval için bağlamsal menü
ur: کینوس کے لئے سیاق و سباق مینو
zh_cn: 画布的上下文菜单

source: Right-click on the canvas to perform additional canvas-related tasks.
ur: کینوس سے متعلق اضافی کاموں کو انجام دینے کے لئے کینوس پر دائیں کلک کریں۔
zh_cn: 右键点击画布以执行更多与画布相关的操作。

source: Grid
es: Cuadrícula
fr: Grille
hi: ग्रिड
ja: グリッド
mr: जाल
te: గ్రిడ్
ur: گرڈ
zh_cn: 网格

source: Turn on/off lines for cartesian or polar grids.
tr: kartezyen veya kutupsal ızgaralar için çizgileri aç/kapat
ur: کارٹیشین یا قطبی گرڈ کے لئے آن / آف لائنز کو چالو کریں۔
zh_cn: 打开或关闭笛卡尔网格或极坐标网格的线条。

source: Turn on/off music staffs.
tr: müzik kadrolarını açmak/kapatmak
ur: میوزک اسٹاف کو آن / آف کریں۔
zh_cn: 打开或关闭五线谱。

source: Clear
es: Borrar
fr: Effacer
hi: हटाएं
ja: もとにもどす
mr: साफ करा
pt: Limpar
te: క్లియర్
tr: Temizle
ur: صاف
zh_cn: 清除

source: Clear the screen and return the mice to their initial positions.
es: Borre la pantalla y devuelva los ratones a sus posiciones iniciales.
fr: Effacez l'écran et ramenez les souris à leurs positions initiales.
hi: स्क्रीन को साफ करें और माउस को उनकी प्रारंभिक स्थितियों में ले आएं।
ja: ネズミを元の位置にもどし、ペンでえがいた線をすべて消す。
mr: स्क्रीन साफ करा आणि उंदरांना त्यांच्या प्रारंभिक स्थानावर परत करा.
pt: Limpar a tela e retornar o rato para a sua posição inicial.
te: స్క్రీన్‌ను తిరిగిపెట్టండి మరియు మొదటి స్థానాలకు మైస్‌ని తిరిగిపెట్టండి.
tr: ekranı temizleyin ve fareleri ilk konumlarına döndürün
ur: اسکرین کو صاف کریں اور چوہوں کو ان کی ابتدائی پوزیشنوں پر لوٹائیں۔
zh_cn: 清除屏幕并将鼠标返回到初始位置。

source: Collapse
es: Contraer
fr: Effondrer
hi: ढहाना
ja: カンバスをしゅくしょう
mr: गिर जाना
pt: Recolher
te: "అసంగతి
tr: Daraltma
ur: سمٹنا
zh_cn: 折叠

source: Collapse the graphics window.
es: Contraer la ventana de gráficos.
fr: Réduire la fenêtre graphique.
hi: ग्राफिक्स विंडो को संकुचित करें।
ja: ネズミがいどうしたり、ペンで線をえがいたりできる「カンバス」の表示サイズを しゅくしょうしたり、かくだいしたりする。カンバスをしゅくしょうした場合は、プログラムをふつうのそくどで実行しても、ブロックがかくれない。ふつうの実行そくどでプログラムの動作かくにんをしたいときなどに便利だ。
mr: ग्राफिक्स विंडो को गिराओ.
pt: Recolher a janela gráfica.
te: గ్రాఫిక్స్ విండోను పొరగండి.
tr: grafik penceresini daraltın
ur: گرافکس ونڈو کو ختم کریں۔
zh_cn: 折叠图形窗口。

source: Return all blocks to the center of the screen.
es: Devolver todos los bloques para el centro de la pantalla.
fr: Ramenez tous les blocs au centre de l'écran.
hi: सभी ब्लॉक्स को स्क्रीन के केंद्र में लौटाएं।
ja: すべてのブロックを、カンバスのまんなかに配置する。
mr: सर्व ब्लॉक्सना स्क्रीनच्या केंद्रावर परत आणा.
pt: Retornar todos os blocos para o centro da tela.
te: అన్ని బ్లాక్‌లను స్క్రీన్ మధ్యంలోకి తిరిగిపెట్టండి.
tr: tüm blokları ekranın ortasına döndürür
ur: تمام بلاکس کو اسکرین کے بیچ میں لوٹائیں۔
zh_cn: 将所有模块返回到屏幕中心。

source: Hide or show the blocks and the palettes.
es: Ocultar o mostrar los bloques y las paletas.
fr: Masquer ou afficher les blocs et les palettes.
hi: ब्लॉक्स और पैलेट्स को छुपाएं या दिखाएं
ja: クリックすると、パレットボタンとプログラムのブロックを画面上に表示させたり、かくしたりすることができる。
mr: ब्लॉक आणि पॅलेट दाखवा/लपवा
pt: Ocultar ou mostrar as paletas e os blocos.
te: బ్లాక్‌లను మరియు పాలెట్‌లను దాచాలి లేదా చూపాలి.
tr: blokları ve paletleri gizleyin veya gösterin
ur: بلاکس اور پیلیٹ چھپائیں یا دکھائیں۔
zh_cn: 隐藏或显示模块和调色板。

source: Expand or collapse start and action stacks.
es: Expandir o colapsar los bloques colapsables, cómo por ejemplo los bloques de empezar y los de acción.
fr: Développer ou réduire les piles de démarrage et d'action.
hi: स्टार्ट और एक्शन स्टैक्स को विस्तृत या संकुचित करें।
ja: クリックすると、「スタート」と「アクション」に使われているブロックを、広げて表示したり、折りたたんでかくしたりすることができる。
mr: प्रारंभ आणि क्रिया स्टॅक विस्तृत करा किंवा गिरावा.
pt: Expandir ou recolher pilhas de início e ação.
te: ప్రారంభం మరియు చర్యల స్టాక్‌లను విస్తరించండి లేదా మూసివేయండి.
tr: başlangıç ve eylem yığınlarını genişletin veya daraltın
ur: شروع اور ایکشن اسٹیک کو پھیلائیں یا سمیٹیں۔
zh_cn: 展开或折叠开始和动作堆栈。

source: Decrease the size of the blocks.
es: Disminuye el tamaño de los bloques
fr: Diminuer la taille des blocs.
hi: ब्लॉक्स का आकार घटाएं
ja: 画面に表示されるブロックのサイズを小さくする。
mr: ब्लॉकचा आकार घटवा
pt: Diminua o tamanho dos blocos.
te: బ్లాక్‌ల పరిమాణాన్ని తగ్గించండి.
tr: blokların boyutunu azaltın
ur: بلاکس کا سائز کم کریں۔
zh_cn: 减小模块的大小。

source: Increase the size of the blocks.
es: Incrementa el tamaño de los bloques.
fr: Augmenter la taille des blocs.
hi: ब्लॉक्स का आकार बढ़ाएं
ja: 画面に表示されるブロックのサイズを大きくする。
mr: ब्लॉकचा आकार वाढवा
pt: Aumentar o tamanho dos blocos.
te: బ్లాక్‌ల పరిమాణాన్ని పెంచుకోండి.
tr: blokların boyutunu artırın
ur: بلاکس کے سائز میں اضافہ کریں۔
zh_cn: 增大模块的大小。

source: Select
tr: Seç
ur: منتخب کریں
zh_cn: 选择

source: Left-click and drag on workspace to select multiple blocks.
ur: ایک سے زیادہ بلاکس کو منتخب کرنے کے لئے بائیں کلک کریں اور ورک اسپیس پر گھسیٹیں۔
zh_cn: 左键点击并拖动工作区以选择多个模块。

source: Palette buttons
es: Botones de paleta
fr: Les boutons de la palette
hi: पैलेट बटन
ja: パレットボタン
mr: पैलेट बटण
pt: Botões de paleta
te: పాలెట్ బటన్లు
tr: palet düğmeleri
ur: پیلیٹ کے بٹن
zh_cn: 调色板按钮

source: This toolbar contains the palette buttons including Rhythm Pitch Tone Action and more.
es: Esta barra de herramientas contiene los botones de la paleta de Ritmo, Tono, Tortuga, y más.
fr: Cette barre d'outils contient les boutons de la palette, y compris le rythme, la hauteur, le ton, l'action et plus.
hi: यह टूलबार रिद्धि पिच टोन क्रिया और अन्य सहित पैलेट बटन्स को शामिल करता है।
ja: ミュージック・ブロックスの左側には、プログラミングに使うさまざまなブロックをグループ分けした「パレットボタン」がある。
mr: या टूलबारमध्ये रिदम, पिच, टोन, अॅक्शन आणि अधिक समाविष्ट असलेल्या पॅलेट बटणांचा समावेश आहे.
pt: Essa barra de ferramentas contém a paleta de botões, incluindo Ação do Ritmo do Tom da Nota e mais.
te: ఈ టూల్‌బార్‌లో Rhythm, Pitch, Tone, Action, మరియు మరోవి కలిగిన పాలెట్ బటన్లు ఉన్నాయి.
tr: Bu araç çubuğu
ur: اس ٹول بار میں پیلیٹ بٹن شامل ہیں جن میں ریتھم پچ ٹون ایکشن اور بہت کچھ شامل ہے۔
zh_cn: 此工具栏包含调色板按钮，包括节奏、音高、音调、动作等。

source: Click to show the palettes of blocks and drag blocks from the palettes onto the canvas to use them.
es: Haga clic para mostrar las paletas de bloques y bloques de arrastre de las gamas de colores en el lienzo para usarlos.
fr: Cliquez pour afficher les palettes de blocs et faites glisser les blocs des palettes sur la toile pour les utiliser.
hi: ब्लॉक और पैलेट्स के पैलेट्स दिखाने के लिए क्लिक करें और इन्हें कैनवास पर खींचें ताकि आप उन्हें इस्तेमाल कर सकें।
ja: それぞれのパレットボタンをクリックし、「音符（おんぷ）」「アクション」「ペン」などから好きなブロックを選んで、カンバス上にドラッグして置いてみよう。
mr: ब्लॉक्सचे पॅलेट्स दाखवण्यासाठी क्लिक करा आणि ब्लॉक्सला वापरण्यासाठी पॅलेट्समधून कॅनव्हासवर ड्रॅग करा.
pt: Clique para mostrar a paleta de botões e arraste blocos da paleta para a tela para usá-los.
te: బ్లాక్‌ల పాలెట్లను చూపించడానికి మరియు పాలెట్ నుండి బ్లాక్‌లను క్యాన్వాస్‌కు వదలండించడానికి వాడండి.
tr: blok paletlerini göstermek için tıklayın ve kullanmak için blokları paletlerden tuvale sürükleyin
ur: بلاکس کے پیلیٹس کو دکھانے کے لیے کلک کریں اور ان کو استعمال کرنے کے لیے پیلیٹ سے بلاکس کو کینوس پر گھسیٹیں۔
zh_cn: 点击显示模块调色板，将模块从调色板拖到画布上使用。

source: A detailed guide to Turtle Blocks is available.
es: Se encuentra disponible una guía detallada de TortuBloques.
fr: Un guide détaillé de Turtle Blocks est disponible.
hi: टर्टल ब्लॉक्स के लिए एक विस्तृत मार्गदर्शिका उपलब्ध है।
ja: インターネットから、ミュージック・ブロックスのさらにくわしいガイドページを見ることができる。次のリンク先を開いてみよう。
mr: टर्टल ब्लॉक्ससाठी सविस्तर मार्गदर्शक उपलब्ध आहे.
te: టర్టిల్ బ్లాక్‌లకు సంబంధించిన వివరాల గుర్తింపు అంగీకరించబడింది.
tr: kaplumbağa blokları için ayrıntılı bir kılavuz mevcuttur
ur: کچھی بلاکس کے لئے ایک تفصیلی رہنما دستیاب ہے۔
zh_cn: 提供了 Turtle Blocks 的详细指南。

source: Turtle Blocks Guide
es: Guía de TortuBloques
fr: Guide de Turtle Blocks
hi: टर्टल ब्लॉक्स मार्गदर्शिका
ja: ミュージック・ブロックスガイド
mr: टर्टल ब्लॉक्स मार्गदर्शक.
te: టర్టిల్ బ్లాక్‌ల మార్గదర్శిక
tr: kaplumbağa blokları kılavuzu
ur: کچھی بلاکس گائیڈ
zh_cn: Turtle Blocks 指南

source: About
es: Acerca
fr: À propos
hi: बारे में
ja: ミュージック・ブロックスについて
mr: विषयी.
pt: Sobre
te: గురించి
tr: Hakkında
ur: کے بارے میں
zh_cn: 关于

source: Turtle Blocks is an open source collection of tools for exploring musical concepts.
es: TortuBloques es una colección de herramientas de Software Libre para explorar conceptos musicales.
fr: Turtle Blocks est une collection open source d'outils pour explorer les concepts musicaux.
hi: टर्टल ब्लॉक्स एक संगीत सिद्धांतों की खोज के लिए एक ओपन सोर्स संग्रह है।
ja: ミュージック・ブロックスは、音楽のコンセプトをたんきゅうするためにつくられた、オープンソースのツールだ。
mr: टर्टल ब्लॉक्स हे संगीत संकल्पनांचा शोध घेण्यासाठी एक मुक्त स्त्रोत साधनसंच आहे.
te: టర్టిల్ బ్లాక్‌లు సంగీత సంవేదనాలను అన్వేషించడానికి ఉపకరణాల ఒక సమూహం.
tr: turtle blocks
ur: کچھی بلاکس میوزیکل تصورات کی کھوج کے ل tools ٹولز کا ایک کھلا ذریعہ مجموعہ ہے۔
zh_cn: Turtle Blocks 是一个开源工具集，用于探索音乐概念。

source: A full list of contributors can be found in the Turtle Blocks GitHub repository.
es: Se puede encontrar una lista completa de colaboradores en el repositorio GitHub de TortuBloques.
fr: Une liste complète des contributeurs se trouve dans le référentiel GitHub de Turtle Blocks.
hi: टर्टल ब्लॉक्स GitHub रिपॉजिटरी में सभी योगदानकर्ताओं की पूरी सूची मिल सकती है।
ja: ミュージック・ブロックスにかかわってきた人のいちらんは、GitHub（ギットハブ）のリポジトリで見ることができる。
mr: योगदानकर्त्यांची संपूर्ण सूची टर्टल ब्लॉक्स GitHub रिपॉझिटरीमध्ये मिळू शकते.
te: కొన్నిసార్లు టర్టిల్ బ్లాక్‌లకు సంబంధించిన పూర్ణ యొక్క యొక్కటి టర్టిల్ బ్లాక్‌లు GitHub సంగ్రహణలో కనబడబడింది.
tr: Katkıda bulunanların tam listesi turtle blocks github deposunda bulunabilir
ur: شراکت داروں کی ایک مکمل فہرست کچھی بلاکس گٹ ہب کے ذخیرے میں مل سکتی ہے۔
zh_cn: 完整的贡献者列表可以在 Turtle Blocks 的 GitHub 仓库中找到。

source: Turtle Blocks is licensed under the AGPL.
es: TortuBloques está licenciado bajo el AGPL.
fr: Turtle Blocks est sous licence AGPL.
hi: टर्टल ब्लॉक्स AGPL लाइसेंस के तहत लाइसेंस प्राप्त करता है।
ja: ミュージック・ブロックスのプログラムは、だれでも自由にみることができる。
mr: टर्टल ब्लॉक्स AGPL अंतर्गत परवानाधारक आहे.
te: టర్టిల్ బ్లాక్‌లు AGPL అడిగేయి.
tr: turtle blocks agpl kapsaminda li̇sanslanmiştir
ur: کچھی بلاکس AGPL کے تحت لائسنس یافتہ ہیں۔
zh_cn: Turtle Blocks 授权使用 AGPL 许可协议。

source: Turtle Blocks GitHub repository
es: El repositorio de GitHub de TortuBloques
fr: Référentiel GitHub de Turtle Blocks
hi: टर्टल ब्लॉक्स GitHub रिपॉजिटरी
ja: タータル・ブロックスのリポジトリ
mr: टर्टल ब्लॉक्स GitHub रिपॉझिटरी.
te: టర్టిల్ బ్లాక్‌ల జిట్‌హబ్ రిపోజిటరీ
tr: kaplumbağa blokları github deposu
ur: کچھی بلاکس گٹ ہب مخزن
zh_cn: Turtle Blocks GitHub 仓库

source: Congratulations.
es: Felicitaciones.
fr: Félicitations.
hi: बधाई हो।
ja: おめでとうございます！
mr: अभिनंदन.
pt: Parabéns.
te: అభినందనలు.
tr: Tebrikler
ur: مبارک ہو۔
zh_cn: 恭喜

source: You have finished the tour. Please enjoy Turtle Blocks!
es: Ha terminado la gira. Por favor, disfrutar de TortuBloques
fr: Vous avez terminé la visite. Veuillez profiter de Turtle Blocks !
hi: आपने दौरा समाप्त किया है। कृपया टर्टल ब्लॉक्स का आनंद लें!
ja: ツアーはここで終わり。タータル・ブロックスを自由に楽しもう。
mr: आपण दौरा पूर्ण केला आहे. कृपया टर्टल ब्लॉक्सचा आनंद घ्या!
te: మీ పర్యాటనను పూర్తి చేసారు. దయచేసి టర్టిల్ బ్లాక్‌లను ఆనందించండి!
tr: turu bi̇ti̇rdi̇ni̇z
ur: آپ نے ٹور ختم کردیا ہے۔ براہ کرم کچھی بلاکس سے لطف اٹھائیں!
zh_cn: 您已完成导览。请尽情享受 Turtle Blocks！

source: Music Blocks is an open source collection of tools for exploring musical concepts.
es: Bloques de Música es una colección de herramientas de Software Libre para explorar conceptos musicales.
fr: Music Blocks est une collection open source d'outils pour explorer les concepts musicaux.
hi: म्यूजिक ब्लॉक्स एक संगीत सिद्धांतों की खोज के लिए एक ओपन सोर्स संग्रह है।
ja: ミュージック・ブロックスは、音楽のコンセプトをたんきゅうするためにつくられた、オープンソースのツールだ。
mr: संगीत ब्लॉक्स हे संगीत संकल्पनांचा शोध घेण्यासाठी एक मुक्त स्त्रोत साधनसंच आहे.
pt: Music Blocks é uma coleção de ferramentas de código aberto para explorar conceitos musicais.
te: మ్యూజిక్ బ్లాక్‌లు సంగీత అవగాహన సాధించడానికి ఒక స్వతంత్ర సోఫ్ట్‌వేర్ సంగ్రహం.
tr: music blocks
ur: میوزک بلاکس میوزیکل تصورات کی کھوج کے ل tools ٹولز کا ایک کھلا ذریعہ مجموعہ ہے۔
zh_cn: Music Blocks 是一个开源工具集，用于探索音乐概念。

source: A full list of contributors can be found in the Music Blocks GitHub repository.
es: Se puede encontrar una lista completa de colaboradores en el repositorio GitHub de Bloques de Música.
fr: Music Blocks est sous licence AGPL.
hi: म्यूजिक ब्लॉक्स GitHub रिपॉजिटरी में सभी योगदानकर्ताओं की पूरी सूची मिल सकती है।
ja: ミュージック・ブロックスにかかわってきた人のいちらんは、GitHub（ギットハブ）のリポジトリで見ることができる。
mr: योगदानकर्त्यांची संपूर्ण सूची संगीत ब्लॉक्स GitHub रिपॉझिटरीमध्ये मिळू शकते.
pt: A lista completa de colaboradores pode ser encontrada no repositório Github do Music Blocks.
te: మ్యూజిక్ బ్లాక్‌ల జిట్‌హబ్ రిపోజిటరీలో పూర్తి యొక్క యాచకుల జాబితా కనిపిస్తుంది.
tr: katkida bulunanlarin tam li̇stesi̇ne music blocks github deposundan ulaşilabi̇li̇r
ur: شراکت کاروں کی ایک مکمل فہرست میوزک بلاکس گٹ ہب کے ذخیرے میں مل سکتی ہے۔
zh_cn: 完整的贡献者列表可以在 Music Blocks 的 GitHub 仓库中找到。

source: Music Blocks is licensed under the AGPL.
es: Bloques de Música está licenciado bajo el AGPL.
hi: म्यूजिक ब्लॉक्स AGPL लाइसेंस के तहत लाइसेंस प्राप्त करता है।
ja: ミュージック・ブロックスのプログラムは、だれでも自由にみることができる。
mr: संगीत ब्लॉक्स AGPL अंतर्गत परवानाधारक आहे.
pt: Music Blocks é licenciado sob a GNU/AGPL.
te: మ్యూజిక్ బ్లాక్‌లు AGPL అడిగేయి.
tr: music blocks agpl kapsaminda li̇sanslanmiştir
ur: میوزک بلاکس کو AGPL کے تحت لائسنس دیا گیا ہے۔
zh_cn: Music Blocks 授权使用 AGPL 许可协议。

source: Music Blocks GitHub repository
es: El repositorio de GitHub de Bloques de Música
fr: Dépôt GitHub de Music Blocks
hi: म्यूजिक ब्लॉक्स GitHub रेपॉजिटरी
ja: ミュージック・ブロックスのリポジトリ
mr: संगीत ब्लॉक्स GitHub रिपॉझिटरी.
pt: Repositório Github do Music Blocks
te: మ్యూజిక్ బ్లాక్‌ల జిట్‌హబ్ రిపోజిటరీ
tr: müzik blokları github deposu
ur: میوزک بلاکس گٹ ہب مخزن
zh_cn: Music Blocks GitHub 仓库

source: Congratulations!
tr: Tebrikler!
ur: مبارک ہو!
zh_cn: 恭喜

source: You have finished the tour. Please enjoy Music Blocks!
es: Ha terminado la gira. Por favor, disfrutar de Bloques de Música!
fr: Vous avez terminé la visite. Profitez de Music Blocks!
hi: आपने यात्रा पूरी कर ली है। कृपया Music Blocks का आनंद लें!
ja: ミスター・マウスのツアーはここで終わり。ミュージック・ブロックスを自由に楽しもう。
mr: आपण दौरा पूर्ण केला आहे. कृपया संगीत ब्लॉक्सचा आनंद घ्या!
pt: Você terminou o tour. Por favor, aproveite o Music Blocks!
te: మీ పర్యాటనను పూర్తి చేసారు. దయచేసి మ్యూజిక్ బ్లాక్‌లను ఆనందించండి!
tr: turu bi̇ti̇rdi̇ni̇z
ur: آپ نے ٹور ختم کردیا ہے۔ براہ کرم میوزک بلاکس سے لطف اٹھائیں!
zh_cn: 您已完成导览。请尽情享受 Music Blocks！

source: Expand
es: Expandir
fr: Développer
hi: विस्तार
ja: カンバスをかくだい
mr: विस्तारित करा.
pt: Expandir
te: విస్తరించు
tr: Genişletme
ur: توسیع کریں
zh_cn: 展开

source: effect
es: efecto
fr: effet
hi: प्रभाव
ja: こうかおん
mr: प्रभाव
pt: efeito
te: ప్రభావం
tr: efekt
ur: اثر
zh_cn: 效果

source: sargam
hi: सरगम
ja: Sargam (インドの ソルファ)
mr: सरगम
te: సర్గమ్
ur: سارگم
zh_cn: 萨尔甘

source: custom pitch
es: personalizado tono
fr: hauteur personnalisée
hi: कस्टम पिच
ja: カスタムピッチ
mr: कस्टम पिच
pt: tom personalizado
te: అనుకూల శ్రుతి
tr: özel perde
ur: کسٹم پچ
zh_cn: 自定义音高

source: accidental
fr: altération
hi: अक्सीडेंटल
ja: 変化記号
pt: acidental
te: అక్కిడెంటల్
tr: arızi
ur: حادثاتی
zh_cn: 意外音符

source: pitch converter
es: convertidor de tono
fr: convertisseur de hauteur
hi: पिच कनवर्टर
ja: 音の高さを調節
mr: पिच कनवर्टर
te: శ్రుతి రూపకారి
tr: perde dönüştürücü
ur: پچ کنورٹر
zh_cn: 音高转换器

source: rest
es: descanso
fr: pause
hi: आराम
ja: 休符
mr: विश्रांती
pt: resto
te: విశ్రాంతి
tr: dinlenme
ur: آرام کرو
zh_cn: 休止符

source: Perfect unison
es: Unísono perfecto
fr: Unisson parfait
ja: 完全1度
mr: संपूर्ण एकसंध
tr: mükemmel uyum
ur: کامل اتحاد
zh_cn: 完全同音

source: Diminished second
es: Segundo disminuido
fr: Seconde diminuée
ja: 減2度
mr: कमी दुसरा
tr: eksiltilmiş saniye
ur: دوسرا پتلا
zh_cn: 减二度

source: Minor second
es: Segundo menor
fr: Seconde mineure
ja: 短2度
mr: लहान दुसरा
tr: minör saniye
ur: معمولی دوسرا
zh_cn: 小二度

source: Augmented unison
es: Unísono aumentado
fr: Unisson augmenté
ja: 増1度
mr: वाढलेला एकसंध
tr: artırılmış uyum
ur: اگنمنٹڈ یونیسن
zh_cn: 增同音

source: Major second
es: Segundo mayor
fr: Seconde majeure
ja: 長2度
mr: मोठा दुसरा
tr: majör saniye
ur: میجر دوسرا
zh_cn: 大二度

source: Diminished third
es: Tercio disminuido
fr: Tierce diminuée
ja: 減3度
mr: कमी तिसरा
tr: eksiltilmiş üçüncü
ur: تیسرا پتلا
zh_cn: 减三度

source: Minor third
es: Tercio menor
fr: Tierce mineure
ja: 短3度
mr: लहान तिसरा
tr: minör üçüncü
ur: معمولی تیسرا
zh_cn: 小三度

source: Augmented second
es: Segundo aumentado
fr: Seconde augmentée
ja: 増2度
mr: वाढलेला दुसरा
tr: artırılmış saniye
ur: اگمنٹڈ سیکنڈ
zh_cn: 增二度

source: Major third
es: Tercio mayor
fr: Tierce majeure
ja: 長3度
mr: मोठा तिसरा
tr: majör üçüncü
ur: میجر تیسرا
zh_cn: 大三度

source: Diminished fourth
es: Cuarta disminuida
fr: Quarte diminuée
ja: 減4度
mr: कमी चौथा
tr: eksiltilmiş dördüncü
ur: چوتھا پتلا
zh_cn: 减四度

source: Perfect fourth
es: Cuarta perfecta
fr: Quarte parfaite
ja: 完全4度
mr: संपूर्ण चौथा
tr: mükemmel dördüncü
ur: کامل چوتھا
zh_cn: 完全四度

source: Augmented third
es: Tercio aumentado
fr: Tierce augmentée
ja: 増3度
mr: वाढलेला तिसरा
tr: artırılmış üçüncü
ur: اگمنٹ تیسرا
zh_cn: 增三度

source: Diminished fifth
es: Quinta disminuida
fr: Quinte diminuée
ja: 減5度
mr: कमी पाचवा
tr: eksiltilmiş beşli
ur: پانچویں نمبر پر
zh_cn: 减五度

source: Augmented fourth
es: Cuarta aumentada
fr: Quarte augmentée
ja: 増4度
mr: वाढलेला चौथा
tr: artırılmış dördüncü
ur: اگمنٹ چوتھا
zh_cn: 增四度
