Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: About Turtle Blocks
es: Sobre Bloques de Tortuga
fr: À propos de Turtle Blocks
hi: टर्टल ब्लॉक्स के बारे में
ja: タートル・ブロックスについて
mr: टर्टल ब्लॉक्स बद्दल
pt: Sobre o Turtle Blocks
te: టర్టిల్ బ్లాక్స్ గురించి
tr: kaplumbağa blokları hakkında
ur: کچھی بلاکس کے بارے میں
zh_cn: 关于海龟图形块

source: Turtle Wrap Off
es: No Envolver
fr: Enveloppe de tortue désactivée
hi: टर्टल रैप बंद
ja: 画面の境界を無視しない
mr: टर्टल रॅप बंद
te: టర్టిల్ వ్రాప్ ఆఫ్
tr: kaplumbağa sargısı kapalı
ur: کچھی لپیٹ آف
zh_cn: 关闭海龟包装

source: Turtle Wrap On
es: Envolver
fr: Enveloppe de tortue activée
hi: टर्टल रैप चालू
ja: 画面の境界を無視する
mr: टर्टल रॅप चालू
te: టర్టిల్ వ్రాప్ ఆన్
tr: kaplumbağa sargısı
ur: کچھی لپیٹ پر
zh_cn: 开启海龟包装

source: Are you sure you want to create a new project?
es: ¿Estás seguro de que deseas crear un nuevo proyecto?
fr: Êtes-vous sûr de vouloir créer un nouveau projet ?
mr: तुम्हाला खात्री आहे की तुम्ही एक नवीन प्रकल्प तयार करू इच्छिता?
tr: yeni̇ bi̇r proje oluşturmak i̇stedi̇ği̇ni̇zden emi̇n mi̇si̇ni̇z?
ur: کیا آپ واقعی ایک نیا پروجیکٹ بنانا چاہتے ہیں؟
zh_cn: 您确定要创建一个新项目吗？

source: Not a valid pitch name
es: No es un nombre de tono válido.
fr: Ce n'est pas un nom de pitch valide
hi: एक वैध पिच नाम नहीं
ja: 選ばれた音名が適切ではありません。
mr: वैध पिच नाव नाही
pt: Não é um nome de nota válido
te: చెల్లని పిచ్ పేరు కాదు
tr: geçerli bir perde adı değil
ur: ایک درست پچ نام نہیں
zh_cn: 无效的音高名称

source: You must select a file.
es: Debe seleccionar un archivo.
fr: Vous devez sélectionner un fichier.
hi: आपको एक फ़ाइल का चयन करना होगा।
ja: ファイルをえらんでください。
mr: तुम्ही एक फाईल निवडली पाहिजे.
pt: Você deve selecionar um arquivo.
te: మీరు ఫైల్ ఎంచుకోవాలి
tr: bir dosya seçmelisiniz
ur: آپ کو فائل منتخب کرنا ہوگی۔
zh_cn: 你必须选择一个文件

source: Playback is ready.
es: La reproducción está preparada.
fr: La lecture est prête.
hi: प्लेबैक तैयार है।
ja: コンパイル完了
mr: प्लेबॅक तयार आहे.
pt: Tocador está pronto
te: ప్లేబ్యాక్ సిద్ధం
tr: oynatma hazır
ur: پلے بیک تیار ہے۔
zh_cn: 播放准备好了。

source: double sharp
es: doble agudas
fr: double dièse
hi: डबल शार्प
ja: ダブルシャープ
mr: दोगुना तेज़
pt: afinação dupla
te: రెండు శార్పు
tr: çift keskin
ur: ڈبل تیز
zh_cn: 双升音符

source: sharp
es: agudas
fr: dièse
hi: शार्प
ja: シャープ
mr: तीव्र
pt: afinado
te: శార్ప్
tr: diyez
ur: تیز
zh_cn: 升号

source: natural
es: normal
fr: naturel
hi: नैचुरल
ja: ナチュラル
mr: स्वाभाविक
te: స్వాభావిక
tr: doğal
ur: قدرتی
zh_cn: 还原音符

source: flat
es: planas
fr: bémol
hi: फ्लैट
ja: フラット
mr: कोमल
pt: plano
te: అలవు తగించు
tr: bemol
ur: فلیٹ
zh_cn: 降号

source: double flat
es: doble planas
fr: double bémol
hi: डबल फ्लैट
ja: ダブルフラット
mr: दुहेरी कोमल
pt: plano duplo
te: రెండు అలవు తగించు
tr: çİFT DAİRE
ur: ڈبل فلیٹ
zh_cn: 双降音符

source: unison
es: unísono
fr: unisson
hi: एकस्वरता
ja: ユニゾン（同度）
mr: समान
pt: unisom
te: ఏకాంతము
ur: اتحاد
zh_cn: 同音

source: major
es: mayor
fr: majeur
hi: मेजर
ja: メジャー
mr: मुख्य
pt: maior
te: ప్రధాన
tr: majör
ur: بڑا
zh_cn: 大调音阶

source: ionian
fr: ionien
hi: आयनियन
ja: アイオニアン音階
mr: आयोनियन
pt: ioniano
te: ఐయోనియన్
tr: iyonyen
ur: آئن
zh_cn: 艾奥尼安调式

source: minor
es: menor
fr: mineur
hi: माइनर
ja: マイナー（短）
mr: गौण
pt: menor
te: క్షుద్ర
tr: minör
ur: معمولی
zh_cn: 小调音阶

source: aeolian
fr: éolien
hi: एोलियन
ja: エオリアン音階
mr: आयोलियन
pt: aeoliano
te: ఏఓలియన్
ur: ایولین
zh_cn: 伊奥利安调式

source: Duplicate
es: Duplicar
fr: Dupliquer
hi: डुप्लीकेट
ja: 複製する
mr: डुप्लिकेट
te: నకిలీ
tr: Kopya
ur: ڈپلیکیٹ
zh_cn: 复制

source: Extract
es: Extraer
fr: Extraire
hi: निकालें
ja: 取り出す
mr: काढा
pt: Extrair
te: ఎక్స్ట్రాక్ట్
ur: نچوڑ
zh_cn: 提取

source: Move to trash
es: Mover para recargar
fr: Déplacer dans la corbeille
hi: कूड़े में डालें
ja: すてる
mr: कचरापेटीत हलवा
pt: Mover para a lixeira
te: కసినికి జరిపేయండి
tr: çöpe taşı
ur: کوڑے دان میں منتقل کریں
zh_cn: 移到垃圾桶

source: Close
es: Cerrar
fr: Fermer
hi: बंद करें
ja: 閉じる
mr: बंद करा
pt: Fechar
te: మూసివేయి
tr: Kapat
ur: بند کریں
zh_cn: 关闭

source: Save stack
es: Guardar pila
fr: Enregistrer la pile
hi: स्टैक को सेव करें
ja: スタックをほぞん
mr: ढिग जतन करा
pt: Salvar pilha
te: సేవ్ స్ట్యాక్
tr: yığını kaydet
ur: اسٹیک محفوظ کریں
zh_cn: 保存堆栈

source: In order to copy a sample, you must reload the widget, import the sample again, and export it.
es: Se detectó un bucle indefinido dentro de un bloque de valor de nota. Pueden ocurrir cosas inesperadas.
fr: Pour copier un échantillon, vous devez recharger le widget, importer à nouveau l'échantillon et l'exporter.
ja: サンプルをコピーするため、ツールを再度試して、またサンプルをロード読み込で、保存することが必要です。
mr: नमुना कॉपी करण्यासाठी, तुम्हाला विजेट पुन्हा लोड करावे लागेल, नमुना पुन्हा आयात करावा लागेल आणि निर्यात करावा लागेल.
tr: ı yeniden yüklemeniz, örneği tekrar içe aktarmanız ve dışa aktarmanız gerekir. (Bağlam: bir örneği kopyalamak için widget
ur: نمونے کی کاپی کرنے کے ل you ، آپ کو ویجیٹ کو دوبارہ لوڈ کرنا ہوگا ، نمونہ دوبارہ درآمد کرنا ہوگا ، اور اسے برآمد کرنا ہوگا۔
zh_cn: 为了复制样本，您必须重新加载小部件，重新导入样本，然后再导出。

source: You have chosen key for your pitch preview.
es: Ha elegido la tecla para la vista previa de su tono.
fr: Vous avez choisi la clé pour votre aperçu de hauteur.
mr: तुम्ही तुमच्या पिच पूर्वावलोकनासाठी की निवडली आहे.
tr: satış konuşması önizlemeniz için anahtar seçtiniz
ur: آپ نے اپنے پچ پیش نظارہ کے لئے کلید کا انتخاب کیا ہے۔
zh_cn: 您已选择音调预览的音调。

source: You must have at least one Partial block inside of a Weighted-partial block
es: Debe tener al menos un bloque parcial dentro de un bloque parcial ponderado.
fr: Vous devez avoir au moins un bloc partiel à l'intérieur d'un bloc partiel pondéré
hi: आपके पास एक से अधिक पांचिक ब्लॉक के अंदर कम से कम एक आंशिक ब्लॉक होना चाहिए
ja: 「倍音ウェート」ブロックの中に一つ以上の倍音ブロックが入っている必要があります。
mr: तुमच्याकडे वेटेड-पार्शियल ब्लॉकच्या आत किमान एक पार्शियल ब्लॉक असणे आवश्यक आहे
pt: Você deve ter pelo menos um bloco Parcial dentro de um bloco parcial Ponderado
te: మీరు కంటే కడిగినంత భారము-కంటే-భాగాలు బ్లాక్ లో కనుగొంటేందో ఉండాలి
ur: وزن والے جزوی بلاک کے اندر آپ کے پاس کم از کم ایک جزوی بلاک ہونا ضروری ہے
zh_cn: 您必须在加权部分块内至少包含一个部分块

source: synth cannot play chords.
es: Synth no puede tocar acordes.
fr: le synthé ne peut pas jouer d'accords.
hi: सिंथ कोड नहीं बजा सकता है।
ja: このシンセでは和音ができません
mr: सिंथ कॉर्ड्स वाजवू शकत नाही.
pt: sintetizador não pode tocar acordes.
te: సింథ్ కార్డులను ప్లే చేయలేకపోవచ్చు.
tr: synth akor çalamaz
ur: سنتھ راگ نہیں کھیل سکتا۔
zh_cn: 合成器无法播放和弦

source: guide url
es: https://github.com/sugarlabs/musicblocks/tree/master/guide-es/README.md
fr: URL du guide
hi: गाइड url
ja: https://github.com/sugarlabs/musicblocks/tree/master/guide-ja/music_blocks_operation_manual.pdf
mr: मार्गदर्शक URL
pt: guia url
te: మార్గదర్శి URL
tr: kılavuz url
ur: گائیڈ یو آر ایل
zh_cn: 指南网址

source: Turtle Blocks
es: Bloques de Tortuga
hi: टर्टल ब्लॉक्स
ja: タートル・ブロックス
mr: टर्टल ब्लॉक्स
tr: kaplumbağa blokları
ur: کچھی بلاکس
zh_cn: 海龟图形块

source: search
es: buscar
fr: recherche
hi: खोज
ja: 検索
mr: शोधा
pt: buscar
te: వెతకడానికి
tr: arama
ur: تلاش کریں
zh_cn: 搜索

source: meter
es: metro
fr: métrique
hi: मीटर
ja: 拍子
mr: मीटर
pt: metro
te: మీటర్
tr: ölçü
ur: میٹر
zh_cn: 节拍

source: intervals
es: intervalos
fr: intervalles
hi: अंतराल
ja: 音程
mr: मध्यांतर
pt: intervalos
te: అంతరాలాలు
tr: aralıklar
ur: وقفے وقفے
zh_cn: 音程

source: ornament
es: ornamento
fr: ornement
hi: आभूषण
ja: そうしょく
mr: सजावट
pt: ornamento
te: ఆలంకారము
tr: süsleme
ur: زیور
zh_cn: 装饰音

source: volume
es: volumen
hi: आवृत्ति
ja: 音量
mr: व्हॉल्यूम
te: శబ్దపరిమాణం
tr: ses seviyesi
ur: حجم
zh_cn: 音量

source: boxes
es: cajas
fr: boîtes
hi: बॉक्स
ja: 数の箱
mr: बॉक्सेस
pt: caixas
te: పెట్లు
tr: kutular
ur: بکس
zh_cn: 框框

source: widgets
es: aparatos
hi: विजेट्स
ja: ツール
mr: विजेट्स
te: విడ్జెట్లు
tr: widget
ur: ویجٹ
zh_cn: 小部件

source: graphics
es: gráficos
fr: graphismes
hi: ग्राफिक्स
ja: ネズミの動き
mr: ग्राफिक्स
pt: gráficos
te: గ్రాఫిక్స్
tr: grafik
ur: گرافکس
zh_cn: 图像

source: boolean
es: booleano
fr: booléen
hi: बूलियन
ja: くらべる
mr: बुलियन
pt: boleano
te: బూలియన్
ur: بولین
zh_cn: 布尔值

source: heap
es: pila
fr: tas
hi: हीप
ja: ヒープ
mr: ढीग
pt: pilha
te: హీప్
tr: yığın
ur: ڈھیر
zh_cn: 堆积

source: dictionary
es: diccionario
fr: dictionnaire
hi: शब्दकोश
ja: 辞書
mr: शब्दकोश
te: నిఘంటువు
tr: sözlük
ur: لغت
zh_cn: 字典

source: ensemble
es: conjunto
hi: एंसेंबल
ja: 合奏
mr: संगीतमंडळी
pt: conjunto
te: ఎన్సంబిల్
tr: topluluk
ur: جوڑا
zh_cn: 乐团

source: extras
hi: अतिरिक्त
ja: その他
mr: अतिरिक्त
te: అదనపు
tr: ekstralar
ur: ایکسٹرا
zh_cn: 额外内容

source: program
es: programa
fr: programme
hi: प्रोग्राम
ja: プログラム
mr: कार्यक्रम
te: ప్రోగ్రామ్
ur: پروگرام
zh_cn: 程序

source: my blocks
es: mis bloques
fr: mes blocs
hi: मेरे ब्लॉक्स
ja: 自分のブロック
mr: माझे ब्लॉक्स
pt: meus blocos
te: నా బ్లాక్స్
tr: bloklarım
ur: میرے بلاکس
zh_cn: 我的块

source: artwork
es: arte
fr: œuvre
hi: कला का कार्य
ja: アート
mr: कलाकृती
pt: ilustrção
te: కళాకృతి
tr: sanat eseri
ur: آرٹ ورک
zh_cn: 艺术作品

source: logic
es: lógica
fr: logique
hi: तर्क
ja: 論理
mr: तर्कशास्त्र
pt: lógica
te: తర్కము
tr: mantık
ur: منطق
zh_cn: 逻辑

source: Music
es: música
fr: Musique
hi: संगीत
ja: 音楽
mr: संगीत
pt: Música
te: సంగీతం
tr: Müzik
ur: موسیقی
zh_cn: 音乐

source: Music Blocks
es: Bloques de Música
hi: संगीत ब्लॉक्स
ja: ミュージック・ブロックス
mr: संगीत ब्लॉक्स
tr: müzik blokları
ur: میوزک بلاکس
zh_cn: 音乐块

source: Welcome to Turtle Blocks
es: Bienvenidos a TortuBloques
fr: Bienvenue à Turtle Blocks
hi: टर्टल ब्लॉक्स में आपका स्वागत है
ja: タートル・ブロックへようこそ
mr: टर्टल ब्लॉक्स मध्ये आपले स्वागत आहे
te: టర్టిల్ బ్లాక్స్‌కి స్వాగతం
tr: kaplumbağa bloklarına hoş geldiniz
ur: کچھی بلاکس میں خوش آمدید
zh_cn: 欢迎来到海龟图形块

source: Turtle Blocks is a Logo-inspired turtle that draws colorful pictures with snap-together visual-programming blocks.
es: Turtle Blocks es una tortuga basada en Logo que dibuja imÃÂ¡genes coloridas programable de una forma visual con bloques encastrables.
fr: Turtle Blocks est une tortue inspirée de Logo qui dessine des images colorées avec des blocs de programmation visuelle à assembler.
hi: टर्टल ब्लॉक्स एक लोगो-प्रेरित कछुआ है जो स्नैप-टूगेदर विजुअल-प्रोग्रामिंग ब्लॉक के साथ रंगीन तस्वीरें बनाता है।
ja: タートル・ブロックスはアートと数学を求めるビジュアル・プログラミング言語だ。
mr: टर्टल ब्लॉक्स एक लोगो-प्रेरित कासव आहे जे स्नॅप-टूगेदर व्हिज्युअल-प्रोग्रामिंग ब्लॉक्ससह रंगीत चित्रे काढते.
te: టర్టిల్ బ్లాక్స్ ఒంటరి ఆదరణ పొందిన కోడిగోరీ టర్టిల్, స్నాప్-టు-గెద్దల విజువల్-ప్రోగ్రామ
ur: کچھی بلاکس ایک لوگو سے متاثر کچھی ہے جو اسنیپ ٹوگ ٹوژوئل پروگرامنگ بلاکس کے ساتھ رنگین تصاویر کھینچتا ہے۔
zh_cn: 海龟图形块是一个受Logo启发的海龟，它通过拼接的可视编程块绘制色彩斑斓的图画。

source: The current version is
es: La versión actual es
fr: La version actuelle est
hi: वर्तमान संस्करण है
ja: ミュージック・ブロックスの最新バージョンは
mr: सध्याचे आवृत्ती आहे
pt: A versão atual é
te: ప్రస్తుత సంస్కరణం
tr: geçerli sürüm şudur
ur: موجودہ ورژن ہے
zh_cn: 当前版本是

source: Click the run button to run the project in fast mode.
es: Haga clic para ejecutar el proyecto en modo rápido.
fr: Cliquez sur le bouton d'exécution pour lancer le projet en mode rapide.
hi: तेज मोड में परियोजना को चलाने के लिए रन बटन पर क्लिक करें।
ja: クリックをすると、ふつうのスピードでプログラムを実行することができる。
mr: प्रकल्प जलद मोड मध्ये चालवण्यासाठी रन बटणावर क्लिक करा.
pt: Clique no botão executar para tocar o projeto em modo rápido
te: ప్రాజెక్ట్‌ను వేగంగా అభ్యర్థించడానికి రన్ బటన్‌ను క్లిక్ చేయండి.
tr: Projeyi hızlı modda çalıştırmak için çalıştır düğmesine tıklayın
ur: پروجیکٹ کو تیز موڈ میں چلانے کے لئے رن بٹن پر کلک کریں۔
zh_cn: 点击运行按钮以在快速模式下运行项目

source: Stop the turtle.
es: Detener la tortuga.
fr: Arrêter la tortue.
hi: कछुआ को रोकें।
ja: タータルを止める
mr: कासव थांबवा.
te: టర్టిల్‌ను ఆపండి.
tr: kaplumbağayı durdur
ur: کچھی بند کرو۔
zh_cn: 停止海龟

source: You can also type Alt-S to stop.
es: También puede escribir Alt-S para detenerse.
fr: Vous pouvez également taper Alt-S pour arrêter.
hi: आप रोकने के लिए Alt-S भी टाइप कर सकते हैं।
ja: プログラムは、このボタンをおすかわりに、キーボードで「Altキーと Sキーの同時おし」でも止めることができる。
mr: थांबवण्यासाठी तुम्ही Alt-S देखील टाइप करू शकता.
pt: Você também pode pressionar Alt-S para parar
te: మీరు ఆపడానికి Alt-S టైప్ చేసి కనుక రాను ఆపవచ్చు.
ur: آپ روکنے کے لئے Alt-S بھی ٹائپ کرسکتے ہیں۔
zh_cn: 您也可以按 Alt-S 停止。

source: Welcome to Music Blocks
es: Bienvenido a Bloques de Música
fr: Bienvenue à Music Blocks
hi: म्यूजिक ब्लॉक में आपका स्वागत है
ja: ミュージック・ブロックスへようこそ
mr: संगीत ब्लॉक्स मध्ये आपले स्वागत आहे
pt: Bem vindo ao Music Blocks
te: మ్యూజిక్ బ్లాక్స్‌కి స్వాగతం
tr: müzik bloklarına hoş geldiniz
ur: میوزک بلاکس میں خوش آمدید
zh_cn: 欢迎来到音乐块

source: Music Blocks is a collection of tools for exploring fundamental musical concepts in a fun way.
es: Bloques de Música es una colección de herramientas de manipulación para explorar conceptos musicales fundamentales de una manera integradora y divertido.
fr: Music Blocks est une collection d'outils pour explorer les concepts musicaux fondamentaux de manière amusante.
hi: म्यूजिक ब्लॉक्स संगीत के मौलिक अवधारणाओं का अन्वेषण करने के लिए एक मजेदार तरीके से सुझाव देता है।
ja: 音楽と算数とプログラミングをむすびつけ、深く楽しむことができるツール。それが、ミュージック・ブロックスだ。
mr: संगीत ब्लॉक्स मस्तीदार पद्धतीने मूलभूत संगीत संकल्पनांचा शोध घेण्यासाठी साधनांचा संग्रह आहे.
pt: Music Blocks é uma coleção de ferramentas para explorar conceitos musicais fundamentais de uma forma divertida.
te: మ్యూజిక్ బ్లాక్స్ అనేది అందుబాటుల దారికే ఆధారమైన సంగీత అవగాహనాలను అనుభవించడానికి సాధనాల సమూహము.
tr: music blocks
ur: میوزک بلاکس تفریحی انداز میں بنیادی میوزیکل تصورات کی کھوج کے ل tools ٹولز کا ایک مجموعہ ہے۔
zh_cn: 音乐块是一个工具集，用于以有趣的方式探索基本的音乐概念。

source: Meet Mr. Mouse!
es: Conoce Sr. Ratón
fr: Rencontrez M. Mouse !
hi: मिस्टर माउस से मिलें!
ja: ミスター・マウスに会おう！
mr: मि. माऊस ला भेटा!
pt: Conheça o Sr. Ratinho!
te: మీట్ మిస్టర్ మౌస్!
tr: bay fare i̇le tanişin!
ur: مسٹر ماؤس سے ملو!
zh_cn: 会面 Mr. Mouse!

source: Mr Mouse is our Music Blocks conductor.
es: Sr. Ratón es nuestro conductor de Bloques de Música.
fr: M. Mouse est notre chef d'orchestre Music Blocks.
hi: मिस्टर माउस हमारे संगीत ब्लॉक्स कंडक्टर हैं।
ja: ミスター・マウスは、ミュージック・ブロックスの指揮者。
mr: मि. माऊस हे आमचे संगीत ब्लॉक्स संचालक आहेत.
pt: Sr Ratinho é o nosso guia do Music Blocks.
te: మిస్టర్ మౌస్ మాసిక్ బ్లాక్స్ కండక్టర్.
tr: bay fare bizim müzik blokları şefimizdir
ur: مسٹر ماؤس ہمارے میوزک بلاکس کنڈکٹر ہیں۔
zh_cn: Mr Mouse 是我们的音乐块指挥。

source: Mr Mouse encourages you to explore Music Blocks.
es: Sr. Ratón le anima a explorar los Bloques de Música.
fr: M. Mouse vous encourage à explorer Music Blocks.
hi: मिस्टर माउस आपको म्यूजिक ब्लॉक्स का अन्वेषण करने के लिए प्रेरित करता है।
ja: ミスター・マウスと一緒に、ミュージック・ブロックスの世界をたんきゅうしよう。
mr: मि. माऊस तुम्हाला संगीत ब्लॉक्सचा शोध घेण्यास प्रोत्साहित करतात.
pt: Sr Ratinho incentiva a explorar o Music Blocks.
te: మిస్టర్ మౌస్ మీరు మ్యూజిక్ బ్లాక్స్‌ను అన్వేషించడానికి ఆహ్వానిస్తాడు.
tr: bay fare sizi müzik bloklarını keşfetmeniz için cesaretlendirir
ur: مسٹر ماؤس آپ کو میوزک بلاکس کی تلاش کے لئے حوصلہ افزائی کرتا ہے۔
zh_cn: Mr Mouse 鼓励您探索音乐块。

source: Let us start our tour!
es: Vamos a empezar nuestro recorrido!
fr: Commençons notre visite !
hi: आइए हमारा दौरा शुरू करें!
ja: では、ツアーを始めよう。
mr: चला, आमचा दौरा सुरू करूया!
pt: Vamos iniciar o nosso tour!
te: మా పర్యటనను ప్రారంభించోదాము!
tr: turumuza başlayalim!
ur: آئیے ہم اپنا ٹور شروع کریں!
zh_cn: 让我们开始我们的旅程！

source: Guide
es: Guía
hi: मार्गदर्शिका
ja: もっとくわしく知るには
mr: मार्गदर्शक.
pt: Guia
te: మార్గదర్శిక
tr: Kılavuz
ur: گائیڈ
zh_cn: 指南

source: A detailed guide to Music Blocks is available.
es: Una guía detallada de Bloques de Música está disponible.
fr: Un guide détaillé de Music Blocks est disponible.
hi: म्यूजिक ब्लॉक्स के लिए एक विस्तृत मार्गदर्शिका उपलब्ध है।
ja: インターネットから、ミュージック・ブロックスのさらにくわしいガイドページを見ることができる。次のリンク先を開いてみよう。
mr: संगीत ब्लॉक्ससाठी सविस्तर मार्गदर्शक उपलब्ध आहे.
pt: Um guia detalhado do Music Blocks está disponível.
te: మ్యూజిక్ బ్లాక్‌ల సవిస్తోన సవిస్తారు.
tr: müzik blokları için ayrıntılı bir kılavuz mevcuttur
ur: میوزک بلاکس کے لئے ایک تفصیلی گائیڈ دستیاب ہے۔
zh_cn: 提供了详细的音乐块指南。

source: Stop the music (and the mice).
es: Detener la música (y los ratones)
fr: Arrêtez la musique (et les souris).
hi: संगीत को रोकें (और चूहे भी)।
ja: 実行しているプログラムを止める。
mr: संगीत (आणि उंदीर) थांबवा.
pt: Parar a música (e o rato)
te: సంగీతం మరియు మౌస్‌ను ఆపండి.
tr: müziği (ve fareleri) durdurun
ur: موسیقی (اور چوہوں) کو روکیں۔
zh_cn: 停止音乐 (and the mice)

source: Record your project as video.
es: Grabe su proyecto como video.
fr: Enregistrez votre projet en vidéo.
hi: अपने परियोजना को एक वीडियो के रूप में रिकॉर्ड करें।
ja: 再生されているビデオを録音する
mr: तुमचा प्रकल्प व्हिडिओ म्हणून रेकॉर्ड करा.
te: మీ ప్రాజెక్ట్‌ను వీడియోగా రికార్డ్ చేయండి.
tr: projenizi video olarak kaydedin
ur: اپنے پروجیکٹ کو بطور ویڈیو ریکارڈ کریں۔
zh_cn: 将您的项目录制为视频

source: Toggle Fullscreen mode.
es: Alternar el modo de pantalla completa
fr: Basculer en mode plein écran.
ja: フルスクリーンの切り替え
mr: पूर्ण स्क्रीन मोड टॉगल करा.
tr: tam ekran modunu değiştir
ur: ٹوگل فل سکرین موڈ۔
zh_cn: 切换全屏模式

source: Initialize a new project.
es: Inicializar un nuevo proyecto.
fr: Initier un nouveau projet.
hi: एक नई परियोजना की शुरुआत करें।
ja: 新しいプロジェクトを作る。
mr: एक नवीन प्रकल्प सुरू करा.
pt: Iniciar um novo projeto.
te: కొత్త ప్రాజెక్ట్‌ను ప్రారంభించండి.
tr: yeni bir proje başlatın
ur: ایک نیا پروجیکٹ شروع کریں۔
zh_cn: 初始化一个新项目

source: You can also load projects from the file system.
es: También puede cargar proyectos desde el sistema de archivos.
fr: Vous pouvez également charger des projets à partir du système de fichiers.
hi: आप फ़ाइल सिस्टम से भी परियोजनाएं लोड कर सकते हैं।
ja: コンピューターに保存してあるファイルから、ミュージック・ブロックスのプロジェクトを読み込んで開く。
mr: आपण फाइल प्रणाली मधुन पण प्रकल्प लोड करू शकतो.
pt: Você também pode carregar projetos do sistema de arquivos.
te: మీరు ఫైల్ వ్యవస్థను నుండి ప్రాజెక్ట్‌లను లోడ్ చేయవచ్చు.
tr: projeleri dosya sisteminden de yükleyebilirsiniz
ur: آپ فائل سسٹم سے پروجیکٹس بھی لوڈ کرسکتے ہیں۔
zh_cn: 您也可以从文件系统加载项目

source: Save
es: Guardar
fr: Enregistrer
hi: सहेजें
ja: 保存する
mr: जतन करा
pt: Salvar
te: భద్రపరచు
tr: Kaydet
ur: محفوظ کریں۔
zh_cn: 保存

source: Save your project to a file.
es: Guarde proyecto en archivo
fr: Enregistrez votre projet dans un fichier.
hi: अपनी परियोजना को एक फ़ाइल में सहेजें।
ja: げんざい開いているプロジェクトをほぞんする。
mr: तुमचा प्रकल्प एखाद्या फाइल मध्ये जतन करा.
pt: Salve seu projeto em um arquivo.
te: మీ ప్రాజెక్ట్‌ను ఫైల్‌లో భద్రపరచండి.
tr: projenizi bir dosyaya kaydedin
ur: اپنے پروجیکٹ کو فائل میں محفوظ کریں۔
zh_cn: 将您的项目保存到文件

source: Save graphics from your project to as SVG.
es: Guardar gráficos de su proyecto como SVG
fr: Enregistrer les graphiques de votre projet en tant que SVG.
hi: अपनी परियोजना से ग्राफिक्स को एसवीजी के रूप में सहेजें।
ja: プロジェクトのグラフィックをSVGで保存
mr: तुमच्या प्रकल्पातील ग्राफिक्स SVG म्हणून जतन करा.
pt: Salvar os grficos do seu projeto como SVG.
tr: Projenizdeki grafikleri svg olarak kaydedin
ur: اپنے پروجیکٹ سے گرافکس کو بطور SVG میں محفوظ کریں۔
zh_cn: 将项目中的图形保存为SVG

source: Save graphics from your project as PNG.
es: Guardar gráficos de su proyecto como PNG
fr: Enregistrer les graphiques de votre projet en tant que PNG.
hi: अपनी परियोजना से ग्राफिक्स को पीएनजी के रूप में सहेजें।
ja: プロジェクトのグラフィックをPNGで保存
mr: तुमच्या प्रकल्पातील ग्राफिक्स PNG म्हणून जतन करा.
pt: Salvar os gráficos do seu projeto como PNG.
te: మీ ప్రాజెక్ట్ ను SVG గా గ్రాఫిక్స్ భద్రపరచండి.
tr: projenizdeki grafikleri png olarak kaydedin
ur: اپنے پروجیکٹ سے گرافکس کو PNG کے بطور محفوظ کریں۔
zh_cn: 将项目中的图形保存为PNG

source: Save block artwork as an SVG file.
es: Guardar bloque de ilustraciones como un archivo de SVG
fr: Enregistrer l'œuvre du bloc en tant que fichier SVG.
hi: ब्लॉक कला को एसवीजी फ़ाइल के रूप में सहेजें।
ja: ブロックのグラフィックをSVGで保存
mr: ब्लॉक कलाकृती SVG फाइल म्हणून जतन करा.
pt: Salvar ilustração do bloco como uma arquivo SVG.
te: మీ బ్లాక్ ఆర్ట్‌వర్క్‌ను SVG ఫైల్ గా భద్రపరచండి.
tr: blok resmi bir svg dosyası olarak kaydedin
ur: بلاک آرٹ ورک کو SVG فائل کے طور پر محفوظ کریں۔
zh_cn: 将块图形保存为SVG文件

source: Save sheet music as ABC, Lilypond or MusicXML
tr: notaları abc
ur: شیٹ میوزک کو ABC، Lilypond یا MusicXML کے بطور محفوظ کریں۔
zh_cn: 将乐谱保存为ABC、LilyPond或MusicXML格式

source: Save block artwork as SVG or PNG
tr: blok resmi svg veya png olarak kaydet
ur: بلاک آرٹ ورک کو SVG یا PNG کے بطور محفوظ کریں۔
zh_cn: 将块图形保存为SVG或PNG

source: Load samples from server
es: Cargar ejemplos desde el servidor
fr: Charger des exemples depuis un serveur
hi: सर्वर से नमूना लोड करें
ja: みんなの作品
mr: सर्व्हर नमुने लोड करा
pt: Carregar amostras do servidor
te: సర్వర్ నుండి సేంపులను లోడ్ చేయండి.
tr: örnekleri sunucudan yükle
ur: سرور سے نمونے لوڈ کریں۔
zh_cn: 从服务器加载样本

source: This button opens a viewer for loading example projects.
es: Este botón abre la pantalla de carga de proyectos de ejemplo.
fr: Ce bouton ouvre une visionneuse pour charger des exemples de projets.
hi: यह बटन नमूने देखने के लिए एक दर्शक खोलता है।
ja: インターネットの「プラネット（わくせい）」というページから、ほかの人が作ったプロジェクトを選んで、読みこむことができる。
mr: हे बटण उदाहरणार्थ प्रकल्प लोड करण्यासाठी एक दर्शक उघडते.
pt: Este botão abre um visualizador para carregar exemplos de projetos.
te: ఈ బటన్ ఒక వ్యూయర్‌ను తెరవికొని ఉదాహరణ ప్రాజెక్టులను లోడ్ చేస్తుంది.
tr: bu düğme örnek projeleri yüklemek için bir görüntüleyici açar
ur: یہ بٹن مثال کے منصوبوں کو لوڈ کرنے کے لیے ایک ناظر کو کھولتا ہے۔
zh_cn: 此按钮打开一个查看器，用于加载示例项目

source: Expand/collapse option toolbar
es: Expandir/colapsar la barra de opciones.
fr: Développer/réduire la barre d'outils des options
hi: विकल्प टूलबार को विस्तृत/संकुचित करें
ja: オプションツールバーを表示
mr: साधनपट्टी दाखवायसाठी / लपवायसाठी पर्याय
pt: Expandir/recolher a barra de ferramentas
te: ఎంపిక టూల్‌బార్‌ను విస్తరించండి/మూసివేయండి
tr: seçenek araç çubuğunu genişlet/daralt
ur: توسیع / جمع آپشن ٹول بار
zh_cn: 展开/收起选项工具栏

source: Click this button to expand or collapse the auxillary toolbar.
es: Haga clic en este botón para expandir o contraer la barra de herramientas auxiliar.
fr: Cliquez sur ce bouton pour développer ou réduire la barre d'outils auxiliaire.
ja: このボタンをクリックすると「サブメニュー」を開いたり、折りたたんだりすることができる。
mr: या बटणावर क्लिक करून सहाय्यक टूलबार विस्तारित किंवा संकुचित करा.
pt: Clique neste botão para expandir ou recolher a barra de ferramentas auxiliar.
tr: yardımcı araç çubuğunu genişletmek veya daraltmak için bu düğmeyi tıklayın
ur: آکسلیری ٹول بار کو وسعت دینے یا اسے ختم کرنے کے لئے اس بٹن پر کلک کریں۔

source: Displays help messages for the main and auxiliary toolbar, right-click contextual menu for blocks and canvas, and palettes.
ur: مرکزی اور معاون ٹول بار کے لیے مدد کے پیغامات دکھاتا ہے، بلاکس اور کینوس اور پیلیٹ کے لیے سیاق و سباق کے مینو پر دائیں کلک کریں۔
zh_cn: 显示主工具栏和辅助工具栏的帮助信息，块和画布的右键上下文菜单，以及调色板的帮助信息

source: Click to run the project in slow mode.
es: Haz click para ejecutar el proyecto en modo lento.
fr: Cliquez pour exécuter le projet en mode lent.
hi: प्रोजेक्ट को धीरे चलाने के लिए यहाँ क्लिक करें
ja: クリックをすると、ゆっくりとしたスピードでプログラムを実行することができる。
mr: प्रकल्प मंद पणे चालवण्यासाठी येथे क्लिक करा.
pt: Clique para executar o projeto no modo lento.
te: ప్రాజెక్ట్‌ను నిధానంగా పరికరించడానికి నొక్కండి.
tr: projeyi yavaş modda çalıştırmak için tıklayın
ur: سست موڈ میں پروجیکٹ چلانے کے لئے کلک کریں۔
zh_cn: 点击以在慢速模式下运行项目

source: Click to run the project step by step.
es: Haz click para ejecutar el proyecto en modo paso a paso.
fr: Cliquez pour exécuter le projet étape par étape.
hi: प्रोजेक्ट को क्रमशः चलने के लिए क्लिक करें
ja: クリックをすると、とてもゆっくり、ブロックを１つずつ実行する。プログラムがうまくはたらかず、どのブロックが原因なのかを調べたいときなどに便利だ。
mr: प्रकल्प चरण-दर-चरण चालवण्यासाठी येथे क्लिक करा.
pt: Clique para executar o projeto passo a passo.
te: ప్రాజెక్ట్‌ను పటికి పటికి పరికరించడానికి నొక్కండి.
tr: Projeyi adım adım çalıştırmak için tıklayın
ur: منصوبے کو مرحلہ وار چلانے کے لئے کلک کریں۔
zh_cn: 点击按步骤运行项目

source: Display statistics about your Music project.
es: Analizar los tipos de bloques usados.
fr: Afficher les statistiques sur votre projet musical.
hi: अपने संगीत प्रोजेक्ट के आँकड़े दिखाएँ।
ja: プロジェクトに含まれているブロックの種類、わりあいなど、とうけいてきなじょうほうを表示する。
mr: आपल्या संगीत प्रकल्पाबद्दल आकडेवारी दर्शवा.
pt: Exibe estatísticas sobre o seu projeto de música.
te: మీ సంగీత ప్రాజెక్ట్‌గా సంఖ్యలను చూపించండి.
tr: müzik projeniz hakkındaki istatistikleri görüntüler
ur: اپنے میوزک پروجیکٹ کے بارے میں اعدادوشمار دکھائیں۔
zh_cn: 显示有关您音乐项目的统计信息
