Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Mouse-button block returns True if the mouse button is pressed.
es: El bloque Botón del ratón devuelve Verdadero si se presiona el botón del ratón.
fr: Le bloc Bouton de la souris renvoie Vrai si le bouton de la souris est enfoncé.
hi: माउस-बटन ब्लॉक तब सच है जब माउस बटन दबाया गया है।
ja: <h2>真偽ブロック（マウスボタン）</h2><br>マウスのボタンがおされているかどうかはんていする。マウスボタンがおされていれば「真（しん）」、おされていなければ「偽（ぎ）」という値になる。<br>図の例は、ネズミを使って画面上に自由に線をえがけるプログラム。ネズミがパソコンのマウスカーソルの位置にいどうし続けつつ、マウスをおしているときだけペンをおろし、線をえがく。<br><br>★しんぎブロックとは<br>「もし～ならば」などのじょうけんブロックを動かすために必要なブロック。<br>「もし～ならば」は、せいかくに表現すると、「もし～というじょうけんが正しいならば、次のブロックを実行する」という意味である。しんぎブロックは不等式などによるひかくが「正しい（真）」か、「正しくない（偽）」かの結果を表し、「もし～ならば」に続くブロックを実行するかどうか決める。
mr: माऊस-बटण ब्लॉक माऊस बटण दाबले असल्यास सत्य परतवतो.
pt: O bloco Botão-do-ratinho retorna Verdadeiro se o botão do ratinho for pressionado.
te: మౌస్ బటన్ నొక్కితే, మౌస్-బటన్ బ్లాక్ ట్రూ నొక్కితే తెరిచిపెట్టుతుంది.
ur: اگر ماؤس کے بٹن کو دبایا جائے تو ماؤس بٹن بلاک True واپس آجاتا ہے۔
zh_cn: Mouse-button 块在鼠标按钮被按下时返回 True。

source: to ASCII
es: a ASCII
fr: en ASCII
hi: एस्की में
ja: ASCIIに
mr: ASCII ला
pt: ir para ASCII
te: ASCIIకి
tr: ascii'ye
ur: ASCII کو
zh_cn: 转换为 ASCII

source: The To ASCII block converts numbers to letters.
es: El bloque a ASCII convierte números a letras.
fr: Le bloc En ASCII convertit les nombres en lettres.
hi: टू एस्की ब्लॉक संख्याओं को अक्षर में बदलता है।
mr: ASCII ब्लॉक संख्या अक्षरांमध्ये रूपांतरित करतो.
pt: O bloco Para ASCII converte números em letras.
te: టూ ASCII బ్లాక్ సంఖ్యలను అక్షరాలకు మార్చుతుంది.
tr: to ascii bloğu sayıları harflere dönüştürür
ur: ٹو ASCII بلاک نمبروں کو حروف میں تبدیل کرتا ہے۔
zh_cn: To ASCII 块将数字转换为字母。

source: The Keyboard block returns computer keyboard input.
es: El bloque teclado devuelve entrada de teclado.
fr: Le bloc Clavier renvoie l'entrée du clavier de l'ordinateur.
hi: कीबोर्ड ब्लॉक कंप्यूटर कीबोर्ड इनपुट वापस करता है।
mr: कीबोर्ड ब्लॉक संगणक कीबोर्ड इनपुट परतवतो.
pt: O bloco Teclado retorna o teclado de entrada do computador.
te: కీబోర్డు బ్లాక్ కంప్యూటర్ కీబోర్డ్ ఇన్‌పుట్ను తెరిచిపెడతారు.
tr: klavye bloğu bilgisayar klavye girdisini döndürür
ur: کی بورڈ بلاک کمپیوٹر کی بورڈ ان پٹ واپس کرتا ہے۔
zh_cn: Keyboard 块返回电脑键盘输入。

source: Envelope
es: Envolvente
fr: Enveloppe
hi: एनवेलप
ja: エンベロープ
mr: लिफाफा
te: ఎన్వలప్
tr: Zarf
ur: لفافہ
zh_cn: 包络

source: attack
es: atacar
fr: attaque
hi: आक्रमण
ja: アタック
mr: आक्रमण
pt: iniciar
te: ఆటాక్
tr: atak
ur: حملہ
zh_cn: 起音时间

source: decay
es: decaer
fr: décroissance
hi: क्षय
ja: ディケイ
mr: क्षय
pt: decair
te: డికే
tr: çürüme
ur: زوال
zh_cn: 衰减时间

source: sustain
es: sostener
fr: soutien
hi: सस्टेन
ja: サステイン
mr: सस्टेन
pt: sustentar
te: సస్టేన్
ur: برقرار رکھنا
zh_cn: 持续时间

source: release
es: liberar
fr: relâchement
hi: रिलीज
ja: リリース
mr: रिलीज
pt: lançar
te: రిలీస్
ur: رہائی
zh_cn: 释放时间

source: Attack value should be from 0 to 100.
es: El valor de atacar debe estar entre 0 y 100.
fr: La valeur d'attaque doit être comprise entre 0 et 100.
hi: आक्रमण मूल्य 0 से 100 के बीच होना चाहिए।
ja: アタック値には 0 以上100以下の数字をいれて下さい。
mr: आक्रमण मूल्य 0 ते 100 दरम्यान असावे.
pt: O valor de volume deve ser de 0 a 100.
te: దాడుట విలువ ఉండాలి 0 నుండి 100 లలో.
tr: saldırı değeri 0 ila 100 arasında olmalıdır
ur: حملے کی قدر 0 سے 100 تک ہونی چاہیے۔
zh_cn: Attack 值应在 0 到 100 之间。

source: Decay value should be from 0 to 100.
es: El valor de decaer debe estar entre 0 y 100.
fr: La valeur de décroissance doit être comprise entre 0 et 100.
hi: क्षय मूल्य 0 से 100 के बीच होना चाहिए।
ja: 減衰値には 0 以上100以下の数字をいれて下さい。
mr: क्षय मूल्य 0 ते 100 दरम्यान असावे.
pt: O valor de decaimento deve ser de 0 a 100.
te: డికే విలువ ఉండాలి 0 నుండి 100 లలో.
tr: bozunma değeri 0 ila 100 arasında olmalıdır
ur: زوال کی قدر 0 سے 100 تک ہونی چاہیے۔
zh_cn: Decay 值应在 0 到 100 之间。

source: Sustain value should be from 0 to 100.
es: El valor de sostener debe estar entre 0 y 100.
fr: La valeur de soutien doit être comprise entre 0 et 100.
hi: सस्टेन मूल्य 0 से 100 के बीच होना चाहिए।
ja: サステイン値には 0 以上100以下の数字をいれて下さい。
mr: सस्टेन मूल्य 0 ते 100 दरम्यान असावे.
pt: O valor da sustentação deve ser de 0 a 100.
te: సస్టేన్ విలువ ఉండాలి 0 నుండి 100 లలో.
tr: sustain değeri 0 ila 100 arasında olmalıdır
ur: پائیداری کی قدر 0 سے 100 تک ہونی چاہیے۔
zh_cn: Sustain 值应在 0 到 100 之间。

source: Release value should be from 0-100.
es: El valor de liberar debe estar entre 0 y 100.
fr: La valeur de relâchement doit être comprise entre 0 et 100.
hi: रिलीज मूल्य 0 से 100 के बीच होना चाहिए।
ja: リリース値には 0 以上100以下の数字をいれて下さい。
mr: रिलीज मूल्य 0-100 दरम्यान असावे.
pt: O valor de lançamento deve ser de 0 a 100.
te: రిలీస్ విలువ ఉండాలి 0 నుండి 100 లలో.
ur: ریلیز کی قیمت 0-100 تک ہونی چاہیے۔
zh_cn: Release 值应在 0 到 100 之间。

source: You are adding multiple envelope blocks.
es: Está agregando varios bloques de envolvente.
fr: Vous ajoutez plusieurs blocs d'enveloppe.
hi: आप कई एनवेलोप ब्लॉक जोड़ रहे हैं।
ja: 封筒ブロックを複数追加しています。
mr: आपण एकाधिक लिफाफा ब्लॉक्स जोडत आहात.
pt: Você está adicionando vários blocos de envelope.
te: మీరు అనేక ఎన్వలప్ బ్లాక్‌లను జోడిస్తున్నారు.
tr: birden fazla zarf bloğu ekliyorsunuz
ur: آپ متعدد لفافے بلاکس شامل کر رہے ہیں۔
zh_cn: 您正在添加多个包络块。

source: Filter
es: Filtrar
fr: Filtre
hi: फ़िल्टर
ja: フィルター
mr: फिल्टर
pt: Filtro
te: ఫిల్టర్
tr: Filtre
ur: فلٹر
zh_cn: 滤波器

source: rolloff
es: rodar
fr: décroissance
hi: रोलऑफ
ja: ロールオフ
mr: रोलऑफ
pt: para fora
te: రోలాఫ్
tr: rollloff
ur: رول آف
zh_cn: 衰减斜率

source: Rolloff value should be either -12, -24, -48, or -96 decibels/octave.
es: Roll off valor debe ser -12, -24, -48, o -96 decibelios.
fr: La valeur de décroissance doit être de -12, -24, -48 ou -96 décibels/octave.
hi: रोलऑफ मूल्य -12, -24, -48, या -96 डेसिबल्स/ऑक्टेव होना चाहिए।
ja: ロールオフ値は -12, -24, -48, -98 デシベル / オクターヴである必要があります。
mr: रोलऑफ मूल्य -12, -24, -48 किंवा -96 डेसिबल्स/ऑक्टेव्ह असावे.
pt: O valor de referência deve ser -12, -24, -48 ou -96 decibéis / oitava.
te: రోలాఫ్ విలువ ఆరంభంగా -12, -24, -48 లేదా -96 డిసిబల్లాలు/అక్టావ్ అవసరం.
ur: رول آف ویلیو یا تو -12، -24، -48، یا -96 ڈیسیبل/آکٹیو ہونی چاہیے۔
zh_cn: Rolloff 值应为 -12、-24、-48 或 -96 分贝/倍频程。

source: The Temperament tool is used to define custom tuning.
es: La Herramienta temperamento se utiliza para definir la afinación personalizada.
fr: L'outil Tempérament est utilisé pour définir un accordage personnalisé.
hi: टेम्पेरमेंट टूल का उपयोग कस्टम ट्यूनिंग को निर्धारित करने के लिए किया जाता है।
mr: टेम्परामेंट टूल कस्टम ट्यूनिंग परिभाषित करण्यासाठी वापरले जाते.
pt: A ferramenta Temperamento é usada para definir uma afinação personalizada.
te: కస్టమ్ ట్యూనింగ్‌ను నిర్వచించడానికి టెంపరమెంట్ టూల్ ఉపయోగపడుతుంది.
tr: temperament aracı özel akort tanımlamak için kullanılır
ur: مزاج ٹول کو حسب ضرورت ٹیوننگ کی وضاحت کے لیے استعمال کیا جاتا ہے۔
zh_cn: Temperament 工具用于定义自定义调音。

source: Upload a sample and adjust its pitch center.
es: Sube una muestra de audio y ajusta su centro de tono.
fr: Téléchargez un échantillon et ajustez son centre de hauteur.
hi: एक सैंपल अपलोड करें और इसके पिच केंद्र को समायोजित करें।
mr: नमुना अपलोड करा आणि त्याचे पिच सेंटर समायोजित करा.
te: ఒక నమూనాను అప్లోడ్ చేసి అదిక పిచ్ కేంద్రాన్ని సరిచూడండి.
tr: bir örnek yükleyin ve perde merkezini ayarlayın
ur: ایک نمونہ اپ لوڈ کریں اور اس کے پچ سینٹر کو ایڈجسٹ کریں۔
zh_cn: 上传采样并调整其音高中心。

source: sampler
es: muestreador de audio
fr: échantillonneur
hi: सैम्पलर
ja: サンプラー
mr: सॅम्पलर
te: సాంప్లర్
tr: örnekleyici
ur: نمونہ لینے والا
zh_cn: 采样器

source: The Meter block opens a tool to select strong beats for the meter.
es: El bloque Meter abre una herramienta para seleccionar golpes fuertes para el metro.
fr: Le bloc Mètre ouvre un outil pour sélectionner les temps forts du mètre.
hi: मीटर ब्लॉक एक टूल
ja: <h2>拍子ブロック</h2><br>テーブルの数字をクリックして、強い拍（はく）の位置を決める。<br>★拍子（ひょうし）とは<br>拍（はく）がいくつかまとまったもの。<br>★拍（はく）とは<br>くり返されるリズムのこと。
mr: मीटर ब्लॉक मीटरसाठी मजबूत बीट्स निवडण्यासाठी एक साधन उघडतो.
te: మీటర్ బ్లాక్ మీటర్కు బలంగా బాట్లు ఎంచుకోవడానికి ఒక టూల్ను తెరిచివేస్తుంది.
tr: ölçü bloğu
ur: میٹر بلاک میٹر کے لیے مضبوط دھڑکنوں کو منتخب کرنے کے لیے ایک ٹول کھولتا ہے۔
zh_cn: Meter 块打开一个工具以选择强拍。

source: The oscilloscope block opens a tool to visualize waveforms.
es: El bloque del osciloscopio abre una herramienta para visualizar formas de onda.
fr: Le bloc Oscilloscope ouvre un outil pour visualiser les formes d'onde.
hi: ऑसिलोस्कोप ब्लॉक एक उपकरण खोलता है जिससे तरंगरूप दृष्टिकोण को दृष्टिगत किया जा सकता है।
mr: ऑसिलोस्कोप ब्लॉक वेव्हफॉर्म्स दृश्यमान करण्यासाठी एक साधन उघडतो.
te: ఆస్కిలోస్కోప్ బ్లాక్ ఒక టూల్ను తెరిచివేస్తుంది వేవ్ఫారాలు చూపించడానికి.
tr: osiloskop bloğu dalga biçimlerini görselleştirmek için bir araç açar
ur: آسیلوسکوپ بلاک ویوفارمز کو دیکھنے کے لیے ایک ٹول کھولتا ہے۔
zh_cn: 示波器块打开一个用于可视化波形的工具。

source: oscilloscope
es: osciloscopio
hi: ऑसिलोस्कोप
ja: オシロスコープ
mr: ऑसिलोस्कोप
te: ఆస్కిలోస్కోప్
tr: osiloskop
ur: آسیلوسکوپ
zh_cn: 示波器

source: The Custom mode block opens a tool to explore musical mode (the spacing of the notes in a scale).
es: El bloque Modo personalizado abre una herramienta para explorar el modo musical (el espaciado de las notas en una escala).
fr: Le bloc Mode personnalisé ouvre un outil pour explorer le mode
hi: कस्टम मोड ब्लॉक एक उपकरण खोलता है जिससे संगीतिक मोड (स्केल में नोट्स की जगह) का अन्वेषण किया जा सकता है।
ja: <h2>モード（音階）ブロック</h2><br>いろいろな音階をさがすツールを表示する。音階は、音と音のかんかくを決めながらさがすことができる。<br><br>★音階とは<br>順番に並んだ音のまとまり。たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。
mr: कस्टम मोड ब्लॉक संगीत मोड (स्केलमधील नोट्सचे अंतर) शोधण्यासाठी एक साधन उघडतो.
pt: O bloco do modo Personalizado abre uma ferramenta para explorar o modo musical (o espaçamento das notas em uma escala).
te: కస్టమ్ మోడ్ బ్లాక్ సంగీత మోడ్ (స్కేల్లో గానాల వడపోత) అన్నిటికి ఆవకాశాన్ని తెరిచివేస్తుంది.
tr: özel mod bloğu
ur: کسٹم موڈ بلاک میوزیکل موڈ کو دریافت کرنے کے لیے ایک ٹول کھولتا ہے (اسپیسنگ میں نوٹوں کا وقفہ)۔
zh_cn: Custom mode 块打开一个用于探索音乐调式（音阶中音符间距）的工具。

source: custom mode
es: modo personalizado
fr: mode personnalisé
hi: कस्टम मोड
ja: 音階
mr: कस्टम मोड
pt: modo personalizado
te: కస్టమ్ మోడ్
tr: özel mod
ur: اپنی مرضی کے موڈ

source: The Tempo block opens a metronome to visualize the beat.
es: El bloque Tempo abre un metrónomo para visualizar el ritmo.
fr: Le bloc Tempo ouvre un métronome pour visualiser le rythme.
hi: टेम्पो ब्लॉक एक मेट्रोनोम खोलता है जिससे बीट को दृष्टिगत किया जा सकता है।
ja: <h2>メトロノームブロック</h2><br>メトロノームを表示する。ボタンをおすと、メトロノームのはやさを変えられる。テーブルには、１分あたりの拍（はく）の数が表示される。<br><br>★拍（はく）とは<br>くり返されるリズムのこと。
mr: टेम्पो ब्लॉक बीट दृश्यमान करण्यासाठी एक मेट्रोनोम उघडतो.
pt: O bloco Tempo abre um metrônomo para visualizar a batida.
te: టెంపో బ్లాక్ బీట్ వేసారి చూపించడానికి మెట్రానోమ్ను తెరిచివేస్తుంది.
tr: tempo bloğu ritmi görselleştirmek için bir metronom açar
ur: ٹیمپو بلاک بیٹ کو دیکھنے کے لیے ایک میٹرنوم کھولتا ہے۔
zh_cn: Tempo 块打开节拍器以显示节拍。

source: The Arpeggio Widget is used to compose chord sequences.
es: El Arpegio Widget se usa para componer secuencias de acordes.
fr: Le widget Arpeggio est utilisé pour composer des séquences d'accords.
hi: आरपेजियो विजेट का उपयोग एकॉर्ड सीक्वेंस कंपोज करने के लिए किया जाता है।
ja: 「アルペジオ」ウィジェットは コード進行 を作るためです。
mr: अर्पेजियो विजेटचा वापर कॉर्ड अनुक्रम रचण्यासाठी केला जातो.
te: ఆర్పెజియో విడ్జెట్ కార్డు సీక్వెన్సులను రచించడానికి ఉపయోగపడుతుంది.
tr: arpej widget'ı akor dizileri oluşturmak için kullanılır
ur: آرپیگیو ویجیٹ کو راگ کی ترتیب ترتیب دینے کے لیے استعمال کیا جاتا ہے۔
zh_cn: 琶音小工具用于编写和弦序列。

source: The Pitch drum matrix is used to map pitches to drum sounds.
es: La Matriz de percusión de tono se utiliza para asignar tonos a los sonidos de tambor.
fr: La matrice de tambour de hauteur est utilisée pour mapper les hauteurs aux sons de tambour.
hi: पिच ड्रम मैट्रिक्स का उपयोग पिच को ड्रम साउंड्स से मैप करने के लिए किया जाता है।
mr: पिच ड्रम मॅट्रिक्सचा वापर पिचेस ड्रम आवाजांशी मॅप करण्यासाठी केला जातो.
pt: A matriz do Tom da bateria é usada para mapear tons dos sons da bateria.
te: పిచ్ డ్రమ్ మ్యాట్రిక్స్ పిచ్లను డ్రమ్ సౌండ్లకు మ్యాప్ చేయడానికి ఉపయోగిస్తారు.
tr: pitch drum matrisi
ur: پچ ڈرم میٹرکس کا استعمال پچوں کو ڈرم کی آوازوں پر نقشہ بنانے کے لیے کیا جاتا ہے۔
zh_cn: 音高鼓矩阵用于将音高映射到鼓声。

source: pitch-drum mapper
es: matriz de tono en tambor
fr: mappeur de tambour de hauteur
hi: पिच-ड्रम मैपर
ja: 音高-ドラム・マッパー
mr: पिच-ड्रम मॅपर
pt: mapa do tom de bateria
te: పిచ్-డ్రమ్ మ్యాప్పర్
ur: پچ ڈرم میپر

source: You must have at least one pitch block and one drum block in the matrix.
es: Debe tener al menos un bloque de tono y un bloque de tambor en la matriz.
fr: Vous devez avoir au moins un bloc de hauteur et un bloc de tambour dans la matrice.
hi: मैट्रिक्स में कम से कम एक पिच ब्लॉक और एक ड्रम ब्लॉक होना चाहिए।
ja: フレーズメーカーブロックには、音の高さブロックとドラムブロックを最低1つずつ入れてください。
mr: तुमच्याकडे मॅट्रिक्समध्ये किमान एक पिच ब्लॉक आणि एक ड्रम ब्लॉक असणे आवश्यक आहे.
pt: Você deve ter pelo menos um bloco de tom e um bloco de bateria na matriz.
te: మీరు మ్యాట్రిక్స్లో కనీసం ఒక పిచ్ బ్లాక్ మరియు ఒక డ్రమ్ బ్లాక్ ఉండాలి.
tr: matriste en az bir perde bloğunuz ve bir davul bloğunuz olmalıdır
ur: میٹرکس میں آپ کے پاس کم از کم ایک پچ بلاک اور ایک ڈرم بلاک ہونا چاہیے۔
zh_cn: 矩阵中必须至少有一个音高块和一个鼓块。

source: The Pitch slider tool to is used to generate pitches at selected frequencies.
es: La Herramienta de control deslizante tono se utiliza para generar tonos en las frecuencias seleccionadas.
fr: L'outil de curseur de hauteur est utilisé pour générer des hauteurs à des fréquences sélectionnées.
ja: <h2>ヘルツスライダーブロック</h2><br>スライダーを上下にうごかすことで、違う周波数（ヘルツのすうち）の音を聞くことができる。作った音をデータ化することができる。また、ヘルツの初期せっていちは、自由に変えられる。<br><br>★ヘルツとは音の高さを表す周波数。<br>★周波数とは音が１秒間に何回しんどうするかを表すすうち。周波数が高い（すうちが大きい）ほど、音が高くなる。
mr: पिच स्लायडर टूल निवडलेल्या फ्रिक्वेन्सीजवर पिचेस निर्माण करण्यासाठी वापरला जातो.
pt: A ferramenta de controle deslizante do Tom é usada para gerar tons em freqüências selecionadas.
te: పిచ్ స్లైడర్ టూల్ ఎంచుకోబడి అంగులాలలో పిచ్లను ఉత్పత్తించడానికి ఉపయోగిస్తారు.
tr: pitch slider aracı
ur: پچ سلائیڈر ٹول کو منتخب فریکوئنسیوں پر پچز بنانے کے لیے استعمال کیا جاتا ہے۔
zh_cn: 音高滑块工具用于生成选定频率的音高。

source: pitch slider
es: deslizante de tono
fr: curseur de hauteur
hi: पिच स्लाइडर
ja: ヘルツスライダー
mr: पिच स्लायडर
pt: medir tom do slider
te: పిచ్ స్లైడర్
tr: perde kaydırıcı
ur: پچ سلائیڈر
zh_cn: 音高滑块

source: chromatic keyboard
es: teclado cromático
fr: clavier chromatique
hi: क्रोमेटिक कीबोर्ड
ja: クロマティック・キーボード
mr: क्रोमॅटिक कीबोर्ड
te: క్రోమాటిక్ కీబోర్డ్
tr: kromatik klavye
ur: رنگین کی بورڈ

source: music keyboard
es: teclado musical
fr: clavier de musique
hi: संगीत कीबोर्ड
ja: キーボード
mr: संगीत कीबोर्ड
pt: teclado de música
te: సంగీత కీబోర్డ్
tr: müzik klavyesi
ur: موسیقی کی بورڈ

source: The Music keyboard block opens a piano keyboard that can be used to create notes.
es: El bloque Teclado de música abre un teclado de piano que puede usarse para crear notas.
fr: Le bloc Clavier de musique ouvre un clavier de piano qui peut être utilisé pour créer des notes.
hi: संगीत कीबोर्ड ब्लॉक एक पियानो कीबोर्ड खोलता है जिससे नोट बनाने के लिए उपयोग किया जा सकता है।
ja: <h2>キーボードブロック</h2><br>ピアノのキーボードを表示する。作った音をデータ化することができる。<br><br>
mr: संगीत कीबोर्ड ब्लॉक एक पियानो कीबोर्ड उघडतो ज्याचा वापर नोट्स तयार करण्यासाठी केला जाऊ शकतो.
pt: O bloco Teclado abre um teclado de piano que pode ser usado para criar notas.
te: మ్యూజిక్ కీబోర్డ్ బ్లాక్ నోట్లను సృష్టించడానికి పియానో కీబోర్డ్ను తెరిచివేస్తుంది.
tr: müzik klavyesi bloğu
ur: میوزک کی بورڈ بلاک ایک پیانو کی بورڈ کھولتا ہے جسے نوٹ بنانے کے لیے استعمال کیا جا سکتا ہے۔
zh_cn: Music keyboard 块打开一个钢琴键盘，可用于创建音符。

source: The Pitch staircase tool to is used to generate pitches from a given ratio.
es: La Herramienta escalera de tono se utiliza para generar tonos a partir de una relación dada.
fr: L'outil d'escalier de hauteur est utilisé pour générer des hauteurs à partir d'un rapport donné.
mr: पिच स्टेअरकेस टूल दिलेल्या गुणोत्तरापासून पिचेस निर्माण करण्यासाठी वापरला जातो.
pt: A ferramenta escada do Tom é usada para gerar tom a partir de uma determinada taxa.
te: పిచ్ స్టెయర్కేస్ టూల్ అంగులాలో ఇచ్చిన అనుపాతం నుండి పిచ్లను ఉత్పత్తించడానికి ఉపయోగిస్తారు.
tr: perde merdiveni aracı
ur: Pitch staircase ٹول کا استعمال دیے گئے تناسب سے پچز بنانے کے لیے کیا جاتا ہے۔
zh_cn: 音高阶梯工具用于根据给定比例生成音高。

source: pitch staircase
es: escalera de tono
fr: escalier de hauteur
hi: पिच स्टेयरकेस
ja: 音高の数列を作る
mr: पिच स्टेअरकेस
pt: medir tom da escala
te: పిచ్ స్టెయర్కేస్
tr: zift merdiveni
ur: پچ سیڑھی
zh_cn: 音高阶梯

source: The Rhythm Maker block opens a tool to create drum machines.
es: El bloque Hacer un ritmo abre una herramienta para crear cajas de ritmos.
fr: Le bloc Créateur de rythme ouvre un outil pour créer des boîtes à rythmes.
hi: रिदम मेकर ब्लॉक एक उपकरण खोलता है जिससे ड्रम मशीन बनाई जा सकती है।
ja: <h2>リズムメーカーブロック</h2><br>音の長さでぶんかつしてリズムを作るテーブルを表示する。作ったリズムをデータ化することができる。<br><br>
mr: रिदम मेकर ब्लॉक ड्रम मशीन तयार करण्यासाठी एक साधन उघडतो.
pt: O bloco Criador de Ritmo abre uma ferramenta para criar baterias eletrônicas
te: రిదాన్ మేకర్ బ్లాక్ డ్రమ్ మెషీన్లను రచించడానికి టూల్ తెరిచివేస్తుంది.
tr: ritim yapıcı bloğu davul makineleri oluşturmak için bir araç açar
ur: Rhythm Maker بلاک ڈرم مشینیں بنانے کے لیے ایک ٹول کھولتا ہے۔
zh_cn: Rhythm Maker 块打开一个制作鼓机的工具。

source: G major scale
es: escala mayor G
fr: gamme de sol majeur
hi: जी मेजर स्केल
ja: Gメジャー
mr: जी मेजर स्केल
pt: escala G maior
te: జి మేజర్ స్కేల్
tr: sol majör gam
ur: جی بڑے پیمانے پر
zh_cn: G大调音阶

source: C major scale
es: escala mayor C
fr: gamme de do majeur
hi: सी मेजर स्केल
ja: Cメジャー
mr: सी मेजर स्केल
pt: escala C maior
te: సి మేజర్ స్కేల్
tr: do majör gam
ur: سی بڑے پیمانے پر
zh_cn: C大调音阶

source: The Phrase Maker block opens a tool to create musical phrases.
es: El bloque Matriz de tono y tiempo abre una herramienta para crear frases musicales.
fr: Le bloc Créateur de phrases ouvre un outil pour créer des phrases musicales.
hi: फ्रेज मेकर ब्लॉक एक उपकरण खोलता है जिससे संगीतिक वाक्य बनाए जा सकते हैं।
ja: <h2>フレーズメーカーブロック</h2><br>フレーズを作るためのテーブルを表示する。作ったフレーズをデータ化することができる。<br><br>★フレーズとは<br>ひとまとまりの音楽。<br><br>
mr: फ्रेज मेकर ब्लॉक संगीत वाक्य तयार करण्यासाठी एक साधन उघडतो.
pt: O bloco Criar Frases abre uma ferramenta para criar frases musicais.
te: ఫ్రేస్ మేకర్ బ్లాక్ సంగీత ఫ్రేస్లను రచించడానికి టూల్ తెరిచివేస్తుంది.
tr: phrase maker bloğu müzik cümleleri oluşturmak için bir araç açar
ur: جملہ بنانے والا بلاک میوزیکل جملے بنانے کے لیے ایک ٹول کھولتا ہے۔
zh_cn: Phrase Maker 块打开一个创建音乐短语的工具。

source: phrase maker
es: matriz de tono en tiempo
fr: créateur de phrases
hi: वाक्य निर्माता
ja: フレーズメーカー
mr: फ्रेज मेकर
pt: criador de frase
te: ఫ్రేస్ మేకర్
tr: ifade oluşturucu
ur: جملہ بنانے والا
zh_cn: 短语生成器

source: You must have at least one pitch block and one rhythm block in the matrix.
es: Debe tener al menos un bloque de tono y un bloque de ritmo en la matriz.
fr: Vous devez avoir au moins un bloc de hauteur et un bloc de rythme dans la matrice.
hi: मैट्रिक्स में कम से कम एक पिच ब्लॉक और एक रिदम ब्लॉक होना चाहिए।
ja: フレーズメーカーには、音の高さブロックと音符ブロックを組み合わせてください。
mr: तुमच्याकडे मॅट्रिक्समध्ये किमान एक पिच ब्लॉक आणि एक रिदम ब्लॉक असणे आवश्यक आहे.
pt: Você deve ter pelo menos um bloco de tom e um bloco de ritmo na matriz.
te: మీరు మ్యాట్రిక్స్లో కనీసం ఒక పిచ్ బ్లాక్ మరియు ఒక రిదాన్ బ్లాక్ ఉండాలి.
tr: matriste en az bir perde bloğunuz ve bir ritim bloğunuz olmalıdır
ur: میٹرکس میں آپ کے پاس کم از کم ایک پچ بلاک اور ایک تال بلاک ہونا چاہیے
zh_cn: 矩阵中必须至少有一个音高块和一个节奏块。

source: The Status block opens a tool for inspecting the status of Music Blocks as it is running.
es: El bloque Estado abre una herramienta para inspeccionar el estado de Bloques de Música mientras se ejecuta.
fr: Le bloc Statut ouvre un outil pour inspecter le statut de Music Blocks en cours d'exécution.
hi: स्थिति ब्लॉक एक उपकरण खोलता है जिससे चल रहे संगीत ब्लॉक्स की स्थिति की जाँच की जा सकती है।
ja: <h2>実行じょうきょうブロック</h2><br>ブロックの実行じょうきょうをけんさくするテーブルを表示する。<br>
mr: स्टेटस ब्लॉक म्युझिक ब्लॉक्सच्या स्थितीचे तपासणी करण्यासाठी एक साधन उघडतो.
pt: O bloco Status abre uma ferramenta para inspecionar o status do Music Blocks enquanto ele está sendo executado.
te: స్టేటస్ బ్లాక్ మ్యూజిక్ బ్లాక్స్ యొక్క స్థితిని తనిఖీ చేయడానికి ఒక టూల్ తెరిచివేస్తుంది.
tr: durum bloğu
ur: اسٹیٹس بلاک میوزک بلاکس کی حالت کا معائنہ کرنے کے لیے ایک ٹول کھولتا ہے جیسا کہ یہ چل رہا ہے۔
zh_cn: Status 块打开一个工具，用于检查 Music Blocks 运行时的状态。

source: AI Music
es: Música de IA
fr: Musique IA
ja: AI音楽
mr: एआय संगीत
tr: ai müzik
ur: اے آئی میوزک

source: synth volume
es: volumen del sintetizador
fr: volume du synthé
hi: सिंथ वॉल्यूम
ja: シンセノ音量
mr: सिंथ आवाज
te: సింథ్ వాల్యూమ్
tr: synth hacmi
ur: synth حجم
zh_cn: 合成器音量

source: The Synth volume block returns the current volume of the current synthesizer.
es: El bloque de volumen sintetizador devuelve el volumen actual del sintetizador actual.
fr: Le bloc Volume du synthé renvoie le volume actuel du synthétiseur actuel.
hi: सिंथ वॉल्यूम ब्लॉक वर्तमान सिंथाइज़र की वॉल्यूम लौटाता है।
mr: सिंथ आवाज ब्लॉक वर्तमान सिंथेसायझरचा वर्तमान आवाज परतवतो.
te: సింథ్ వాల్యూమ్ బ్లాక్ ప్రస్తుత సింథెసైజర్ యొక్క ప్రస్తుత వాల్యూమ్ను తిరిగి ఇస్తుంది.
tr: ın geçerli ses seviyesini döndürür. (Bağlam: synth volume bloğu geçerli synthesizer
ur: سنتھ والیوم بلاک موجودہ سنتھیسائزر کا موجودہ حجم لوٹاتا ہے۔
zh_cn: Synth volume 块返回当前合成器的音量。

source: master volume
es: volumen maestro
fr: volume principal
hi: मास्टर वॉल्यूम
ja: マスター音量
mr: मास्टर आवाज
pt: volume mestre
te: మాస్టర్ వాల్యూమ్
tr: ana birim
ur: ماسٹر حجم
zh_cn: 主音量

source: The Master volume block returns the master volume.
es: El bloque volumen maestro devuelve nivel de volumen maestro.
fr: Le bloc Volume principal renvoie le volume principal.
hi: मास्टर वॉल्यूम ब्लॉक मास्टर वॉल्यूम लौटाता है।
mr: मास्टर व्हॉल्यूम ब्लॉक मास्टर आवाज परतवतो.
te: మాస్టర్ వాల్యూమ్ బ్లాక్ మాస్టర్ వాల్యూమ్ను తిరిగి ఇస్తుంది.
tr: ana birim bloğu ana birimi döndürür
ur: ماسٹر والیوم بلاک ماسٹر والیوم واپس کرتا ہے۔
zh_cn: Master volume 块返回主音量。

source: set synth volume
es: fijar volumen del sintetizador
fr: régler le volume du synthé
hi: सिंथ वॉल्यूम सेट करें
ja: 楽器の音量をせってい
mr: सिंथ आवाज सेट करा
pt: definir volume do sintetizador
te: సింథ్ వాల్యూమ్ ను సెట్ చేయండి.
tr: synth ses seviyesini ayarla
ur: synth حجم مقرر کریں
zh_cn: 设置合成器音量

source: synth
es: sintetizador
fr: synthé
hi: सिंथ
ja: 楽器
mr: सिंथ
pt: sintetizador
te: సింథ్
ur: سنتھ
zh_cn: 合成器

source: Setting volume to 0.
es: Ajuste el volumen a 0
fr: Régler le volume à 0.
hi: वॉल्यूम को 0 पर सेट करना।
ja: 音量を「0」にせっていします。
mr: आवाज शून्य करण्यात आला.
pt: Configurando o volume para 0.
te: వాల్యూమ్ను 0 కి సెట్ చేస్తోంది.
tr: ses seviyesini 0'a ayarlama
ur: والیوم کو 0 پر سیٹ کرنا۔
zh_cn: 音量设置为0。

source: Synth not found
es: No se encuentra el sintetizador.
fr: Synthé non trouvé
hi: सिंथ नहीं मिला
ja: シンセが見つかりません
mr: सिंथ मिळाला नाही
pt: sintetizador não encontrado
te: సింథ్ కనబడలేదు
tr: synth bulunamadı
ur: سنتھ نہیں ملا
zh_cn: 未找到合成器

source: set drum volume
es: filar volumen del tambor
fr: régler le volume du tambour
hi: ड्रम वॉल्यूम सेट करें
ja: ドラムの音量をせってい
mr: ड्रम आवाज सेट करा
pt: definir volume da bateria
te: డ్రం వాల్యూమ్ ను సెట్ చేయండి
tr: davul sesini ayarla
ur: ڈھول کا حجم مقرر کریں
zh_cn: 设置鼓音量

source: The Set synth volume block will change the volume of a particular synth,
es: El bloque Ajuste volumen del sintetizador cambiará el volumen de un sintetizador particular,
fr: Le bloc Régler le volume du synthé changera le volume d'un synthé particulier,
hi: सेट सिंथ वॉल्यूम ब्लॉक एक विशिष्ट सिंथ की वॉल्यूम बदलेगा,
ja: <h2>楽器の音量をせっていブロック</h2><br>ギター、ヴァイオリン、スネアドラムなどの楽器の音量をせっていする。
mr: सेट सिंथ वॉल्यूम ब्लॉक एका विशिष्ट सिंथचा आवाज बदलेल,
pt: O bloco Definir volume do sintetizador mudará o volume de um sintetizador específico
te: సెట్ సింథ్ వాల్యూమ్ బ్లాక్ అంగీకరించే సింథెసైజర్ యొక్క వాల్యూమ్ మార్చిపెడతాయి,
ur: سیٹ سنتھ والیوم بلاک کسی خاص سنتھ کا حجم بدل دے گا،
zh_cn: 设置合成器音量模块会改变特定合成器的音量，
