Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: change in pitch
es: cambio en tono
fr: changement de hauteur
hi: स्वर में परिवर्तन
ja: 音程の違い
mr: स्वरातील बदल
pt: mudança no tom
te: ప్రస్తుత స్వరాన్ని మునుపటి స్వరంలో మారుకోవడానికి అనుమానాంకాల మార్గాన మార్గాన మారుతుంది.
tr: perde değişikliği
ur: پچ میں تبدیلی
zh_cn: 音高变化

source: The Change in pitch block is the difference (in half steps) between the current pitch being played and the previous pitch played.
es: El cambio en el bloque de tono es la diferencia (en medio pasos) entre el tono actual que se está reproduciendo y el tono anterior.
fr: Le bloc Changement de hauteur est la différence (en demi-tons) entre la hauteur actuelle jouée et la hauteur précédente jouée.
hi: चेंज इन पिच ब्लॉक वह अंतर है (हैफ स्टेप में) जो वर्तमान पिच बजा रहा है और पिछले पिच बजा रहा है।
ja: <em>音程の違い</em>ブロックは現在に鳴らされている音高と現在のちょうど前に鳴らされている音高（半音の値で）の違いです。
mr: चेंज इन पिच ब्लॉक हे चालू स्वर आणि मागील स्वर यांच्यातील फरक (अर्ध्या पायर्‍यांमध्ये) आहे.
pt: Mudar no bloco de tom é a diferença (em meio passo) entre o tom atual que está sendo tocado e o tom anterior executado.
te: ప్రస్తుత ప్లే చేయబడుతున్న స్వరాన్ని మునుపటి ప్లే చేయబడిన స్వరాన్ని (అంశాలలో) వ్యత్యాసం ఉంది.
tr: perde bloğundaki değişim
ur: پچ بلاک میں تبدیلی موجودہ پچ اور کھیلی گئی پچھلی پچ کے درمیان فرق (آدھے مراحل میں) ہے۔
zh_cn: 音高变化块表示当前播放音高与之前播放音高之间的半音差异。

source: scalar change in pitch
es: cambio en tono escalar
fr: changement scalaire de hauteur
hi: स्केलर स्वर में परिवर्तन
ja: 音階のよって音程の違い
mr: स्वरातील स्केलर बदल
te: ధ్వనిలో స్కాలర్ మారుతోంది
tr: perdede skaler değişim
ur: پچ میں اسکیلر تبدیلی
zh_cn: 音阶音高变化

source: pitch number
es: número de tono
fr: numéro de hauteur
hi: स्वर संख्या
ja: 音の高さを数で表示
mr: स्वर संख्या
pt: número do tom
te: పిచ్ సంఖ్య
tr: perde numarası
ur: پچ نمبر
zh_cn: 音高编号

source: The Pitch number block is the value of the pitch of the note currently being played.
es: El bloque Número de tono es el valor del tono de la nota que se está reproduciendo actualmente.
fr: Le bloc Numéro de hauteur est la valeur de la hauteur de la note actuellement jouée.
hi: पिच नंबर ब्लॉक वह मूल्य है जो वर्तमान में बजा रहे नोट के स्वर का है।
ja: <h2>音の高さを数で表示ブロック</h2><br>音の高さを数で表示する。<br>
mr: पिच नंबर ब्लॉक सध्या प्ले होत असलेल्या नोटचा पिचचा मूल्य आहे.
pt: O bloco Tom número é o valor do tom da nota atualmente sendo reproduzida.
te: పిచ్ సంఖ్య బ్లాక్ ప్రస్తుతం ప్లే చేయబడుచున్న నోటు యొక్క పిచ్ యొక్క విలువ ఉంది.
tr: perde numarası bloğu o anda çalınmakta olan notanın perdesinin değeridir
ur: پچ نمبر بلاک اس وقت چلائے جانے والے نوٹ کی پچ کی قیمت ہے۔
zh_cn: 音高编号块表示当前正在播放的音符的音高值。

source: pitch in hertz
es: tono en hertz
fr: hauteur en hertz
hi: हर्ट्ज में स्वर
ja: 音の高さをヘルツで表示
mr: हर्ट्जमधील स्वर
pt: tom em hertz
tr: hertz cinsinden adım
ur: ہرٹز میں پچ
zh_cn: 以赫兹表示的音高

source: The Pitch in Hertz block is the value in Hertz of the pitch of the note currently being played.
es: El bloque Tono en Hertz es el valor en hercios del tono de la nota que se está reproduciendo actualmente.
fr: Le bloc Hauteur en Hertz est la valeur en Hertz de la hauteur de la note actuellement jouée.
hi: पिच इन हर्ट्ज ब्लॉक वर्तमान में बज रहे नोट के स्वर का हर्ट्ज में मूल्य है।
ja: <h2>音の高さをヘルツで表示ブロック</h2><br>音の高さをヘルツで表示する。<br>たとえば、オクターヴが４のラの音は、４４０ヘルツというすうちで表すことができる。<br><br>★ヘルツとは<br>音の高さを表す周波数。<br>★周波数とは<br>音が１秒間に何回しんどうするかを表すすうち。周波数が高い（すうちが大きい）ほど、音が高くなる。<br><br>
mr: पिच इन हर्ट्ज ब्लॉक सध्या प्ले होत असलेल्या नोटचा पिचचा हर्ट्जमधील मूल्य आहे.
pt: O bloco Tom em Hertz é o valor em Hertz do tom da nota atualmente sendo tocada.
te: పిచ్ హెర్ట్జ్‌లో
tr: hertz bloğundaki perde
ur: ہرٹز بلاک میں پچ اس وقت چلائے جانے والے نوٹ کی پچ کی ہرٹز میں قدر ہے۔
zh_cn: 以赫兹表示的音高块是当前正在播放音符的赫兹值。

source: current pitch
es: tono actual
fr: hauteur actuelle
hi: वर्तमान स्वर
ja: 現代の音の高さ
mr: सध्याचा स्वर
te: ప్రస్తుత పిచ్
tr: mevcut perde
ur: موجودہ پچ
zh_cn: 当前音高

source: The Current Pitch block is used with the Pitch Converter block. In the example above, current pitch, sol 4, is displayed as 392 hertz.
es: El bloque de tono actual se utiliza con el bloque convertidor de tono. En el ejemplo anterior, el tono actual, sol 4, se muestra como 392 hercios.
fr: Le bloc Hauteur actuelle est utilisé avec le bloc Convertisseur de hauteur. Dans l'exemple ci-dessus, la hauteur actuelle, sol 4, est affichée comme 392 hertz.
mr: करंट पिच ब्लॉकचा वापर पिच कन्व्हर्टर ब्लॉकसह केला जातो. वरच्या उदाहरणात, सध्याचा स्वर, सोल 4, 392 हर्ट्ज म्हणून प्रदर्शित केला आहे.
tr: geçerli hatve bloğu hatve dönüştürücü bloğuyla birlikte kullanılır
ur: کرنٹ پچ بلاک کو پچ کنورٹر بلاک کے ساتھ استعمال کیا جاتا ہے۔ اوپر کی مثال میں، موجودہ پچ، سول 4، 392 ہرٹز کے طور پر ظاہر کی گئی ہے۔
zh_cn: 当前音高块与音高转换块一起使用。上述示例中，当前音高 sol 4 显示为 392 赫兹。

source: This block converts the pitch value of the last note played into different formats such as hertz, letter name, pitch number, et al.
es: Este bloque convierte el valor de tono de la última nota tocada en diferentes formatos como hertz, nombre de letra, número de tono, etc.
fr: Ce bloc convertit la valeur de la hauteur de la dernière note jouée en différents formats tels que hertz, nom de lettre, numéro de hauteur, etc.
hi: यह ब्लॉक बजाए गए आखिरी नोट के स्वर मूल्य को हर्ट्ज, अक्षर नाम, स्वर संख्या, आदि के रूप में परिवर्तित करता है।
mr: हा ब्लॉक शेवटच्या प्ले केलेल्या नोटच्या स्वर मूल्याला हर्ट्ज, अक्षर नाव, स्वर संख्या इत्यादी वेगवेगळ्या स्वरूपात रूपांतरित करतो.
tr: bu blok çalınan son notanın perde değerini hertz
ur: یہ بلاک آخری نوٹ کی پچ ویلیو کو مختلف فارمیٹس میں بدلتا ہے جیسے ہرٹز، لیٹر کا نام، پچ نمبر، وغیرہ۔
zh_cn: 此块将最后播放音符的音高值转换为赫兹、字母名、音高编号等多种格式。

source: alphabet
es: alfabeto
hi: वर्णमाला
ja: アルファベット
mr: वर्णमाला
te: అక్షరము
tr: alfabe
ur: حروف تہجی
zh_cn: 字母表

source: letter class
es: clase de alfabeto
fr: classe de lettres
hi: अक्षर वर्ग
ja: アルファベット・クラス
mr: अक्षर वर्ग
te: అక్షర వర్గం
tr: harf sınıfı
ur: خط کی کلاس
zh_cn: 字母类别

source: solfege class
es: clase de solfege
fr: classe de solfège
hi: सोलफेज वर्ग
ja: 階名
mr: सोलफेज वर्ग
te: సొల్ఫేజ్ వర్గం
tr: solfej sınıfı
ur: سالفج کلاس
zh_cn: 视唱类别

source: staff y
es: musical y
fr: portée y
hi: स्टाफ वाई
ja: 音部記号のｙ座標
mr: स्टाफ वाय
te: స్టాఫ్ Y
tr: personel y
ur: عملہ
zh_cn: 五线谱Y坐标

source: solfege syllable
es: sílaba solfege
fr: syllabe de solfège
hi: सोलफेज सिलेबल
ja: 階名（ド、レ、ミ）
mr: सोलफेज अक्षर
te: సొల్ఫేజ్ అక్షరము
tr: solfej hecesi
ur: ٹھوس حرف
zh_cn: 视唱音节

source: pitch class
es: clase de tono
fr: classe de hauteur
hi: स्वर वर्ग
ja: ピッチ・クラス
mr: स्वर वर्ग
te: పిచ్ వర్గం
tr: perde sınıfı
ur: پچ کلاس
zh_cn: 音高类别

source: scalar class
es: clase de escala
fr: classe scalaire
hi: स्केलर वर्ग
ja: 音階クラス
mr: स्केलर वर्ग
te: స్కాలర్ వర్గం
tr: skaler sınıf
ur: اسکیلر کلاس
zh_cn: 标量类别

source: nth degree
es: nth grado
fr: nième degré
hi: एनथ डिग्री
ja: ピッチ度
mr: एनथ डिग्री
te: ఎన్తో డిగ్రీ
tr: n'inci derece
ur: نویں ڈگری
zh_cn: 第n度音

source: pitch to shade
es: tono a la sombra
fr: hauteur à nuance
hi: स्वर को छाया में
ja: 音の高さををシェードに
mr: छटेत स्वर
te: పిచ్ ను షేడ్ చేయి
tr: gölgelendirmek için zift
ur: سایہ کرنے کے لئے پچ
zh_cn: 音高到阴影

source: pitch to color
es: tono a color
fr: hauteur à couleur
hi: स्वर को रंग में
ja: 音の高さを色に
mr: रंगात स्वर
te: పిచ్ ను రంగుకు
tr: renk için perde
ur: رنگ پر پچ
zh_cn: 音高到颜色

source: set pitch number offset
es: fijar offset del número de tono
fr: fixer le décalage du numéro de hauteur
hi: पिच नंबर ऑफसेट सेट करें
ja: 音高の数字を初期化
mr: स्वर संख्या ऑफसेट सेट करा
pt: definir número do tom
te: పిచ్ సంఖ్య ఆఫ్‌సెట్ సెట్ చేయండి
tr: perde numarası ofsetini ayarla
ur: سیٹ پچ نمبر آفسیٹ
zh_cn: 设置音高编号偏移

source: The Set pitch number offset block is used to set the offset for mapping pitch numbers to pitch and octave.
es: El bloque Fijar del número de tono establecido se usa para establecer el desplazamiento para asignar números de tono a tono y octava.
fr: Le bloc Fixer le décalage du numéro de hauteur est utilisé pour définir le décalage pour mapper les numéros de hauteur à la hauteur et à l'octave.
hi: सेट पिच नंबर ऑफसेट ब्लॉक का उपयोग पिच और ऑक्टेव के मैपिंग के लिए ऑफसेट सेट करने के लिए किया जाता है।
mr: सेट पिच नंबर ऑफसेट ब्लॉकचा वापर पिच नंबर पिच आणि ऑक्टेव्हवर मॅप करण्यासाठी ऑफसेट सेट करण्यासाठी केला जातो.
pt: O bloco de deslocamento Define número do tom é usado para definir o deslocamento para mapear os números de tom para afinação e oitava.
te: పిచ్ సంఖ్యలను పిచ్ మరియు ఆక్టేవ్‌కు మాపించడానికి ఆఫ్‌సెట్‌ను సెట్ చేయడానికి Set pitch number offset బ్లాక్ ఉపయోగిస్తారు.
tr: set pitch number offset bloğu
ur: سیٹ پچ نمبر آفسیٹ بلاک کا استعمال پچ اور آکٹیو میں پچ نمبروں کی نقشہ سازی کے لیے آفسیٹ سیٹ کرنے کے لیے کیا جاتا ہے۔
zh_cn: 设置音高编号偏移块用于设置将音高编号映射到音高和八度的偏移量。

source: name2
es: nombre
fr: nom2
ja: 名前
pt: nome2
te: పేరు2
ur: نام 2
zh_cn: 名称2

source: number to pitch
es: número a tono
fr: numéro à hauteur
hi: संख्या से पिच
ja: 数字を音名へ
mr: संख्या ते स्वर
pt: número para o tom
te: నంబర్ ను పిచ్ కి మార్చండి
tr: atış için numara
ur: پچ کرنے کے لئے نمبر
zh_cn: 数字转音高

source: The Number to pitch block will convert a pitch number to a pich name.
es: El bloque Número a tono convertirá un número de tono en un nombre pich.
mr: नंबर टू पिच ब्लॉक पिच नंबरला पिच नावात रूपांतरित करेल.
tr: number to pitch bloğu bir perde numarasını bir pich ismine dönüştürecektir
ur: نمبر ٹو پچ بلاک پچ نمبر کو پچ نام میں بدل دے گا۔
zh_cn: 数字转音高块将音高编号转换为音高名称。

source: number to octave
es: número a octava
fr: numéro à octave
hi: संख्या से ऑक्टेव
ja: 数値をオクターヴ表記へ
mr: संख्या ते सप्तक
pt: número para a oitava
te: నంబర్ ను ఒక్టేవ్‌కి మార్చండి
tr: sayıdan oktava
ur: نمبر سے آکٹیو
zh_cn: 数字转八度

source: The Number to octave block will convert a pitch number to an octave.
es: El bloque Número a octava convertirá un número de tono en una octava.
fr: Le bloc Numéro à octave convertira un numéro de hauteur en une octave.
hi: नंबर टू ऑक्टेव ब्लॉक एक पिच नंबर को एक ऑक्टेव में परिवर्तित करेगा।
mr: नंबर टू ऑक्टेव्ह ब्लॉक पिच नंबरला ऑक्टेव्हमध्ये रूपांतरित करेल.
pt: O bloco Número para oitava irá converter um número de tom em uma oitava.
te: Number to octave బ్లాక్ ఒక పిచ్ సంఖ్యను ఒక్టేవ్‌కు మార్చగలిగేది.
tr: number to octave bloğu bir perde numarasını bir oktava dönüştürecektir
ur: نمبر ٹو آکٹیو بلاک پچ نمبر کو آکٹیو میں بدل دے گا۔
zh_cn: 数字转八度块将音高编号转换为八度。

source: y to pitch
es: y para tono
fr: y à hauteur
hi: वाय को पिच
ja: 音の高さをy座に
mr: वाय ते स्वर
te: Y ను పిచ్ కి
tr: y atış için
ur: y پچ کرنے کے لئے
zh_cn: y坐标转音高

source: Y to pitch block will convert a staff y position to corresponding pitch notation.
es: El bloque Y a tono convertirá una posición de pentagrama y a la notación de tono correspondiente.
fr: Le bloc Y à hauteur convertira une position y de portée en notation de hauteur correspondante.
hi: वाय टू पिच ब्लॉक एक स्टाफ वाय स्थिति को संबंधित पिच संकेत में परिवर्तित करेगा।
mr: वाय टू पिच ब्लॉक स्टाफ वाय स्थितीला संबंधित पिच नोटेशनमध्ये रूपांतरित करेल.
te: Y to pitch బ్లాక్ స్టాఫ్ Y స్థానంను సరిపోయిన పిచ్ సారాంశంగా మార్చిపోతుంది.
tr: y to pitch bloğu
ur: Y سے پچ بلاک عملے کی پوزیشن کو متعلقہ پچ اشارے میں بدل دے گا۔
zh_cn: Y 到音高模块会将五线谱的 Y 位置转换为对应的音高符号。

source: accidental selector
es: selector accidental
fr: sélecteur d'altération
hi: अक्सीडेंटल सिलेक्टर
mr: अकस्मात निवडक
te: అక్షిడెంటల్ సెలెక్టర్
tr: kazara seçici
ur: حادثاتی سلیکٹر
zh_cn: 变音符号选择器

source: The Accidental selector block is used to choose between double-sharp, sharp, natural, flat, and double-flat.
es: El bloque Selector de accidental se usa para elegir entre doble filo, agudo, natural, plano y doble plano.
fr: Le bloc Sélecteur d'altération est utilisé pour choisir entre double-dièse, dièse, naturel, bémol et double-bémol.
hi: एक्सीडेंटल सिलेक्टर ब्लॉक का उपयोग डबल-शार्प, शार्प, नैचुरल, फ्लैट, और डबल-फ्लैट के बीच चयन करने के लिए किया जाता है।
ja: <em>変化記号セレクター</em>ブロックはダブルシャープ（重嬰）、シャープ(嬰)、ナチュラル(本位)、フラット(変)、ダブルフラット（重変）から選ぶことができます。
mr: अकस्मात निवडक ब्लॉकचा वापर डबल-शार्प, शार्प, नॅचरल, फ्लॅट आणि डबल-फ्लॅटमध्ये निवडण्यासाठी केला जातो.
pt: O bloco seletor Acidental é usado para escolher entre duplo-afinado, afinado, natural, plano e duplo plano.
te: అక్షిడెంటల్ సెలెక్టర్ బ్లాక్ ద్విగుభార్పణాతి, శార్ప్, స్వాభావికం, ఫ్లాట్, మరియు ద్విగుభార్పణాతి మధ్య ఎంచుకోవడానికి ఉపయోగిస్తారు.
ur: حادثاتی سلیکٹر بلاک کا استعمال ڈبل تیز، تیز، قدرتی، فلیٹ اور ڈبل فلیٹ کے درمیان انتخاب کرنے کے لیے کیا جاتا ہے۔
zh_cn: 变音符号选择器块用于选择重升号、升号、还原号、降号和重降号。

source: Pitch can be specified in terms of ni dha pa ma ga re sa.
es: El tono puede especificarse en términos de ni dha pa ma ga re sa.
fr: La hauteur peut être spécifiée en termes de ni dha pa ma ga re sa.
hi: पिच को नी धा पा मा ग रे सा के रूप में निर्दिष्ट किया जा सकता है।
ja: 音の高さを、「sa、re、ga、ma、pa、dha、ni」の７つのインドのソルフェージュでせっていする。
mr: स्वराला नी धा पा मा ग रे सा म्हणून निर्दिष्ट केले जाऊ शकते.
pt: O tom pode ser especificado em termos de ni dha pa ga ga sa sa.
ur: پچ کو نی دھا پا ما گا ری سا کے لحاظ سے بیان کیا جا سکتا ہے۔
zh_cn: 音高可以用 ni dha pa ma ga re sa 表示。

source: Pitch can be specified in terms of C D E F G A B.
es: El tono puede especificarse en términos de C D E F G A B.
fr: La hauteur peut être spécifiée en termes de C D E F G A B.
hi: पिच को सी डी ई एफ जी ए बी के रूप में निर्दिष्ट किया जा सकता है।
ja: <h2>音の高さブロック</h2><br>音の高さを、CDEFGABの７つのアルファベットでせっていする。たとえば、ドならばＣ、レならばＤであらわされる。
mr: स्वराला सी डी ई एफ जी ए बी म्हणून निर्दिष्ट केले जाऊ शकते.
pt: O tom pode ser especificado em termos de C D E F G A B.
tr: perde c d e f g a b cinsinden belirtilebilir
ur: پچ کی وضاحت C D E F G A B کے لحاظ سے کی جا سکتی ہے۔
zh_cn: 音高可以用 C D E F G A B 表示。

source: solfege
fr: solfège
hi: सोल्फेज
ja: ソルファ
mr: सोलफेज
tr: solfej
ur: سولفیج
zh_cn: 视唱法

source: Pitch can be specified in terms of do re mi fa sol la ti.
es: El tono puede especificarse en términos de do re mi fa sol la si.
fr: La hauteur peut être spécifiée en termes de do re mi fa sol la si.
hi: पिच को डो रे मि फा सोल ला टी के रूप में निर्दिष्ट किया जा सकता है।
ja: <h2>音の高さブロック</h2><br>音の高さを、ド、レ、ミ、ファ、ソ、ラ、シの７つのソルフェージュでせっていする。
mr: स्वराला डो रे मी फा सोल ला टी म्हणून निर्दिष्ट केले जाऊ शकते.
pt: O Tom pode ser especificado em termos de do re mi fá sol la si.
tr: perde do re mi fa sol la ti cinsinden belirtilebilir
ur: پچ کو دوبارہ میل فی سول لا ٹائی کے لحاظ سے بیان کیا جاسکتا ہے۔
zh_cn: 音高可以用 do re mi fa sol la ti 表示。

source: The Invert block rotates any contained notes around a target note.
es: El bloque Invertir gira cualquier nota contenida alrededor de una nota de destino.
fr: Le bloc Inverser fait pivoter toutes les notes contenues autour d'une note cible.
hi: इनवर्ट ब्लॉक एक लक्ष्य नोट के चारों ओर शामिल नोट को घुमाता है।
mr: इन्व्हर्ट ब्लॉक कोणत्याही समाविष्ट नोट्सला लक्ष्य नोटच्या भोवती फिरवतो.
pt: O bloco Inversor rotaciona todas as notas contidas em torno de uma nota de destino.
tr: invert bloğu
ur: الٹا بلاک کسی بھی موجود نوٹ کو ٹارگٹ نوٹ کے گرد گھماتا ہے۔
zh_cn: 反转块将包含的音符绕目标音符旋转。

source: Invert
es: Invertir
fr: Inverser
hi: उलटाएं
ja: 転回を
mr: इन्व्हर्ट
pt: Inverter
te: అదనపు చేయు
tr: Ters Çevirme
ur: الٹا
zh_cn: 反转

source: invert (odd)
es: invertir (impar)
fr: inverser (impair)
hi: इनवर्ट (विषम)
ja: 転回を （奇数）
mr: इन्व्हर्ट (विषम)
pt: inverter (ímpar)
te: వామకాలానికి రోటేట్ చేస్తుంది (అసమం)
tr: invert (odd) (Bağlam
ur: الٹا (طاق)
zh_cn: 反转（奇数）

source: invert (even)
es: invertir (par)
fr: inverser (pair)
hi: इनवर्ट (सम)
ja: 転回を （偶数）
mr: इन्व्हर्ट (सम)
pt: inverter (par)
te: వామకాలానికి రోటేట్ చేస్తుంది (సమం)
tr: invert (çift) (Bağlam
ur: الٹا (بھی)
zh_cn: 反转（偶数）

source: register
es: registro
fr: registre
hi: रजिस्टर
ja: 登録
mr: नोंदणी करा
pt: registrador
te: రిజిస్టర్
ur: رجسٹر کریں
zh_cn: 音区

source: The Register block provides an easy way to modify the register (octave) of the notes that follow it.
es: El bloque Registro proporciona una manera fácil de modificar el registro (octava) de las notas que lo siguen.
fr: Le bloc Registre offre un moyen facile de modifier le registre (octave) des notes qui le suivent.
hi: रजिस्टर ब्लॉक निर्दिष्ट किए गए नोट के रजिस्टर (ऑक्टेव) को संशोधित करने का एक आसान तरीका प्रदान करता है।
mr: नोंदणी ब्लॉक त्यानंतरच्या नोट्सच्या नोंदणी (सप्तक) मध्ये बदल करण्याचा सोपा मार्ग प्रदान करतो.
pt: O bloco Registrador fornece uma maneira fácil de modificar o registro (oitava) das notas que o seguem.
te: రిజిస్టర్ బ్లాక్ అనుసరించే గానాల రిజిస్టర్ (ఆక్టేవ్) పరిష్కరించడానికి సులభ మార్గానే అందిస్తుంది.
tr: ını (oktav) değiştirmek için kolay bir yol sağlar. (Bağlam: register bloğu, kendisini takip eden notaların register
ur: رجسٹر بلاک ان نوٹوں کے رجسٹر (آکٹیو) میں ترمیم کرنے کا ایک آسان طریقہ فراہم کرتا ہے جو اس کی پیروی کرتے ہیں۔
zh_cn: 移调块提供了一种简单的方法来修改后续音符的音区（八度）。

source: 50 cents
es: 50 centavos
mr: 50 सेंट
tr: 50 sent
ur: 50 سینٹ
zh_cn: 50分音

source: The Semi-tone transposition block will shift the pitches contained inside Note blocks up (or down) by half steps.
es: El bloque de transposición de semitono desplazará los pasos contenidos dentro de los bloques de notas hacia arriba (o hacia abajo) medio pasos.
fr: Le bloc Transposition de demi-ton déplacera les hauteurs contenues dans les blocs de note vers le haut (ou vers le bas) par demi-tons.
hi: सेमी-टोन स्थानांतरण ब्लॉक नोट ब्लॉक्स में शामिल पिच को आधे कदम से ऊपर (या नीचे) करेगा।
ja: <em>半音で移調</em>ブロックは<em>音符</em>の中に入っている音高を上（または下）に、特定されている<em>数字</em>の値によって、半音ずつ移動します。
mr: सेमी-टोन ट्रान्सपोजिशन ब्लॉक नोट ब्लॉकमधील स्वरांना अर्ध्या पायर्‍यांनी वर (किंवा खाली) शिफ्ट करेल.
pt: O bloco de transposição de Semi-tom mudará os passos contidos dentro dos blocos de Notas para cima (ou para baixo) em intervalos de meio tom.
te: సెమి-టోన్ ట్రాన్స్పోజిషన్ బ్లాక్ నోట్ బ్లాక్‌లో ఉండే పిచ్లను అప్ (లేదా) అడుగుపెడతాయి.
ur: سیمی ٹون ٹرانسپوزیشن بلاک نوٹ بلاکس کے اندر موجود پچوں کو آدھے مراحل سے اوپر (یا نیچے) منتقل کرے گا.
zh_cn: 半音移调块会将Note块内的音高向上（或向下）移动半音。

source: In the example shown above, sol is shifted up to sol#.
es: En el ejemplo que se muestra arriba, sol se desplaza hasta sol#.
fr: Dans l'exemple montré ci-dessus, sol est déplacé vers sol#.
hi: ऊपर दिखाए गए उदाहरण में, सोल को सोल# की ओर स्थानांतरित किया गया है।
ja: 例の画像に<em>ソル</em>が<em>ソル#</em>に上に移動されています。
mr: वरील उदाहरणात, सोलला सोल# पर्यंत शिफ्ट केले आहे.
pt: No exemplo acima, sol é deslocado para sol#.
te: ప్రదర్శించిన ఉదాహరణలో, సోల్ ను సోల్# కి అప్ చేయబడింది.
tr: yukarıda gösterilen örnekte sol
ur: مذکورہ بالا مثال میں ، سول # تک منتقل ہوجاتا ہے۔
zh_cn: 在上例中，sol被移调到了sol#。

source: semi-tone transpose
es: transposición semitono
fr: transposer en demi-ton
hi: सेमी-टोन स्थानांतरण
ja: 半音で移調
mr: सेमी-टोन ट्रान्सपोझ
pt: transposição de semi-tom
te: సెమి-టోన్ ట్రాన్స్పోజ్
ur: نیم ٹون ٹرانسپوز
zh_cn: 半音移调

source: The Transpose by Ratio block will shift the pitches contained inside Note blocks up (or down) by a ratio
es: El bloque transponer por razón cambiará los tonos contenidos dentro de los bloques de notas hacia arriba (o hacia abajo) en una proporción
fr: Le bloc Transposer par ratio déplacera les hauteurs contenues dans les blocs de note vers le haut (ou vers le bas) par un ratio
hi: ट्रांसपोज़ बाय रेशियो ब्लॉक नोट ब्लॉक्स में शामिल पिच को एक अनुपात से ऊपर (या नीचे) करेगा
ja: 「比で移動」ブロックは 音符の中のピッチを比で移動させる。
mr: ट्रान्सपोझ बाय रेशो ब्लॉक नोट ब्लॉकमधील स्वरांना गुणोत्तराने वर (किंवा खाली) शिफ्ट करेल
tr: transpose by ratio bloğu nota bloklarının içinde bulunan perdeleri bir oran kadar yukarı (veya aşağı) kaydıracaktır (Bağlam
ur: ٹرانسپوز بائی ریشو بلاک نوٹ بلاکس کے اندر موجود پچوں کو تناسب سے اوپر (یا نیچے) شفٹ کر دے گا۔
zh_cn: 按比例移调块会将Note块内的音高按比例向上（或向下）移动。

source: transpose by ratio
es: transponer por razón
fr: transposer par ratio
hi: मात्रा के अनुसार समायोजित करें
ja: 比で移動
mr: गुणोत्तराने ट्रान्सपोझ
te: రేషియో ద్వారా ట్రాన్స్పోజ్
tr: orana göre transpoze
ur: تناسب کی طرف سے منتقل
zh_cn: 按比例移调

source: down sixth
es: sexto abajo
fr: sixte descendante
hi: डाउन सिक्स्थ
ja: 音階で6度下
mr: सहावा खाली
pt: sexta baixa
te: ఆచు లోను కుడియుతుంది
tr: altıncı sırada
ur: چھٹے نیچے
zh_cn: 下降六度

source: down third
es: tercero abajo
fr: tierce descendante
hi: डाउन थर्ड
ja: 音階で3度下
mr: तिसरा खाली
pt: terceira baixa
te: మూడు లోను కుడియుతుంది
tr: üçte bir aşağı
ur: تیسرے نیچے
zh_cn: 下降三度

source: seventh
es: séptimo
fr: septième
hi: सेवेंथ
ja: 7度の音
mr: सातवा
pt: sétima
te: ఏడవ
tr: yedinci
ur: ساتویں
zh_cn: 七度

source: sixth
es: sexto
fr: sixte
hi: सिक्सथ
ja: 6度の音
mr: सहावा
pt: sexta
te: ఆరవ
tr: altıncı
ur: چھٹا
zh_cn: 六度

source: fifth
es: quinto
fr: quinte
hi: फिफ्थ
ja: 5度の音
mr: पंचम
pt: quinta
te: ఐదవ
tr: beşinci
ur: پانچواں
zh_cn: 五度

source: fourth
es: cuarto
fr: quarte
hi: फोर्थ
ja: ４度の音
mr: चतुर्थ
pt: quarta
te: నాలవ
tr: dördüncü
ur: چوتھا
zh_cn: 四度

source: third
es: tercio
fr: tierce
hi: थर्ड
ja: 3度の音
mr: तृतीय
pt: terceira
te: మూడవ
tr: üçüncü
ur: تیسرا
zh_cn: 三度

source: second
es: segundo
fr: seconde
hi: सेकंड
ja: 2度の音
mr: द्वितीय
pt: segunda
te: రెండవ
tr: ikinci
ur: دوسرا
zh_cn: 二度

source: The Scalar transposition block will shift the pitches contained inside Note blocks up (or down) the scale.
es: El bloque Transposición escalar desplazará los tonos contenidos dentro de los bloques de notas hacia arriba (o hacia abajo) de la escala.
fr: Le bloc Transposition scalaire déplacera les hauteurs contenues dans les blocs Note vers le haut (ou vers le bas) de l'échelle.
hi: स्केलर स्थानांतरण ब्लॉक नोट ब्लॉक्स में शामिल पिच को स्केल के अनुसार ऊपर (या नीचे) करेगा।
ja: <h2>調を変えるブロック</h2><br>「音符ブロック」内の音の高さを、すべて（音階内で、せっていしたすうち分だけ）上げる、または下げる。
mr: स्केलर ट्रान्सपोजिशन ब्लॉक नोट ब्लॉक्समध्ये असलेल्या पिचेसना स्केलमध्ये वर (किंवा खाली) हलवेल.
pt: O bloco de transposição Escalar mudará os tons contidos dentro dos blocos de notas para cima (ou para baixo) da escala.
te: స్కాలర్ ట్రాన్స్పోజిషన్ బ్లాక్ నోట్ బ్లాక్ లో ఉండే పిచ్లను స్కేల్ పై అప్ (లేదా) అడుగుపెడతాయి.
tr: skaler transpozisyon bloğu
ur: اسکیلر ٹرانسپوزیشن بلاک نوٹ بلاکس کے اندر موجود پچوں کو اسکیل سے اوپر (یا نیچے) منتقل کردے گا۔
zh_cn: 音阶移调块会将Note块内的音高按音阶向上（或向下）移动。

source: In the example shown above, sol is shifted up to la.
es: En el ejemplo que se muestra arriba, el sol se desplaza hacia arriba a la.
fr: Dans l'exemple ci-dessus, sol est déplacé vers le haut à la.
hi: ऊपर दिखाए गए उदाहरण में, सोल को सोल# की ओर स्थानांतरित किया गया है।
ja: <br><br>図の例では、ソがラに、ラがシに、シがドに…と置きかえられている。<br><br>★音階とは<br>順番に並んだ音のまとまり。たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。<br>★調とは<br>中心的な役わりをはたす音と、音階の種類によって決まる、曲の感じ。中心的な役わりをはたす音だけを指すこともある。
mr: वर दाखवलेल्या उदाहरणात, सोल ला ला पर्यंत हलवले जाते.
pt: No exemplo mostrado acima, sol é deslocado até la.
te: ప్రదర్శించిన ఉదాహరణలో, సోల్ ను లా కి అప్ చేయబడింది.
tr: yukarıda gösterilen örnekte
ur: اوپر دکھائی گئی مثال میں، sol کو la تک منتقل کیا گیا ہے۔
zh_cn: 在上例中，sol被移调到la。

source: scalar transpose
es: transposición escalar
fr: transposition scalaire
hi: स्केलर स्थानांतरण
ja: 調を変える
mr: स्केलर ट्रान्सपोज
pt: transposição escalar
te: స్కాలర్ ట్రాన్స్పోజ్
tr: skaler transpoze
ur: اسکیلر منتقلی
zh_cn: 音阶移调

source: The Accidental block is used to create sharps and flats
es: El bloque Accidental se utiliza para crear objetos punzantes y pisos.
fr: Le bloc Accidentel est utilisé pour créer des dièses et des bémols
hi: अक्सीडेंटल ब्लॉक का उपयोग शार्प और फ्लैट बनाने के लिए किया जाता है
ja: <em>変化記号</em>ブロックは <em>シャープ(嬰)</em>と<em>フラット(変)</em>を決める機能です。
mr: अॅक्सिडेंटल ब्लॉक शार्प्स आणि फ्लॅट्स तयार करण्यासाठी वापरला जातो
pt: O bloco Acidental é usado para criar afinações e planos
tr: aksak blok diyez ve bemolleri oluşturmak için kullanılır
ur: ایکسیڈنٹل بلاک کو شارپس اور فلیٹ بنانے کے لیے استعمال کیا جاتا ہے۔
zh_cn: 临时升降记号块用于创建升音和降音

source: accidental override
es: anular accidental
fr: remplacement accidentel
hi: एक्सीडेंटल ओवरराइड
ja: 変化記号無視
mr: अॅक्सिडेंटल ओव्हरराइड
te: అక్షిడెంటల్ ఓవర్రైడ్
tr: kazara geçersiz kılma
ur: حادثاتی اوور رائڈ
zh_cn: 临时升降记号覆盖

source: hertz
ja: ヘルツ
te: హర్ట్జ్
ur: ہرٹز
zh_cn: 赫兹
