Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Not block is the logical not operator.
es: El bloque No es el operador lógico no.
fr: Le bloc Not est l'opérateur logique de négation.
hi: नॉट ब्लॉक तार्किक नॉट ऑपरेटर है।
mr: नॉट ब्लॉक लॉजिकल नॉट ऑपरेटर आहे.
pt: O bloco Não é o operador lógico não.
te: కాదు బ్లాక్ యొక్క మాండన్ని దాని అవిని.
tr: not bloğu mantıksal değil işlecidir
ur: بلاک منطقی نہیں آپریٹر ہے۔
zh_cn: Not 块是逻辑非运算符。

source: not
es: no
fr: non
hi: नहीं
ja: ではない
mr: नाही
pt: não
te: కాదు
tr: değil
ur: نہیں
zh_cn: 否

source: The And block is the logical and operator.
es: El bloque Y es el lógico y el operador.
fr: Le bloc And est l'opérateur logique de conjonction.
hi: एंड ब्लॉक तार्किक एंड ऑपरेटर है।
mr: आणि ब्लॉक लॉजिकल आणि ऑपरेटर आहे.
pt: O bloco E é o operador lógico e.
te: మరియు బ్లాక్ యొక్క మాండన్ని దాని అవిని.
tr: ve bloğu mantıksal ve operatörüdür
ur: اور بلاک منطقی اور آپریٹر ہے۔
zh_cn: And 块是逻辑与运算符。

source: and
es: y
fr: et
hi: और
ja: かつ
mr: आणि
pt: e
te: మరియు
tr: ve
ur: اور
zh_cn: 且

source: The Or block is the logical or operator.
es: El bloque O es el lógico o el operador.
fr: Le bloc Or est l'opérateur logique de disjonction.
mr: ऑर ब्लॉक लॉजिकल ऑर ऑपरेटर आहे.
pt: O bloco Ou é o operador lógico ou.
te: లేదా బ్లాక్ యొక్క మాండన్ని దాని అవిని.
tr: or bloğu mantıksal veya operatörüdür
ur: یا بلاک منطقی یا آپریٹر ہے۔
zh_cn: Or 块是逻辑或运算符。

source: or
es: o
fr: ou
hi: या
ja: または
mr: किंवा
pt: ou
te: లేదా
tr: veya
ur: یا
zh_cn: 或

source: The XOR block is the logical XOR operator.
es: El bloque XOR es el lógico XOR el operador.
fr: Le bloc XOR est l'opérateur logique de disjonction exclusive.
hi: XOR ब्लॉक तार्किक XOR ऑपरेटर है।
mr: XOR ब्लॉक लॉजिकल XOR ऑपरेटर आहे.
te: XOR బ్లాక్ యొక్క మాండన్ని దాని అవిని.
tr: xor bloğu mantıksal xor operatörüdür
ur: ایکس او آر بلاک منطقی ایکس او آر آپریٹر ہے۔
zh_cn: XOR 块是逻辑异或运算符。

source: The Equal block returns True if the two numbers are equal.
es: El bloque Igual devuelve verdadero si los dos números son iguales.
fr: Le bloc Equal renvoie True si les deux nombres sont égaux.
hi: इक्वल ब्लॉक यदि दो नंबर समान हैं तो True लौटाता है।
ja: <h2>しんぎブロック（等しい）</h2><br>２つのすうちをくらべて、同じすうちであるかどうかはんていする。「＝」は、２つのすうちが同じであれば「真（しん）」、同じでなければ「偽（ぎ）」という結果になる。<br><br>★しんぎブロックとは<br>「もし～ならば」などのじょうけんブロックを動かすために必要なブロック。<br>「もし～ならば」は、せいかくに表現すると、「もし～というじょうけんが正しいならば、次のブロックを実行する」という意味である。しんぎブロックは不等式などによるひかくが「正しい（真）」か、「正しくない（偽）」かの結果を表し、「もし～ならば」に続くブロックを実行するかどうか決める。
mr: इक्वल ब्लॉक दोन संख्या समान असल्यास ट्रू परत करतो.
pt: O bloco Igual retorna Verdadeiro se os dois números forem iguais.
te: ఇరువు సంఖ్యలు సరిపడితే, అప్పటికే ట్రూ.
tr: eşittir bloğu
ur: مساوی بلاک سچ ہے اگر دونوں نمبر برابر ہوں۔
zh_cn: Equal 块在两个数字相等时返回真。

source: The Not-equal-to block returns True if the two numbers are not equal to each other.
es: El bloque No igual a devuelve Verdadero si los dos números no son iguales entre sí.
fr: Le bloc Not-equal-to renvoie True si les deux nombres ne sont pas égaux.
mr: नॉट-इक्वल-टू ब्लॉक दोन संख्या एकमेकांस समान नसल्यास ट्रू परत करतो.
ur: اگر دونوں نمبر ایک دوسرے کے برابر نہیں ہیں تو بلاک نہ ہونے والے بلاک کو سچ ثابت ہوتا ہے۔
zh_cn: Not-equal-to 块在两个数字不相等时返回真。

source: The Boolean block is used to specify true or false.
es: El bloque Booleano se utiliza para especificar verdadero o falso.
fr: Le bloc Boolean est utilisé pour spécifier vrai ou faux.
hi: बूलियन ब्लॉक सच या झूठ को निर्दिष्ट करने के लिए उपयोग होता है।
mr: बूलियन ब्लॉक ट्रू किंवा फॉल्स निर्दिष्ट करण्यासाठी वापरला जातो.
pt: O bloco Booleano é usado para especificar verdadeiro ou falso.
te: బూలియన్ బ్లాక్ ట్రూ లేదా ఫాల్స్ ని నిర్దిష్టించడానికి ఉపయోగిస్తారు.
tr: boolean bloğu doğru veya yanlışı belirtmek için kullanılır
ur: بولین بلاک کو سچ یا غلط کی وضاحت کے لئے استعمال کیا جاتا ہے۔
zh_cn: Boolean 块用于指定真或假。

source: The Add-to block is used to add to the value stored in a box.
es: El bloque Agregar a se usa para agregar al valor almacenado en un cuadro.
fr: Le bloc Add-to est utilisé pour ajouter à la valeur stockée dans une boîte.
hi: एड-टू ब्लॉक का उपयोग बॉक में संग्रहित मूल्य में जोड़ने के लिए किया जाता है।
ja: <h2>数の箱（あたいを変える）</h2><br>指定した箱に、好きなすうちを足す。マイナスのすうちを使うと引き算になる。
mr: अॅड-टू ब्लॉक बॉक्समध्ये संग्रहित मूल्यात जोडण्यासाठी वापरला जातो.
pt: O bloco Adicionar-na é usado para adicionar o valor armazenado em uma caixa.
te: ఆడ్-టు బ్లాక్ బాక్స్లో నిర్వచించబడిన విలువకు కలిగి ఉండటానికి ఉపయోగిస్తారు.
ur: ایڈ ٹو بلاک کا استعمال باکس میں ذخیرہ شدہ قیمت میں شامل کرنے کے لئے کیا جاتا ہے۔
zh_cn: Add-to 块用于对盒子中存储的值进行加法。

source: It can also be used with other blocks such as Color and Pen size.
es: También se puede utilizar con otros bloques, como el color, el tamaño de la pluma.
fr: Il peut également être utilisé avec d'autres blocs tels que Couleur et Taille du stylo.
hi: इसे कलर और पेन साइज़ जैसे अन्य ब्लॉक्स के साथ भी उपयोग किया जा सकता है।
ja: <br><br>マイナスの数値を使うと引き算になる。
mr: ते कलर आणि पेन साईज सारख्या इतर ब्लॉक्ससह देखील वापरले जाऊ शकते.
te: ఇది కలర్ మరియు పెన్ పరిమాణం ఉండాలి మరియు ఇతర బ్లాక్లతో కూడా ఉపయోగించి ఉండవచ్చు.
tr: renk ve kalem boyutu gibi diğer bloklarla da kullanılabilir
ur: اسے دوسرے بلاکس جیسے رنگین اور قلم سائز کے ساتھ بھی استعمال کیا جاسکتا ہے۔
zh_cn: 它也可以与颜色和画笔大小等其他块一起使用。

source: add
es: sumar
fr: ajouter
hi: जोड़ें
ja: 足す
mr: जोडा
pt: adicionar
te: జోడించు
tr: eklemek
ur: شامل کریں
zh_cn: 加

source: to
es: para
fr: à
hi: को
ja: 箱へ
mr: करण्यासाठी / च्यापर्यत
pt: à
te: కు
tr: için
ur: کرنے کے لئے
zh_cn: 到

source: value1
es: valor
fr: valeur1
hi: मूल्य1
ja: すうち
mr: मूल्य1
pt: valor1
te: విలువ1
ur: ویلیو 1
zh_cn: 数值1

source: Block does not support incrementing.
es: Bloque no soporta incremento.
fr: Le bloc ne supporte pas l'incrémentation.
hi: ब्लॉक इक्रीमेंट को समर्थन नहीं करता है।
ja: ブロックは、増殖をサポートできません
mr: ब्लॉक वृद्धिंगत करणे समर्थित करत नाही.
pt: O bloco não suporta incrementações.
te: బ్లాక్ చేవరి సహాయపడడానికి మద్దతు ఇస్తుంది.
tr: bloğu artırmayı desteklemiyor
ur: بلاک میں اضافے کی حمایت نہیں کی جاتی ہے۔
zh_cn: 该块不支持递增操作。

source: The Add-1-to block adds one to the value stored in a box.
es: El bloque Sumar-1-a agrega uno al valor almacenado en un cuadro.
fr: Le bloc Add-1-to ajoute un à la valeur stockée dans une boîte.
hi: एड-1-टू ब्लॉक बॉक में संग्रहित मूल्य में एक जोड़ता है।
ja: <h2>数の箱（あたいを変える）</h2><br>指定した箱に、１を足す。
mr: अॅड-१-टू ब्लॉक बॉक्समध्ये संग्रहित मूल्यात एक जोडतो.
pt: O bloco Adicionar-1-na adiciona um ao valor armazenado em uma caixa.
te: ఆడ్-1-టు బ్లాక్ ఒక బాక్స్లో నిర్వచించబడిన విలువకు ఒకటి జోడిస్తుంది.
ur: ایڈ ٹو بلاک ایک باکس میں ذخیرہ شدہ قیمت میں ایک اضافہ کرتا ہے۔
zh_cn: Add-1-to 块将盒子中存储的值加一。

source: add 1 to
es: sumar 1 a
fr: ajouter 1 à
hi: में 1 जोड़ें
ja: 箱に１を足す
mr: १ जोड
pt: adicionar 1 à
te: 1 ని జోడించు
tr: 1'e ekleyin
ur: 1 شامل کریں
zh_cn: 加 1 到

source: The Subtract-1-from block subtracts one from the value stored in a box.
es: El bloque restar-1-de resta uno al valor almacenado en un cuadro.
fr: Le bloc Subtract-1-from soustrait un de la valeur stockée dans une boîte.
hi: घटक में संग्रहित मूल्य से एक कम करने के लिए Subtract-1-from ब्लॉक।
mr: सब्ट्रॅक्ट-१-फ्रॉम ब्लॉक बॉक्समध्ये संग्रहित मूल्यातून एक वजा करतो.
te: సబ్ట్రాక్ట్-1-ఫ్రమ్ బ్లాక్ ఒక బాక్స్లో నిర్వచించబడిన విలువను ఒకటి కడిగిస్తుంది.
ur: بلاک سے سب ٹریکٹ 1-ایک باکس میں ذخیرہ شدہ قیمت سے ایک کو گھٹا دیتا ہے۔
zh_cn: Subtract-1-from 块从盒子中存储的值中减去一。

source: subtract 1 from
es: restar 1 de
fr: soustraire 1 de
hi: से 1 कम करें
ja: 〜から１引く
mr: १ वजा करा
pt: subtrair 1 de
te: 1 ని తగ్గించు
tr: 1'den çıkar
ur: 1 سے گھٹائیں
zh_cn: 从中减去 1

source: The Box block returns the value stored in a box.
es: El bloque Caja devuelve el valor almacenado en una caja .
fr: Le bloc Box renvoie la valeur stockée dans une boîte.
hi: बॉक्स ब्लॉक में संग्रहित मूल्य लौटाता है।
ja: <h2>すうちブロック</h2><br>すうちブロックとして、箱のすうちを使う。
mr: बॉक्स ब्लॉक बॉक्समध्ये संग्रहित मूल्य परत करतो.
pt: O bloco Caixa retornará o valor armazenado em uma caixa.
te: బాక్స్ బ్లాక్ ఒక బాక్స్లో నిర్వచించబడిన విలువను తిరిగిస్తుంది.
tr: kutu bloğu bir kutuda saklanan değeri döndürür
ur: باکس بلاک ایک باکس میں ذخیرہ شدہ قیمت واپس کرتا ہے۔
zh_cn: Box 块返回盒子中存储的值。

source: The Store in block will store a value in a box.
es: El bloque Guardar en caja se utiliza para almacenar un valor en una caja.
fr: Le bloc Store in stockera une valeur dans une boîte.
hi: Store in ब्लॉक एक मूल्य को एक बॉक्स में संग्रहित करेगा।
ja: <h2>数の箱（あたいを入れる）</h2><br>指定した箱に、指定したすうちを入れる。
mr: स्टोर इन ब्लॉक बॉक्समध्ये एक मूल्य संग्रहित करेल.
pt: O bloco Armazenar em armazenará um valor em uma caixa.
te: స్టోర్-ఇన్ బ్లాక్ ఒక బాక్స్లో విలువను నిర్వచించడానికి ఉపయోగిస్తుంది.
tr: store in bloğu bir değeri bir kutuda depolayacaktır
ur: بلاک میں اسٹور ایک باکس میں ایک قدر ذخیرہ کرے گا۔
zh_cn: Store in 块用于将值存储到盒子中。

source: name1
es: nombre
fr: nom1
hi: नाम1
ja: 箱へ
mr: नाव1
pt: nome1
te: పేరు1
ur: نام 1
zh_cn: 名称1

source: The Box2 block returns the value stored in Box2.
es: El bloque Caja 2 devuelve el valor almacenado en caja 2.
fr: Le bloc Box2 renvoie la valeur stockée dans Box2.
hi: Box2 ब्लॉक में संग्रहित मूल्य लौटाता है।
mr: बॉक्स2 ब्लॉक बॉक्स2 मध्ये संग्रहित मूल्य परत करतो.
te: బాక్స్2 బ్లాక్ బాక్స్2లో నిర్వచించబడిన విలువను తిరిగిస్తుంది.
tr: kutu2 bloğu kutu2'de saklanan değeri döndürür
ur: باکس 2 بلاک باکس 2 میں ذخیرہ شدہ قیمت واپس کرتا ہے۔
zh_cn: Box2 块返回存储在 Box2 中的值。

source: The Store in Box2 block is used to store a value in Box2.
es: El bloque Guardar en caja2 se utiliza para almacenar un valor en caja2.
fr: Le bloc Store in Box2 est utilisé pour stocker une valeur dans Box2.
hi: Store in Box2 ब्लॉक का उपयोग Box2 में मूल्य संग्रहित करने के लिए किया जाता है।
mr: स्टोर इन बॉक्स2 ब्लॉक बॉक्स2 मध्ये एक मूल्य संग्रहित करण्यासाठी वापरला जातो.
te: స్టోర్-ఇన్ బాక్స్2 బ్లాక్ బాక్స్2లో విలువను నిర్వచించడానికి ఉపయోగిస్తుంది.
tr: store in box2 bloğu box2'de bir değer saklamak için kullanılır
ur: باکس 2 بلاک میں اسٹور کا استعمال باکس 2 میں قیمت ذخیرہ کرنے کے لئے کیا جاتا ہے۔
zh_cn: Store in Box2 块用于将值存储到 Box2 中。

source: store in box2
es: guardar en caja 2
fr: stocker dans box2
hi: बॉक्स2 में संग्रहित करें
ja: 箱２にすうちを入れる
mr: बॉक्स2 मध्ये संग्रहित करा
pt: armazenar na caixa 2
te: బాక్స్2లో నిర్వచించు
tr: kutuda sakla2
ur: باکس 2 میں اسٹور کریں
zh_cn: 存储到 box2

source: The Box1 block returns the value stored in Box1.
es: El bloque Caja 1 devuelve el valor almacenado en caja 1.
fr: Le bloc Box1 renvoie la valeur stockée dans Box1.
hi: Box1 ब्लॉक में संग्रहित मूल्य लौटाता है।
mr: बॉक्स1 ब्लॉक बॉक्स1 मध्ये संग्रहित मूल्य परत करतो.
te: బాక్స్1 బ్లాక్ బాక్స్1లో నిర్వచించబడిన విలువను తిరిగిస్తుంది.
tr: kutu1 bloğu kutu1'de depolanan değeri döndürür
ur: باکس 1 بلاک باکس 1 میں ذخیرہ شدہ قیمت واپس کرتا ہے۔
zh_cn: Box1 块返回存储在 Box1 中的值。

source: The Store in Box1 block is used to store a value in Box1.
es: El bloque Guardar en caja1 se utiliza para almacenar un valor en caja1.
fr: Le bloc Store in Box1 est utilisé pour stocker une valeur dans Box1.
hi: Store in Box1 ब्लॉक का उपयोग Box1 में मूल्य संग्रहित करने के लिए किया जाता है।
mr: स्टोर इन बॉक्स1 ब्लॉक बॉक्स1 मध्ये एक मूल्य संग्रहित करण्यासाठी वापरला जातो.
te: స్టోర్-ఇన్ బాక్స్1 బ్లాక్ బాక్స్1లో విలువను నిర్వచించడానికి ఉపయోగిస్తుంది.
tr: de bir değer saklamak için kullanılır. (Bağlam: store in box1 bloğu box1
ur: باکس 1 بلاک میں اسٹور کا استعمال باکس 1 میں قیمت ذخیرہ کرنے کے لئے کیا جاتا ہے۔
zh_cn: Store in Box1 块用于将值存储到 Box1 中。

source: store in box1
es: guardar en caja 1
fr: stocker dans box1
hi: बॉक्स1 में संग्रहित करें
ja: 箱１にすうちを入れる
mr: बॉक्स1 मध्ये संग्रहित करा
pt: armazenar na caixa 1
te: బాక్స్1లో నిర్వచించు
tr: kutuda sakla1
ur: باکس 1 میں اسٹور کریں
zh_cn: 存储到 box1

source: show dictionary
es: mostrar diccionario
fr: montrer le dictionnaire
hi: डिक्शनरी दिखाएं
ja: 辞書を表す
mr: शब्दकोश दाखवा
te: డిక్షనరీని ప్రదర్శించు
tr: sözlük göster
ur: لغت دکھائیں
zh_cn: 显示字典

source: My Dictionary
es: mi diccionario
fr: Mon dictionnaire
ja: 私の辞書
mr: माझा शब्दकोश
te: నా నిఘంటువు
tr: sözlüğüm
ur: میری لغت
zh_cn: 我的字典

source: The Dictionary block returns a dictionary.
es: El bloque Diccionario devuelve un diccionario.
fr: Le bloc Dictionary renvoie un dictionnaire.
hi: डिक्शनरी ब्लॉक एक डिक्शनरी लौटाता है।
mr: शब्दकोश ब्लॉक एक शब्दकोश परत करतो.
te: డిక్షనరీ బ్లాక్ ఒక డిక్షనరీని తరిమించిపెడతుంది.
tr: dictionary bloğu bir sözlük döndürür
ur: لغت بلاک ایک لغت واپس کرتا ہے۔
zh_cn: Dictionary 块返回一个字典。

source: The Get-dict block returns a value in the dictionary for a specified key.
es: El bloque obtener-valor devuelve un valor en el diccionario para una clave especificada.
fr: Le bloc Get-dict renvoie une valeur dans le dictionnaire pour une clé spécifiée.
hi: गेट-डिक्ट ब्लॉक एक निर्दिष्ट कुंजी के लिए डिक्शनरी में एक मूल्य लौटाता है।
mr: गेट-डिक्ट ब्लॉक निर्दिष्ट केलेल्या कीसाठी शब्दकोशातील एक मूल्य परत करतो.
te: గెట్-డిక్ట్ బ్లాక్ ఒక కేటగా డిక్షనరీలో ఒక విలువను తరిమించిపెడతుంది.
ur: گیٹ ڈکٹ بلاک ایک مخصوص کلید کے لئے لغت میں ایک قدر واپس کرتا ہے۔
zh_cn: Get-dict 块返回字典中指定键的值。

source: get value
es: obtener valor
fr: obtenir la valeur
hi: मूल्य प्राप्त करें
ja: 数価を表す
mr: मूल्य मिळवा
te: కొరకు డిక్షనరీ నుండి విలువను తరిమించు
tr: değer al
ur: قیمت حاصل کریں
zh_cn: 获取值

source: key2
es: clave
fr: clé2
hi: कुंजी2
ja: キーワード
mr: की2
te: కీ2
ur: کلید 2
zh_cn: 键2

source: key
es: clave
fr: clé
hi: कुंजी
ja: 調
mr: की
pt: chave
te: కీ
tr: anahtar
ur: کلید
zh_cn: 调

source: The Set-dict block sets a value in the dictionary for a specified key.
es: El bloque valor-adjusto establece un valor en el diccionario para una clave específica.
fr: Le bloc Set-dict définit une valeur dans le dictionnaire pour une clé spécifiée.
hi: सेट-डिक्ट ब्लॉक निर्दिष्ट कुंजी के लिए डिक्शनरी में एक मूल्य सेट करता है।
mr: सेट-डिक्ट ब्लॉक निर्दिष्ट केलेल्या कीसाठी शब्दकोशात एक मूल्य सेट करतो.
te: సెట్-డిక్ట్ బ్లాక్ ఒక కేటగా డిక్షనరీలో ఒక విలువను అమరికి ఉంచుతుంది.
ur: سیٹ ڈکٹ بلاک ایک مخصوص کلید کے لئے لغت میں ایک قدر طے کرتا ہے۔
zh_cn: Set-dict 块为字典中指定的键设置值。

source: set value
es: valor ajustado
fr: définir la valeur
hi: मूल्य सेट करें
ja: 値を設定
mr: मूल्य सेट करा
te: కొరకు డిక్షనరీలో విలువను సెట్ చేయి
tr: değer ayarla
ur: سیٹ ویلیو
zh_cn: 设置值

source: The Noise name block is used to select a noise synthesizer.
es: El bloque Nombre de ruido se utiliza para seleccionar un sintetizador de ruido.
fr: Le bloc Noise name est utilisé pour sélectionner un synthétiseur de bruit.
mr: नॉईस नेम ब्लॉक नॉईस सिंथेसायझर निवडण्यासाठी वापरला जातो.
pt: O bloco nome do Ruído é usado para selecionar um ruído de sintetizador.
te: నాయిస్ నేమ్ బ్లాక్ ఒక నాయిజ్ సింథిసైజర్ను ఎంచుకోడానికి ఉపయోగిస్తారు.
tr: gürültü adı bloğu bir gürültü sentezleyicisi seçmek için kullanılır
ur: شور کا نام بلاک شور سنتھیزائزر منتخب کرنے کے لئے استعمال ہوتا ہے۔
zh_cn: Noise name 块用于选择噪声合成器。

source: The Drum name block is used to select a drum.
es: El bloque nombre del tambor se utiliza para seleccionar un tambor.
fr: Le bloc Drum name est utilisé pour sélectionner un tambour.
ja: <h2>ドラムブロック</h2><br>ドラムの種類を変えるときに使う。クリックで、いろいろなドラムの音を選ぶことができる。
mr: ड्रम नेम ब्लॉक ड्रम निवडण्यासाठी वापरला जातो.
pt: O bloco nome da Bateria é utilizado para selecionar uma bateria.
te: డ్రమ్ నేమ్ బ్లాక్ ఒక డ్రమ్ను ఎంచుకోడానికి ఉపయోగిస్తారు.
tr: davul adı bloğu bir davul seçmek için kullanılır
ur: ڈرم نام بلاک ڈھول منتخب کرنے کے لئے استعمال ہوتا ہے۔
zh_cn: Drum name 块用于选择一个鼓。

source: The Effects name block is used to select a sound effect.
es: El bloque nombre de efectos se utiliza para seleccionar un efecto de sonido.
fr: Le bloc Effects name est utilisé pour sélectionner un effet sonore.
ja: <h2>こうかおんブロック</h2><br>こうかおんの種類を変えるときに使う。クリックで、いろいろなおもしろい音を選ぶことができる。
mr: इफेक्ट नेम ब्लॉक साउंड इफेक्ट निवडण्यासाठी वापरला जातो.
pt: O bloco de nome Efeito é utilizado para selecionar um efeito de som.
te: ఎఫెక్ట్స్ నేమ్ బ్లాక్ ఒక ధ్వని ప్రభావాన్ని ఎంచుకోడానికి ఉపయోగిస్తారు.
tr: efekt adı bloğu bir ses efekti seçmek için kullanılır
ur: اثرات کا نام بلاک صوتی اثر کو منتخب کرنے کے لئے استعمال کیا جاتا ہے۔
zh_cn: Effects name 块用于选择音效。

source: noise
es: ruido
fr: bruit
ja: ノイズ
mr: गोंगाट
pt: ruído
te: నాయిజ్
tr: gürültü
ur: شور
zh_cn: 噪音

source: The Play noise block will generate white, pink, or brown noise.
es: El bloque Ruido de reproducción generará ruido blanco, rosa o marrón.
fr: Le bloc Play noise générera du bruit blanc, rose ou brun.
mr: प्ले नॉईस ब्लॉक पांढरा, गुलाबी, किंवा तपकिरी गोंगाट निर्माण करेल.
pt: O bloco Executar ruído irá gerar um ruído branco, rosa ou marrom.
te: ప్లే నాయిజ్ బ్లాక్ వైట్, పింక్, లేదా బ్రౌన్ నాయిజ్ ను ప్రస్తుతం ఉండి.
tr: play noise bloğu beyaz
ur: پلے شور بلاک سفید ، گلابی یا بھوری رنگ کا شور پیدا کرے گا۔
zh_cn: Play noise 块将生成白噪声、粉噪声或棕噪声。

source: Replace every instance of a pitch with a drum sound.
es: Reemplace cada instancia de un tono con un sonido de tambor.
fr: Remplacer chaque instance d'une hauteur par un son de tambour.
mr: प्रत्येक पिचच्या उदाहरणाला ड्रमच्या आवाजाने बदला.
te: పిచ్ యొక్క ప్రతి సంబంధాన్ను ఒక డ్రమ్ ధ్వనితో మార్చు.
tr: bir perdenin her örneğini bir davul sesiyle değiştirin
ur: ڈھول کی آواز کے ساتھ پچ کی ہر مثال کو تبدیل کریں۔
zh_cn: 将每个音高替换为鼓声。

source: map pitch to drum
es: mapa de tono al tambor
fr: mapper la hauteur au tambour
ja: 音符をドラムに変える
mr: पिचला ड्रमच्या आवाजाशी नकाशा करा
te: పిచ్ను ఒక డ్రమ్ ధ్వనికి మ్యాప్ చేయండి
tr: perdeyi davula eşle
ur: ڈھول پر نقشہ پچ
zh_cn: 映射音高到鼓声

source: In the example above, a kick drum sound will be played instead of sol.
es: En el ejemplo anterior, se reproducirá un sonido de bombo en lugar de sol.
fr: Dans l'exemple ci-dessus, un son de grosse caisse sera joué à la place de sol.
ja: 例の画像に<em>ソル</em>の代わりに<em>キックドラム</em>が鳴らします。
mr: वरील उदाहरणात, किक ड्रमचा आवाज सोलच्या ऐवजी वाजवला जाईल.
pt: No exemplo acima, um som de bumbo será reproduzido em vez de sol.
te: ప్రాచుర్యంలో, ఒక కిక్ డ్రమ్ ధ్వని సొల్ కాదు.
tr: yukarıdaki örnekte
ur: مذکورہ بالا مثال میں ، ٹھوس کی بجائے کک ڈرم آواز کھیلی جائے گی۔
zh_cn: 上述示例中，将播放踢鼓声代替 sol。

source: set drum
es: fijar tambor
fr: définir le tambour
ja: ドラムをせってい
mr: ड्रम सेट करा
pt: definir bateria
te: ప్లేబ్యాక్కు ప్రస్తుత డ్రమ్ ధ్వనిని సెట్ చేయండి
tr: set davulu
ur: ڈھول سیٹ کریں
zh_cn: 设置鼓声

source: sound effect
es: efecto de sonido
fr: effet sonore
ja: こうかおん
mr: ध्वनी प्रभाव
pt: efeito de som
te: ధ్వని ప్రభావం
tr: ses efekti
ur: صوتی اثر
zh_cn: 音效

source: You can use multiple Drum blocks within a Note block.
es: Puede utilizar varios bloques de percusión dentro de un bloque de notas.
fr: Vous pouvez utiliser plusieurs blocs Drum dans un bloc Note.
ja: <h2>ドラムブロック</h2><br>「音符（おんぷ）ブロック」のなかに入れて使う。色々なドラムの音色を選ぶことができる。１つの「音符（おんぷ）ブロック」の中でふくすうの音色のドラムを組み合わせて使うことができる。
mr: तुम्ही नोट ब्लॉकमध्ये एकापेक्षा जास्त ड्रम ब्लॉक्स वापरू शकता.
pt: Você pode usar vários blocos Bateria dentro de um bloco Notas.
te: నోట్ బ్లాక్లు ఒక నోట్ బ్లాక్ లో అనేక డ్రమ్ బ్లాక్లను ఉపయోగించవచ్చు.
tr: bir nota bloğu içinde birden fazla davul bloğu kullanabilirsiniz
ur: آپ نوٹ بلاک کے اندر متعدد ڈرم بلاکس استعمال کرسکتے ہیں۔
zh_cn: 您可以在 Note 块内使用多个 Drum 块。

source: The Heap block returns the heap.
es: El bloque Pila devuelve la pila.
fr: Le bloc Heap renvoie le tas.
hi: हीप ब्लॉक हीप लौटाता है।
mr: हीप ब्लॉक ढिग परत करतो.
te: హీప్ బ్లాక్ హీప్ను తిరిగిస్తుంది.
tr: heap bloğu yığını döndürür
ur: ہیپ بلاک ڈھیر واپس کرتا ہے۔
zh_cn: Heap 块返回堆。

source: show heap
es: mostrar pila
fr: montrer le tas
hi: हीप दिखाएँ
ja: ヒープを表示する
mr: ढीग दाखवा
pt: mostrar pilha
te: హీప్ అంశాలను చూపుము
tr: yığını göster
ur: ڈھیر دکھائیں
zh_cn: 顯示堆疊

source: The Heap-length block returns the length of the heap.
es: El bloque Longitud de la pila devuelve la longitud de la pila.
fr: Le bloc Heap-length renvoie la longueur du tas.
hi: हीप-लेंथ ब्लॉक हीप की लंबाई लौटाता है।
mr: हीप-लेंग्थ ब्लॉक ढिगाची लांबी परत करतो.
pt: O bloco Comprimento-da-pilha retorna o comprimento da pilha.
te: హీప్-లెంత్ బ్లాక్ హీప్ యొక్క నైపుణ్యంను తిరిగిస్తుంది.
ur: ڈھیر کی لمبائی کا بلاک ڈھیر کی لمبائی واپس کرتا ہے۔
zh_cn: Heap-length 块返回堆的长度。

source: heap length
es: tamaño de la pila
fr: longueur du tas
hi: हीप लंबाई
ja: ヒープの長さ
mr: ढिगाची लांबी
pt: comprimento da pilha
te: హీప్ లెంత్
tr: yığın uzunluğu
ur: ڈھیر کی لمبائی
zh_cn: 堆长度

source: The Heap-empty? block returns true if the heap is empty.
es: El bloque Pila-vacío? devuelve verdadero si la pila está vacío.
fr: Le bloc Heap-empty? renvoie true si le tas est vide.
hi: हीप-खाली? ब्लॉक हीप खाली है तो true लौटाता है।
mr: हीप-एम्प्टी? ब्लॉक ढिग रिक्त असल्यास ट्रू परत करतो.
pt: O bloco Pilha-vazia? retorna verdadeiro se a pilha está vazia.
te: హీప్-ఖాళీ? బ్లాక్ హీప్ ఖాళీ ఉంటే నిజమేనని తిరిగిస్తుంది.
ur: ڈھیر خالی؟ اگر ڈھیر خالی ہو تو بلاک سچ ہوجاتا ہے۔
zh_cn: Heap-empty? 块在堆为空时返回真。

source: heap empty?
es: Â¿pila vacía?
fr: tas vide?
hi: हीप खाली है?
ja: ヒープは空ですか？
mr: ढिग रिक्त आहे का?
pt: pilha vazia?
te: హీప్ ఖాళీ?
tr: yığın boş?
ur: ڈھیر خالی؟
zh_cn: 堆是否为空？

source: The Empty-heap block empties the heap.
es: El bloque Vacío pila vacía la pila.
fr: Le bloc Empty-heap vide le tas.
hi: खाली-हीप ब्लॉक हीप को खाली करता है।
mr: एम्प्टी-हीप ब्लॉक ढिग रिक्त करतो.
pt: O bloco Esvaziar-pilha esvazia a pilha.
te: ఎంప్టీ-హీప్ బ్లాక్ హీప్ను ఖాళీ చేస్తుంది.
ur: خالی ڈھیر بلاک ڈھیر کو خالی کرتا ہے۔
zh_cn: Empty-heap 块清空堆。

source: empty heap
es: vaciar pila
fr: vider le tas
hi: खाली हीप
ja: 空のヒープ
mr: रिक्त ढीग
pt: pilha vazia
te: ఖాళీ హీప్
tr: boş yığın
ur: خالی ڈھیر
zh_cn: 清除堆疊

source: The Reverse-heap block reverses the order of the heap.
es: El bloque Pila inversa invierte el orden de la pila.
fr: Le bloc Reverse-heap inverse l'ordre du tas.
hi: रिवर्स-हीप ब्लॉक हीप का क्रम उलटा करता है।
mr: रिव्हर्स-हीप ब्लॉक ढिगाचा क्रम उलटवतो.
pt: O bloco Pilha-reversa reverte a ordem da pilha.
te: రివర్స్-హీప్ బ్లాక్ హీప్ యొక్క క్రమాను ప్రతిపలకం చేస్తుంది.
ur: ریورس ہیپ بلاک ڈھیر کے آرڈر کو الٹ دیتا ہے۔
zh_cn: Reverse-heap 块将堆的顺序反转。

source: reverse heap
es: revertir la pila
fr: inverser le tas
hi: हीप उलटें
ja: ヒープを逆にする
mr: उलट ढीग
pt: pilha reversa
te: హీప్ క్రమాను ప్రతిపలకం చేస్తుంది.
tr: ters yığın
ur: ریورس ہیپ
zh_cn: 反转堆

source: The Index-heap block returns a value in the heap at a specified location.
es: El bloque Ãndice de pila devuelve un valor en la pila en una ubicación especificada.
fr: Le bloc Index-heap renvoie une valeur dans le tas à un emplacement spécifié.
hi: इंडेक्स-हीप ब्लॉक निर्दिष्ट स्थान पर हीप में एक मूल्य लौटाता है।
mr: इंडेक्स-हीप ब्लॉक दिलेल्या स्थानावर हीपमधील मूल्य परत करतो.
pt: O bloco Índice-pilha retorna um valor na pilha em um local especificado.
te: ఇండెక్స్-హీప్ బ్లాక్ హీప్లో ఒక క్షేత్రంలో విలువను తిరిగిస్తుంది.
ur: انڈیکس ہیپ بلاک ایک مخصوص جگہ پر ڈھیر میں ایک قدر واپس کرتا ہے۔
zh_cn: Index-heap 块返回堆中指定位置的值。

source: index heap
es: valor en la pila
fr: indexer le tas
hi: हीप में स्थिति में से मूल्य प्राप्त करें
ja: ヒープに番号をふる
mr: इंडेक्स हीप
pt: pilha índice
te: ఇండెక్స్ హీప్
tr: dizin yığını
ur: انڈیکس ہیپ
zh_cn: 堆索引

source: Index must be > 0.
es: El índice debe ser > 0.
fr: L'index doit être > 0.
hi: सूची 0 से अधिक होनी चाहिए।
ja: インデクス番号は 0 より大きい必要があります。
mr: इंडेक्स > 0 असावा.
pt: O índice deve ser > 0.
te: సూచి ఉచితంగా ఉండాలి.
tr: indeks &gt
ur: انڈیکس > 0 ہونا چاہئے۔
zh_cn: 索引必须大于0。

source: Maximum heap size is 1000.
es: El tamaño máximo de pilas es 1000.
fr: La taille maximale du tas est de 1000.
hi: अधिकतम हीप आकार 1000 है।
ja: ヒープの大きさは、最大1000です。
mr: कमाल हीप आकार 1000 आहे.
pt: O tamanho máximo da pilha é 1.000
te: అత్యధిక హీప్ పరిమాణం 1000.
tr: maksimum yığın boyutu 1000'dir
ur: زیادہ سے زیادہ ڈھیر کا سائز 1000 ہے۔
zh_cn: 堆的最大大小为1000。

source: The Set-heap entry block sets a value in he heap at the specified location.
es: El bloque Fijar entrada de pila establece un valor en la pila en la ubicación especificada.
fr: Le bloc Set-heap entry définit une valeur dans le tas à l'emplacement spécifié.
hi: सेट-हीप एंट्री ब्लॉक निर्दिष्ट स्थान पर हीप में मूल्य सेट करता है।
mr: सेट-हीप एंट्री ब्लॉक दिलेल्या स्थानावर हीपमध्ये मूल्य सेट करतो.
pt: O bloco de entrada Definir-pilha define um valor na pilha na localização especificada.
ur: سیٹ ہیپ انٹری بلاک مخصوص جگہ پر ڈھیر میں ایک قیمت طے کرتا ہے۔
zh_cn: Set-heap entry 块在指定位置设置堆中的值。
