Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: set heap
es: fijar pila
fr: définir le tas
ja: ヒープを設定する
mr: सेट हीप
pt: definir pilha
te: హీప్‌ను లోడ్ చేయండి
tr: yığın ayarla
ur: ڈھیر طے کریں
zh_cn: 设置堆

source: index
es: posición en la pila
hi: सूची
ja: インデックス
mr: इंडेक्स
pt: índice
te: సూచి
tr: dizin
ur: انڈیکس
zh_cn: 索引

source: The Pop block removes the value at the top of the heap.
es: El bloque Pop elimina el valor en la parte superior del pila.
fr: Le bloc Pop supprime la valeur en haut du tas.
hi: पॉप ब्लॉक हीप के शीर्ष पर मूल्य को हटा देता है।
mr: पॉप ब्लॉक हीपच्या शीर्षस्थानील मूल्य काढून टाकतो.
pt: O bloco Pop remove o valor do topo da pilha.
te: పాప్ బ్లాక్ హీప్ చేతిన విలువను తీసేస్తుంది.
tr: pop bloğu yığının en üstündeki değeri kaldırır
ur: پاپ بلاک ڈھیر کے اوپری حصے میں قیمت کو دور کرتا ہے۔
zh_cn: Pop 块移除堆顶的值。

source: pop
es: sacar
fr: dépiler
hi: पॉप
ja: ポップ
mr: पॉप
te: ఎగసి
ur: پاپ
zh_cn: 取出堆疊

source: The Push block adds a value to the top of the heap.
es: El bloque Push agrega un valor a la parte superior del pila.
fr: Le bloc Push ajoute une valeur en haut du tas.
hi: पुश ब्लॉक हीप के शीर्ष पर मूल्य जोड़ता है।
mr: पुश ब्लॉक हीपच्या शीर्षस्थानी मूल्य जोडतो.
pt: O bloco Empurrar adiciona um valor ao topo da pilha.
te: పుష్ బ్లాక్ హీప్ చేతిన విలువను చేర్చిస్తుంది.
tr: push bloğu yığının en üstüne bir değer ekler
ur: پش بلاک ڈھیر کے اوپری حصے میں ایک قدر کا اضافہ کرتا ہے۔
zh_cn: Push 块将一个值添加到堆顶。

source: push
es: apilar
fr: empiler
hi: दबाएँ
ja: プッシュ
mr: ढकलणे
pt: empurrar
te: నెట్టు
tr: itmek
ur: دھکا
zh_cn: 存入堆疊

source: set temperament
es: fijar temperamento
fr: définir le tempérament
hi: ताम्बुल सेट करें
ja: 音律をせってい
mr: स्वभाव सेट करा
pt: definir temperamento
te: టెంపరమెంట్ సెట్ చేయి
tr: mizaç ayarlamak
ur: مزاج طے کریں
zh_cn: 设置音律

source: octave
es: octava
hi: ऑक्टेव
ja: オクターヴの高さ
mr: ऑक्टेव्ह
pt: oitava
te: ఆక్టేవ్
tr: oktav
ur: آکٹیو
zh_cn: 八度

source: The Temperament name block is used to select a tuning method.
es: El bloque Nombre Temperamento se utiliza para seleccionar un método de ajuste.
fr: Le bloc Temperament name est utilisé pour sélectionner une méthode d'accordage.
hi: ताम्बुल नाम ब्लॉक का उपयोग एक सुर की विधि का चयन करने के लिए किया जाता है।
ja: <h2>音律（おんりつ）ブロック</h2><br>調律（ちょうりつ）のしかたをせっていする。<br>★音律（おんりつ）とは<br>音程（おんてい）（音どうしのへだたり）の決め方。同じ音階でも、音律（おんりつ）によって音の高さが変わる。<br>★調律（ちょうりつ）とは<br>楽器の音の高さを、音律（おんりつ）にしたがって整えること。
mr: स्वभाव नाव ब्लॉक ट्यूनिंग पद्धत निवडण्यासाठी वापरला जातो.
pt: O bloco nome do Temperamento é usado para selecionar o método de afinação.
te: టెంపరమెంట్ నేమ్ బ్లాక్ ట్యూనింగ్ పద్ధతిని ఎంచుకోవడానికి ఉపయోగిస్తారు.
tr: temperament name bloğu bir akort yöntemi seçmek için kullanılır
ur: ٹیمپرمنٹ نام بلاک کو ٹیوننگ کا طریقہ منتخب کرنے کے لئے استعمال کیا جاتا ہے۔
zh_cn: Temperament name 块用于选择调音方法。

source: doubly
es: doble
fr: doubler
hi: दोगुना
ja: 重
mr: दुहेरी
pt: duplicar
te: రెండుగుండే
ur: دوگنا
zh_cn: 双倍

source: The Doubly block will double the size of an interval.
es: El bloque doble duplicará el tamaño de un intervalo.
fr: Le bloc Doubly doublera la taille d'un intervalle.
hi: डबली ब्लॉक एक इंटरवल का आकार दोगुना करेगा।
mr: दुहेरी ब्लॉक अंतराच्या आकारात दुप्पट वाढ करेल.
pt: O bloco Duplicar duplicará o tamanho de um intervalo.
te: డబులీ బ్లాక్ అంతరాలం యొక్క పరిమాణం రెండుగుండే చేస్తుంది.
tr: çift blok bir aralığın boyutunu iki katına çıkaracaktır
ur: ڈبل بلاک وقفے کے سائز کو دوگنا کردے گا۔
zh_cn: Doubly 块会将音程加倍。

source: interval number
es: número de intervalo
fr: numéro d'intervalle
hi: इंटरवल संख्या
ja: 音程を数で表示
mr: अंतर क्रमांक
te: అంతరాల సంఖ్య
tr: aralık numarası
ur: وقفہ نمبر
zh_cn: 音程编号

source: current interval
es: intervalo actua
fr: intervalle actuel
ja: 現在の音階
mr: वर्तमान अंतर
tr: geçerli aralık
ur: موجودہ وقفہ
zh_cn: 当前音程

source: semi-tone interval measure
es: medida de intervalo semitono
fr: mesure de l'intervalle en demi-tons
hi: सेमी-टोन इंटरवल माप
ja: 半音階的音程で計る
mr: अर्ध-स्वर अंतर मोजणी
pt: medida do intervalo semi-tom
te: రెండు స్వరాల మధ్య దూరం పరిమాణం పెంచడానికి మెయిజర్
ur: نیم ٹون وقفہ پیمائش
zh_cn: 半音程测量

source: You must use two pitch blocks when measuring an interval.
es: Debe usar dos bloques de tono cuando mida un intervalo.
fr: Vous devez utiliser deux blocs de hauteur lorsque vous mesurez un intervalle.
hi: आपको एक इंटरवल को मापते समय दो पिच ब्लॉक्स का उपयोग करना होगा।
ja: 音程を計る際は、２つの音符を使う必要があります。
mr: अंतर मोजताना तुम्हाला दोन पिच ब्लॉक्स वापरावे लागतील.
pt: Você deve usar dois blocos de tom quando medir um intervalo.
te: మీరు ఒక ఇంటర్వల్ మీజరింగ్ చేసేందుకు రెండు పిచ్ బ్లాక్స్ ఉపయోగించాలి.
tr: bir aralığı ölçerken iki perde bloğu kullanmalısınız
ur: وقفہ کی پیمائش کرتے وقت آپ کو دو پچ بلاکس استعمال کرنا ہوں گے۔
zh_cn: 测量音程时必须使用两个音高块。

source: The Scalar interval block measures the distance between two notes in the current key and mode.
es: El bloque Intervalo escalar mide la distancia entre dos notas en la clave y el modo actuales.
fr: Le bloc d'intervalle scalaire mesure la distance entre deux notes dans la tonalité et le mode actuels.
hi: स्केलर इंटरवल ब्लॉक वर्तमान कुंजी और मोड में दो नोट्स के बीच की दूरी को मापता है।
mr: स्केलर अंतर ब्लॉक वर्तमान की आणि मोडमध्ये दोन नोट्समधील अंतर मोजतो.
pt: O bloco de intervalo Escalar mede a distância entre duas notas na tecla e no modo atuais.
te: స్కాలార్ ఇంటర్వల్ బ్లాక్ ప్రస్తుత కీ మరియు మోడ్ లో రెండు స్వరాల మధ్య దూరం పరిమాణం పెంచివేస్తుంది.
tr: skaler aralık bloğu
ur: اسکیلر وقفہ بلاک موجودہ کلید اور موڈ میں دو نوٹ کے درمیان فاصلے کی پیمائش کرتا ہے۔
zh_cn: Scalar interval 块测量当前调式中两个音符之间的距离。

source: scalar interval measure
es: medida de intervalo escalar
fr: mesure d'intervalle scalaire
hi: स्केलर इंटरवल माप
ja: 全音階的音程で計る
mr: स्केलर अंतर मोजणी
pt: medida do intervalo escalar
te: మ్యూజికల్ స్కేల్ స్టెప్ల మధ్య రెండు స్వరాల మధ్య దూరం పరిమాణం పెంచడానికి మెయిజర్
tr: skaler aralık ölçüsü
ur: اسکیلر وقفہ پیمائش
zh_cn: 标量音程测量

source: In the figure, we add sol# to sol.
es: En la figura, agregamos sol# a sol.
fr: Dans la figure, nous ajoutons sol# à sol.
hi: चित्र में, हम sol# को sol में जोड़ते हैं।
ja: 例の画像には<em>ソル</em>が<em>ソル#</em>になります。
mr: आकृतीमध्ये, आम्ही सोल# सोलमध्ये जोडतो.
pt: Na figura, adicionamos sol# ao sol.
te: చిత్రలో, మేము సోల్# ను సోల్కి జోడిస్తాము.
tr: Şekilde
ur: اعداد و شمار میں ، ہم سول # کو سول میں شامل کرتے ہیں۔
zh_cn: 图中，我们将升sol加到sol上。

source: semi-tone interval
es: intervalo semitono
fr: intervalle de demi-ton
hi: सेमी-टोन इंटरवल
ja: 半音階的音程
mr: अर्ध-स्वर अंतर
pt: intervalo semi-tom
te: సెమీ-టోన్ ఇంటర్వల్
ur: نیم ٹون وقفہ
zh_cn: 半音程

source: The output of the example is: do, mi, sol, sol, ti, mi
es: La salida del ejemplo es: do, mi, sol, sol, ti, mi
fr: La sortie de l'exemple est : do, mi, sol, sol, ti, mi
hi: उदाहरण का आउटपुट है: do, mi, sol, sol, ti, mi
ja: 例の解決は「ド、ミ、ソ、ソ、シ、ミ」
mr: उदाहरणाचे आउटपुट आहे: डो, मी, सोल, सोल, टी, मी
te: ఉదాహరణకు ఆఉట్పుట్: దో, మి, సోల్, సోల్, టి, మి
tr: örneğin çıktısı şöyledir
ur: مثال کی پیداوار یہ ہے کہ: کریں ، میل ، سول ، سول ، ٹائی ، میل
zh_cn: 示例输出为：do, mi, sol, sol, ti, mi

source: arpeggio
es: arpegio
fr: arpège
hi: आरपेजियो
ja: アルペジオ
mr: अर्पेजियो
te: ఆర్పెజియో
tr: arpej
ur: آرپیجیو
zh_cn: 琶音

source: The Chord block calculates common chords.
es: El bloque Acordes calcula acordes comunes.
fr: Le bloc Accord calcule les accords courants.
hi: कॉर्ड ब्लॉक सामान्य कॉर्ड की गणना करता है।
mr: कॉर्ड ब्लॉक सामान्य कॉर्ड्सची गणना करतो.
te: చార్డ్ బ్లాక్ సాధారణ చార్డ్లను గణిస్తుంది.
tr: akor bloğu ortak akorları hesaplar
ur: راگ بلاک عام راگوں کا حساب لگاتا ہے۔
zh_cn: Chord 块计算常见和弦。

source: In the figure, we generate a C-major chord.
es: En la figura generamos un acorde de C-mayor.
fr: Dans la figure, nous générons un accord de do majeur.
hi: चित्र में, हम C मेजर कॉर्ड बनाते हैं।
mr: आकृतीमध्ये, आम्ही C-मेजर कॉर्ड तयार करतो.
te: చిత్రలో, మేము సి-మేజర్ చార్డ్ రేపగాలాము.
ur: اعداد و شمار میں ، ہم ایک سی میجر راگ تیار کرتے ہیں۔
zh_cn: 图中，我们生成一个C大调和弦。

source: chord
es: acorde
fr: accord
hi: कॉर्ड
ja: の和音
mr: कॉर्ड
pt: acorde
te: చార్డ్
tr: akor
ur: راگ
zh_cn: 和弦

source: The Ratio Interval block calculates an interval based on a ratio.
es: El bloque intervalo de razón calcula un intervalo basado en una razón
fr: Le bloc Intervalle de ratio calcule un intervalle basé sur un ratio.
hi: अनुपात इंटरवल ब्लॉक एक अनुपात पर आधारित इंटरवल की गणना करता है।
ja: 「比で音程」ブロックは比の音程のピッチを経産する。
mr: रेटियो अंतर ब्लॉक रेशोवर आधारित अंतराची गणना करतो.
te: రేషియో ఇంటర్వల్ బ్లాక్ సంతోషం ఆధారంగా ఒక ఇంటర్వల్ను గణిస్తుంది.
tr: oran aralığı bloğu
ur: تناسب وقفہ بلاک تناسب کی بنیاد پر وقفے کا حساب لگاتا ہے۔
zh_cn: Ratio Interval 块根据比例计算音程。

source: ratio interval
es: intervalo de razón
fr: intervalle de ratio
hi: अनुपात इंटरवल
ja: 比で音程
mr: रेटियो अंतर
te: రేషియో ఇంటర్వల్
tr: oran aralığı
ur: تناسب کا وقفہ
zh_cn: 比例音程

source: In the figure, we add la to sol.
es: En la figura, sumamos la a sol.
fr: Dans la figure, nous ajoutons la à sol.
hi: चित्र में, हम la को sol में जोड़ते हैं।
ja: <br><br>上の図では、ソの「音符（おんぷ）ブロック」をきじゅんにして、「音階の上下ブロック」のすうちを２にせっていしているので、ソと、ソから２音あがったシの音が同時にえんそうされる。<br><br>★音階とは<br>順番に並んだ音のまとまり。たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。
mr: आकृतीमध्ये, आम्ही ला सोलमध्ये जोडतो.
pt: Na figura, adicionamos la ao sol.
te: చిత్రలో, మేము సోల్ కి లానిని జోడిస్తాము.
tr: yı sol
ur: اعداد و شمار میں ، ہم سول میں لا شامل کرتے ہیں۔
zh_cn: 图中，我们将la加到sol上。

source: define mode
es: definir el modo
fr: définir un mode
hi: मोड परिभाषित करें
ja: モードを定義する
mr: कस्टम मोड परिभाषित करा
pt: Definir modo
te: కస్టమ్ మోడ్
tr: modu tanımla
ur: وضع کی وضاحت کریں
zh_cn: 定义调式

source: movable Do
es: movible Do
fr: Do mobile
hi: मूवेबल डो
ja: 移動ド
mr: चालता डो
pt: Do móvel
te: మూవబుల్ డో
tr: hareketli do
ur: متحرک کریں
zh_cn: 可移调的Do

source: mode length
es: longitud de modo
fr: longueur du mode
hi: मोड लंबाई
ja: 音階の音数
mr: मोड लांबी
pt: modo número de notas
te: మోడ్ పొడవు
tr: mod uzunluğu
ur: موڈ کی لمبائی
zh_cn: 调式长度

source: The Mode length block is the number of notes in the current scale.
es: El bloque Longitud de modo es el número de notas en la escala actual.
fr: Le bloc Longueur du mode est le nombre de notes dans l'échelle actuelle.
hi: मोड लंबाई ब्लॉक मौजूदा स्केल में स्वरों की संख्या है।
ja: <h2>音階の音数ブロック</h2><br>えんそうされている音階の、音の数を表示する。
mr: मोड लांबी ब्लॉक वर्तमान स्केलमधील नोट्सची संख्या आहे.
pt: O bloco Modo número de notas é o número de notas na escala atual.
te: మోడ్ లెంథ్ బ్లాక్ ప్రస్తుత స్కేల్లో ఉన్న స్వరాల సంఖ్య.
tr: mod uzunluğu bloğu geçerli skaladaki nota sayısıdır
ur: موڈ لمبائی بلاک موجودہ پیمانے پر نوٹوں کی تعداد ہے۔
zh_cn: Mode length 块表示当前音阶中的音符数量。

source: Most Western scales have 7 notes.
es: La mayoría de las escalas occidentales tienen 7 notas.
fr: La plupart des échelles occidentales ont 7 notes.
hi: अधिकांश पश्चिमी स्केल में 7 स्वर होते हैं।
ja: 西洋のほとんどの音階は、7つの音をもつ。<br><br>★音階とは<br>順番に並んだ音のまとまり。たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。
mr: बहुतेक पाश्चिमात्य स्केलमध्ये 7 नोट्स असतात.
pt: A maioria das escalas ocidentais possui 7 notas.
te: అనేక పశ్చిమ స్కేల్లు 7 స్వరాలు ఉన్నాయి.
tr: çoğu batı gamının 7 notası vardır
ur: زیادہ تر مغربی ترازو میں 7 نوٹ ہیں۔
zh_cn: 大多数西方音阶有7个音符。

source: current mode
es: modo actual
fr: mode actuel
hi: वर्तमान मोड
ja: 現代の音階
mr: वर्तमान मोड
pt: modo atual
te: ప్రస్తుత మోడ్
tr: geçerli mod
ur: موجودہ موڈ
zh_cn: 当前调式

source: current key
es: clave actual
fr: tonalité actuelle
hi: वर्तमान कुंजी
ja: 現代の調
mr: वर्तमान की
pt: chave atual
te: ప్రస్తుత కీ
tr: geçerli anahtar
ur: موجودہ کلید
zh_cn: 当前调

source: set key
es: fijar clave
fr: définir la tonalité
hi: कुंजी सेट करें
ja: 調をせってい
mr: की सेट करा
pt: definir chave
te: కీని మరియు మోడ్ సెట్ చేయండి, ఉదా. C మేజర్
tr: anahtar ayarla
ur: سیٹ کلید
zh_cn: 设置调

source: The Set key block is used to set the key and mode,
es: El bloque Fijar tecla se usa para configurar la tecla y el modo,
fr: Le bloc Définir la tonalité est utilisé pour définir la tonalité et le mode,
hi: सेट कुंजी ब्लॉक का उपयोग कुंजी और मोड सेट करने के लिए किया जाता है,
ja: <h2>調をせっていブロック</h2><br>調の部分に音の高さ、音階の部分に音階の種類を選び、調をせっていする。<br><br>★調とは<br>中心的な役わりをはたす音と、音階の種類によって決まる、曲の感じ。中心的な役わりをはたす音だけを指すこともある。<br>★音階とは<br>順番に並んだ音のまとまり。
mr: की आणि मोड सेट करण्यासाठी सेट की ब्लॉक वापरला जातो,
pt: O bloco Definir tecla é usado para definir a tecla e o modo,
te: కీని మరియు మోడ్ సెట్ చేయడానికి Set key బ్లాక్ ఉపయోగిస్తారు,
tr: set key bloğu anahtar ve modu ayarlamak için kullanılır
ur: سیٹ کلیدی بلاک کا استعمال کلید اور وضع کو ترتیب دینے کے لئے کیا جاتا ہے ،
zh_cn: Set key 块用于设置调和调式，

source: eg C Major
es: por ejemplo, C Mayor
fr: par exemple Do Majeur
ja: たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。
mr: उदा. C मेजर
pt: Por exemplo, C Maior
te: ఉదా C మేజర్
tr: örneğin do majör
ur: مثال کے طور پر سی میجر
zh_cn: 例如 C 大调

source: The Int block returns an integer.
es: El bloque Int devuelve un entero.
fr: Le bloc Int retourne un entier.
hi: इंट ब्लॉक एक पूर्णांक वापस करता है।
mr: इंट ब्लॉक पूर्णांक परत करतो.
pt: O bloco Int retorna um inteiro.
te: ఇంట్ బ్లాక్ ఒక పూర్ణాంకంను తరపుచేస్తుంది.
tr: int bloğu bir tamsayı döndürür
ur: انٹر بلاک ایک عدد واپس کرتا ہے۔
zh_cn: Int 块返回一个整数。

source: int
hi: पूर्णांक
ja: 整数に
mr: पूर्णांक
te: పూర్ణాంకం
ur: انٹ
zh_cn: 整数

source: The Mod block returns the remainder from a division.
es: El bloque Mod devuelve el resto de una división.
fr: Le bloc Mod retourne le reste d'une division.
hi: मॉड ब्लॉक विभाजन से शेष प्राप्त करता है।
mr: मॉड ब्लॉक विभागणीमधून उरलेले परत करतो.
pt: O bloco Mod retorna o resto de uma divisão.
te: మాడ్ బ్లాక్ భాగం నుండి వాడికి తగినంత విషమమునకు తిరిగిస్తుంది.
tr: mod bloğu bir bölme işleminden kalanı döndürür
ur: موڈ بلاک باقی کو ڈویژن سے واپس کرتا ہے۔
zh_cn: Mod 块返回除法的余数。

source: mod
es: módulo
hi: मॉड
ja: ～で割った余り（mod）
mr: मॉड
te: మాడ్
ur: موڈ
zh_cn: 模數

source: The Power block calculates a power function.
es: El bloque de potencia calcula una función de potencia.
fr: Le bloc Puissance calcule une fonction puissance.
hi: पावर ब्लॉक एक शक्ति समीकरण की गणना करता है।
mr: पॉवर ब्लॉक पॉवर फंक्शनची गणना करतो.
pt: O bloco Potência calcula a função potência.
te: పవర్ బ్లాక్ ఒక శక్తి ఫంక్షన్ను గణిస్తుంది.
tr: güç bloğu bir güç fonksiyonunu hesaplar
ur: پاور بلاک بجلی کے فنکشن کا حساب لگاتا ہے۔
zh_cn: Power 块计算幂函数。

source: The Sqrt block returns the square root.
es: El bloque Sqrt devuelve la raíz cuadrada.
fr: Le bloc Racine retourne la racine carrée.
hi: स्क्वायर रूट ब्लॉक वर्गमूल लौटाता है।
mr: स्क्वेअर रूट ब्लॉक वर्गमुळ परत करतो.
pt: O bloco Sqrt retorna a raiz quadrada.
te: Sqrt బ్లాక్ వర్గమూలాన్ని తరపుచేస్తుంది.
tr: sqrt bloğu karekökü döndürür
ur: مربع بلاک مربع جڑ واپس کرتا ہے۔
zh_cn: Sqrt 块返回平方根。

source: sqrt
es: raíz
fr: racine carrée
hi: वर्गमूल
ja: 平方根
mr: वर्गमुळ
te: వర్గమూలం
ur: مربع
zh_cn: 平方根

source: The Abs block returns the absolute value.
es: El bloque Abs devuelve el valor absoluto.
fr: Le bloc Abs retourne la valeur absolue.
hi: एब्स ब्लॉक पूर्णांक मान लौटाता है।
mr: एब्स ब्लॉक पूर्णांक मूल्य परत करतो.
pt: O bloco Abs retorna o valor absoluto.
te: Abs బ్లాక్ ఒక సంపూర్ణాంకంను తరపుచేస్తుంది.
tr: abs bloğu mutlak değeri döndürür
ur: Abs بلاک مطلق قیمت واپس کرتا ہے۔
zh_cn: Abs 块返回绝对值。

source: abs
hi: एब्स
ja: 絶対値
mr: पूर्णांक
te: సంపూర్ణాంకం
ur: ایبس
zh_cn: 绝对值

source: The Distance block returns the distance between two points. For example, between the mouse and the center of the screen.
es: El bloque Distancia devuelve la distancia entre dos puntos. Por ejemplo, entre el ratón y el centro de la pantalla.
fr: Le bloc Distance retourne la distance entre deux points. Par exemple, entre la souris et le centre de l'écran.
hi: डिस्टेंस ब्लॉक दो बिंदुओं के बीच की दूरी लौटाता है। उदाहरण के लिए, माउस और स्क्रीन के केंद्र के बीच।
mr: डिस्टन्स ब्लॉक दोन बिंदूंच्या दरम्यानचे अंतर परत करतो. उदाहरणार्थ, माऊस आणि स्क्रीनच्या मध्यभागी.
te: డిస్టన్స్ బ్లాక్ రెండు బిందువుల మధ్య దూరాన్ని తరపుచేస్తుంది. ఉదాహరణకు, మౌసు మరియు స్క్రీన్ యొక్క కేంద్రం మధ్య.
tr: mesafe bloğu iki nokta arasındaki mesafeyi döndürür
ur: ڈسٹنس بلاک دو پوائنٹس کے درمیان فاصلہ واپس کرتا ہے۔ مثال کے طور پر ، ماؤس اور اسکرین کے مرکز کے درمیان۔
zh_cn: Distance 块返回两点之间的距离。例如，鼠标与屏幕中心之间的距离。

source: distance
es: distancia
hi: दूरी
ja: 距離
mr: अंतर
pt: distância
te: దూరం
tr: mesafe
ur: فاصلہ
zh_cn: 距离

source: The Divide block is used to divide.
es: El bloque División se usa para dividir.
fr: Le bloc Diviser est utilisé pour diviser.
hi: डिवाइड ब्लॉक का उपयोग विभाजन के लिए किया जाता है।
ja: <h2>すうちブロック（計算）</h2><br>２つのすうちの割り算した計算結果を表すすうちブロック。上につないだすうちを、下につないだすうちで割る。
mr: डिव्हाइड ब्लॉक विभागण्यासाठी वापरला जातो.
pt: O bloco Dividir é usado para dividir.
te: డివైడ్ బ్లాక్ భాగం చేయడానికి ఉపయోగిస్తారు.
tr: bölme bloğu bölmek için kullanılır
ur: تقسیم بلاک تقسیم کرنے کے لئے استعمال ہوتا ہے۔
zh_cn: Divide 块用于除法运算。

source: The Multiply block is used to multiply.
es: El bloque Multiplicar se usa para multiplicar.
fr: Le bloc Multiplier est utilisé pour multiplier.
hi: मल्टिप्लाई ब्लॉक का उपयोग गुणा करने के लिए किया जाता है।
ja: <h2>すうちブロック（計算）</h2><br>２つのすうちを掛け合わせた計算結果を表すすうちブロック。
mr: मल्टिप्लाय ब्लॉक गुणाकारासाठी वापरला जातो.
pt: O bloco Multiplicar é usado para multiplicar.
te: మల్టిప్లై బ్లాక్ గుణించడానికి ఉపయోగిస్తారు.
tr: çarpma bloğu çarpmak için kullanılır
ur: ضرب بلاک ضرب لگانے کے لئے استعمال ہوتا ہے۔
zh_cn: Multiply 块用于乘法运算。

source: The Minus block is used to subtract.
es: El bloque Minus se usa para restar.
fr: Le bloc Moins est utilisé pour soustraire.
hi: माइनस ब्लॉक का उपयोग घटना के लिए किया जाता है।
ja: <h2>すうちブロック（計算）</h2><br>２つのすうちの引き算した計算結果を表すすうちブロック。上につないだすうちから、下につないだすうちを引く。
mr: मायनस ब्लॉक वजाबाकी करण्यासाठी वापरला जातो.
pt: O bloco Menos é usado para subtrair.
te: మైనస్ బ్లాక్ తిరిగిచడానికి ఉపయోగిస్తారు.
tr: eksi bloğu çıkarma işlemi için kullanılır
ur: مائنس بلاک کو گھٹانے کے لئے استعمال کیا جاتا ہے۔
zh_cn: Minus 块用于减法运算。

source: The Plus block is used to add.
es: El bloque Plus se utiliza para agregar.
fr: Le bloc Plus est utilisé pour ajouter.
hi: प्लस ब्लॉक का उपयोग जोड़ने के लिए किया जाता है।
ja: <h2>すうちブロック（計算）</h2><br>２つのすうちを足し合わせた計算結果を表すすうちブロック。
mr: प्लस ब्लॉक जोडण्यासाठी वापरला जातो.
pt: O bloco Mais é usado para adicionar.
te: ప్లస్ బ్లాక్ జోడించడానికి ఉపయోగిస్తారు.
tr: artı bloğu eklemek için kullanılır
ur: پلس بلاک شامل کرنے کے لئے استعمال ہوتا ہے۔
zh_cn: Plus 块用于加法运算。

source: The One-of block returns one of two choices.
es: El bloque Uno de estos devuelve una de dos opciones.
fr: Le bloc Un-deux retourne l'un des deux choix.
hi: वन-ऑफ़ ब्लॉक दो विकल्पों में से एक वापस करता है।
ja: <h2>特殊ブロック（ランダム）</h2><br>つないだ２つのブロックのうち、1つだけをランダムに選ぶ。「すうち」「アクション名」など、さまざまなブロックをつなぐことができる。<br><br>★ランダムとは<br>サイコロの目のように、何が出るか分からないすうちのこと。ランダム（random）は日本語で「らんすう」「でたらめな」という意味。ランダムを使うと、実行のたびにえんそう順じょが変わる曲などを作ることができる。
mr: वन-ऑफ ब्लॉक दोन पर्यायांपैकी एक परत करतो.
pt: O bloco UM-de retorna uma das duas opções.
te: వన్-అఫ్ బ్లాక్ రెండు ఆకట్టులను తిరిగిస్తుంది.
ur: ون آف بلاک دو انتخاب میں سے ایک واپس کرتا ہے۔
zh_cn: One-of 块返回两个选项中的一个。

source: one of
es: uno de estos
fr: un de
hi: में से एक
ja: どちらかランダム
mr: एक
pt: um de
te: ఒకటి
tr: biri
ur: میں سے ایک
zh_cn: 其中之一

source: this
es: éste
fr: ceci
hi: यह
ja: これか
mr: हे
pt: isso
te: ఇది
tr: bu
ur: یہ
zh_cn: 此

source: that
es: ése
fr: cela
hi: वह
ja: それか
mr: ते
pt: aquilo
te: అది
tr: o
ur: کہ
zh_cn: 彼

source: The Random block returns a random number.
es: El bloque Aleatorio devuelve un número aleatorio.
fr: Le bloc Aléatoire retourne un nombre aléatoire.
hi: रैंडम ब्लॉक एक यादृच्छिक संख्या वापस करता है।
ja: <h2>すうちブロック（ランダム）</h2><br>指定したさいしょうちからさいだいちまでのはんいで、ランダムなすうちになる。<br><br>★ランダムとは<br>サイコロの目のように、何が出るか分からないすうちのこと。ランダム（random）は日本語で「らんすう」「でたらめな」という意味。ランダムを使うと、実行のたびにえんそう順じょが変わる曲などを作ることができる。
mr: रँडम ब्लॉक कधीतरी संख्येची परत करतो.
pt: O bloco Aleatório retorna um número aleatório.
te: రండం బ్లాక్ రండం సంఖ్యను తిరిగిస్తుంది.
tr: rastgele blok rastgele bir sayı döndürür
ur: رینڈم بلاک ایک بے ترتیب نمبر واپس کرتا ہے۔
zh_cn: Random 块返回一个随机数。

source: random
es: aleatorio
fr: aléatoire
hi: बेतरतीब
ja: ランダム
mr: कुटला पण
pt: aleatório
te: విభిన్నంగా
tr: rastgele
ur: بے ترتیب
zh_cn: 亂數

source: min
hi: न्यून.
ja: さいしょうち
mr: किमान / कमीत कमी
te: అత్యల్ప
ur: منٹ
zh_cn: 最小

source: max
hi: अधि.
ja: さいだいち
mr: कमाल / जस्तिस जास्त
te: అత్యధిక
tr: maksimum
ur: زیادہ سے زیادہ
zh_cn: 最大

source: The Number block holds a number.
es: El bloque Numérico contiene un número.
fr: Le bloc Nombre contient un nombre.
hi: नंबर ब्लॉक एक संख्या को धारित करता है।
ja: <h2>すうちブロック</h2><br>すうちを指定するブロック。
mr: नंबर ब्लॉक एक संख्या धरतो.
pt: O bloco Número contém um número.
te: నంబర్ బ్లాక్ ఒక సంఖ్యను ఉంచిపెడుతుంది.
tr: sayı bloğu bir sayı tutar
ur: نمبر بلاک میں ایک نمبر ہے۔
zh_cn: Number 块保存一个数字。

source: staccato factor
es: factor de staccato
fr: facteur staccato
hi: स्टाकेटो कारक
ja: スタッカートの長さファクター
mr: स्टॅकॅटो घटक
pt: fator de staccato
te: స్టాకాటో ఫ్యాక్టర్
tr: staccato faktörü
ur: اسٹیکاٹو عنصر
zh_cn: 断音因子

source: slur factor
es: factor de legato
fr: facteur de liaison
hi: स्लर कारक
ja: スラーの長さファクター
mr: स्लर घटक
pt: fator legato
te: స్లర్ ఫ్యాక్టర్
tr: slur faktörü
ur: سلور عنصر
zh_cn: 连音因子

source: neighbor
es: vecino
fr: voisin
hi: पड़ोसी
ja: 音を加える
mr: शेजारी
pt: vizinho
te: పడమాని
tr: komşu
ur: پڑوسی
zh_cn: 邻近音

source: The Neighbor block rapidly switches between neighboring pitches.
es: El bloque Vecino cambia rápidamente entre los tonos vecinos.
fr: Le bloc Voisin bascule rapidement entre les hauteurs voisines.
hi: नेबर ब्लॉक तेजी से पड़ोसी स्वरों के बीच स्विच करता है।
ja: <h2>音を加えるブロック</h2><br>２つの同じ高さの音のあいだに、音を１つ入れることができる。<br>図の例では、ソとソのあいだにラが入り、「ソラソ」とすばやくえんそうされる。<br><br>★音階とは<br>順番に並んだ音のまとまり。たとえば、「ド」を始まりの音にしたときの「ドレミファソラシド」、「ソ」を始まりの音にしたときの「ソラシドレミ（♯ファ）ソ」のこと。
mr: नेबर ब्लॉक शेजारील पिचेस दरम्यान जलद स्विच करतो.
pt: O bloco Vizinho muda rapidamente entre os campos vizinhos.
te: నేబర్ బ్లాక్ అదిరిపోయే అంశాలలో వేరుకు వేరు స్విచ్ చేస్తుంది.
tr: komşu blok komşu perdeler arasında hızla geçiş yapar
ur: پڑوسی بلاک پڑوسی پچوں کے مابین تیزی سے سوئچ کرتا ہے۔
zh_cn: Neighbor 块快速切换相邻音高。

source: glide
es: deslizarse
fr: glissando
hi: ग्लाइड
ja: グリッサンド
mr: ग्लाइड
te: గ్లైడ్
tr: kayma
ur: گلائڈ
zh_cn: 滑音

source: slur
es: legato
fr: liaison
hi: स्लर
ja: スラー
mr: स्लर
pt: legato
te: స్లర్
ur: سلور
zh_cn: 连音线

source: staccato
hi: स्टाकेटो
ja: スタッカート
mr: स्टॅकॅटो
te: స్టాకాటో
ur: اسٹاکاٹو
zh_cn: 断音

source: The Load-heap-from-app block loads the heap from a web page.
es: El bloque Cargar-pila-en-app carga la pila en una página web.
fr: Le bloc Charger-heap-de-l'application charge le tas depuis une page web.
pt: O bloco Carregar-pilha-do-app carrega a pilha de uma página da web.
te: లోడ్-హీప్-ఫ్రం-యాప్ బ్లాక్ ఒక వెబ్ పేజీని నుండి హీప్‌ను లోడ్ చేస్తుంది.
ur: لوڈ ڈھیر سے ایپ بلاک ایک ویب صفحے سے ڈھیر کو لوڈ کرتا ہے۔
zh_cn: Load-heap-from-app 块从网页加载堆。

source: load heap from App
es: cargar pila desde aplicación
fr: charger le tas depuis l'application
ja: アプリからヒープをロード
pt: carregar pilha do aplicativo
te: అప్‌ను నుండి హీప్ కంటెంట్‌ను లోడ్ చేయండి
tr: uygulamadan yığın yükle
ur: ایپ سے ڈھیر لوڈ کریں
zh_cn: 从应用加载堆

source: Error parsing JSON data:
es: Error de análisis de datos JSON.
fr: Erreur d'analyse des données JSON :
ja: JSON データの構文エラーです。
pt: Erro ao analisar dados JSON:
te: JSON డేటాను విశ్లేషణ చేయడంలో లోపం:
tr: json verilerini ayrıştırma hatası
ur: JSON ڈیٹا کو پارس کرنے میں خرابی:
zh_cn: 解析JSON数据时出错

source: 404: Page not found
es: 404: Página no encontrada.
fr: 404 : Page non trouvée
ja: ４０４エラー：ページが見つかりません。
pt: 404 Página não encontrada
te: 404: పేజీ కనుగొనబడలేదు
ur: 404: صفحہ نہیں ملا
zh_cn: 找不到网页

source: The Save-heap-to-app block saves the heap to a web page.
es: El bloque Guardar-pila-en-app guarda la pila en una página web.
fr: Le bloc Enregistrer-le-tas-dans-l'application enregistre le tas dans une page web.
pt: O bloco Salvar-pilha-para-aplicativo salva a pilha em uma página da web.
te: సేవ్-హీప్-టు-యాప్ బ్లాక్ హీప్‌ను ఒక వెబ్ పేజీకి భద్రపరచేస్తుంది.
ur: سیف-ہیپ ٹو ایپ بلاک ڈھیر کو ایک ویب پیج پر محفوظ کرتا ہے۔
zh_cn: Save-heap-to-app 块将堆保存到网页。
