Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Show block is used to display text or images on the canvas.
es: El bloque Mostrar se utiliza para mostrar texto o imágenes en el lienzo.
fr: Le bloc Afficher est utilisé pour afficher du texte ou des images sur la toile.
ja: <h2>表示ブロック（スタンプ）</h2><br>スタンプは、実行するとネズミの位置に指定した文字またはがぞうを表示する。ネズミの体の下に表れるので、小さい文字やがぞうだとネズミが移動しないと見えない場合がある。
mr: शो ब्लॉक कॅनव्हासवर मजकूर किंवा प्रतिमा प्रदर्शित करण्यासाठी वापरला जातो.
pt: O bloco Mostrar é usado para exibir texto ou imagens na tela.
te: షో బ్లాక్ టెక్స్ట్ లేదా చిత్రాలను క్యాన్వాస్‌పై ప్రదర్శించడానికి ఉపయోగిస్తారు.
tr: show bloğu tuval üzerinde metin veya resim görüntülemek için kullanılır
ur: شو بلاک کا استعمال کینوس پر متن یا تصاویر دکھانے کے لیے کیا جاتا ہے۔
zh_cn: Show 块用于在画布上显示文本或图像。

source: obj
es: objeto
fr: objet
hi: वस्तु
ja: そざい
te: ఆబ్జెక్ట్
ur: اعتراض
zh_cn: 对象

source: The Media block is used to import an image.
es: El bloque Medios se utiliza para importar una imagen.
fr: Le bloc Média est utilisé pour importer une image.
ja: <h2>がぞうブロック</h2><br>がぞうのブロック。ブロックのマークをおすと、コンピューター上からがぞうファイルを読み込むことができる。
mr: मीडिया ब्लॉक प्रतिमा आयात करण्यासाठी वापरला जातो.
pt: O bloco Mídia é usado para importar uma imagem.
te: మీడియా బ్లాక్ చిత్రం దిగుమతికి ఉపయోగిస్తారు.
tr: medya bloğu bir görüntüyü içe aktarmak için kullanılır
ur: میڈیا بلاک کو امیج امپورٹ کرنے کے لیے استعمال کیا جاتا ہے۔
zh_cn: Media 块用于导入图像。

source: The Text block holds a text string.
es: El bloque Texto contiene una cadena de texto.
fr: Le bloc Texte contient une chaîne de texte.
ja: <h2>文字ブロック</h2><br>文字を指定するブロック。
mr: टेक्स्ट ब्लॉक टेक्स्ट स्ट्रिंग धरतो.
pt: O bloco Texto contém uma linha de texto.
te: టెక్స్ట్ బ్లాక్ ఒక టెక్స్ట్ స్ట్రింగ్‌ను నిలుస్తుంది.
tr: metin bloğu bir metin dizesi içerir
ur: ٹیکسٹ بلاک ایک ٹیکسٹ سٹرنگ رکھتا ہے۔
zh_cn: Text 块包含一段文本字符串。

source: purple
es: morado
fr: violet
hi: बैंगनी
ja: 紫
mr: जांभळा
pt: púrpura
te: నేరుపు
tr: mor
ur: جامنی
zh_cn: 紫色

source: blue
es: azur
fr: bleu
hi: नीला
ja: 青
mr: निळा
pt: azul
te: నీలం
tr: mavi
ur: نیلا
zh_cn: 蓝色

source: green
es: verde
fr: vert
hi: हरा
ja: 緑
mr: हिरवा
pt: verde
te: ఆకుపచ్చ
tr: yeşil
ur: سبز
zh_cn: 绿色

source: yellow
es: amarillo
fr: jaune
hi: पीला
ja: 黄色
mr: पिवळा
pt: amarelo
te: పసుపు
tr: sarı
ur: پیلا
zh_cn: 黄色

source: orange
es: naranja
hi: नारंगी
ja: オレンジ
mr: संत्रा
pt: laranja
te: ఆరంజ్
tr: turuncu
ur: نارنجی
zh_cn: 橘色

source: red
es: rojo
fr: rouge
hi: लाल
ja: 赤
mr: लाल
pt: vermelho
te: ఎరుపు
tr: kırmızı
ur: سرخ
zh_cn: 红色

source: white
es: blanco
fr: blanc
hi: सफेद
ja: 白
mr: पांढरा
pt: branco
te: తెల్లని
tr: beyaz
ur: سفید
zh_cn: 白色

source: black
es: negro
fr: noir
hi: काला
ja: 黒
mr: काळा
pt: preto
te: నలుపు
tr: siyah
ur: سیاہ .
zh_cn: 黑色

source: begin fill
es: iniciar relleno
fr: commence le remplissage
hi: भरना शुरू करें
ja: 記入を始める
mr: भरायची सुरुवात
pt: iniciar preenchimento
te: భరించడానికి ప్రారంభించండి
tr: doldurmaya başla
ur: بھرنا شروع کریں
zh_cn: 开始填充

source: end fill
es: Cargar proyecto desde archivo
fr: arrête le remplissage
hi: अंत भरें
ja: 記入を終わらせる
mr: भरायची अंत
pt: fim do preenchimento
te: భరించడానికి ముగింపు
tr: son dolgu
ur: آخر بھرنا
zh_cn: 停止填滿

source: background
es: rellenar pantalla
fr: le fond
hi: पृष्ठभूमि
ja: 背景
mr: बैक्ग्राउन्ड / मागे / पार्श्वभूमी
pt: plano de fundo
te: బ్యాక్‌గ్రౌండ్
tr: arka plan
ur: پس منظر
zh_cn: 背景

source: grey
es: gris
fr: gris
hi: ग्रे
ja: 灰色
mr: राखाडी
pt: cinza
te: రంగులు
tr: gri
ur: سرمئی
zh_cn: 灰色

source: The Grey block returns the current pen grey value.
es: El bloque gris devuelve el valor gris actual de la pluma.
fr: Le bloc Gris retourne la valeur de gris actuelle du stylo.
hi: ग्रे ब्लॉक वर्तमान पेन का ग्रे मूल्य लौटाता है।
mr: ग्रे ब्लॉक वर्तमान पेन राखाडी मूल्य परत करतो.
pt: O bloco Cinza retorna o valor atual da caneta cinza.
te: గ్రే బ్లాక్ ప్రస్తుత కలం గ్రే విలువను తరిస్తుంది.
tr: gri bloğu geçerli kalem gri değerini döndürür
ur: سرمئی بلاک موجودہ قلم کی سرمئی ویلیو واپس کرتا ہے۔
zh_cn: Grey 块返回当前画笔的灰度值。

source: shade
es: sombra
fr: l'ombre
hi: छाया
ja: シェード
mr: सावली
pt: sombra
te: ఛాయ
tr: gölge
ur: سایہ
zh_cn: 形狀

source: The Shade block returns the current pen shade value.
es: El bloque sombra devuelve la sombra actual de la pluma.
fr: Le bloc Ombre retourne la valeur d'ombre actuelle du stylo.
hi: छाया ब्लॉक वर्तमान पेन का छाया मूल्य लौटाता है।
mr: शेड ब्लॉक वर्तमान पेन शेड मूल्य परत करतो.
pt: O bloco Sombra retorna o valor atual da sombra da caneta.
te: షేడ్ బ్లాక్ ప్రస్తుత కలం ఛాయ విలువను తరిస్తుంది.
tr: gölge bloğu geçerli kalem gölge değerini döndürür
ur: شیڈ بلاک قلمی شیڈ کی موجودہ قدر واپس کرتا ہے۔
zh_cn: Shade 块返回当前画笔的明暗值。

source: color
fr: la couleur
hi: रंग
ja: いろ
mr: रंग
pt: cor
te: రంగు
tr: renk
ur: رنگ
zh_cn: 顏色

source: The Color block returns the current pen color.
es: El bloque color devuelve el color actual de la pluma.
fr: Le bloc Couleur retourne la couleur actuelle du stylo.
hi: रंग ब्लॉक वर्तमान पेन का रंग लौटाता है।
ja: <h2>ペンブロック</h2><br>げんざいのペンの色を、すうちでひょうじする。
mr: कलर ब्लॉक वर्तमान पेन रंग परत करतो.
pt: O bloco Cor retorna a cor atual da caneta.
te: కలం బ్లాక్ ప్రస్తుత కలం విలువను తరిస్తుంది.
tr: renk bloğu geçerli kalem rengini döndürür
ur: کلر بلاک موجودہ قلم کا رنگ لوٹاتا ہے۔
zh_cn: Color 块返回当前画笔颜色。

source: pen size
es: tamaño de la pluma
fr: épaisseur du trait
hi: पेन आकार
ja: ペンの大きさ
mr: पेन आकार
pt: largura do traço da caneta
te: పెన్ పరిమాణం
tr: kalem boyutu
ur: قلم کا سائز
zh_cn: 畫筆大小

source: The Pen size block returns the current pen size value.
es: El bloque tamaño de la pluma devuelve el tamaño actual de la pluma.
fr: Le bloc Taille du stylo retourne la valeur actuelle de la taille du stylo.
hi: पेन साइज ब्लॉक वर्तमान पेन का आकार मूल्य लौटाता है।
mr: पेन साइज ब्लॉक वर्तमान पेन आकार मूल्य परत करतो.
pt: O bloco largura da linha da Caneta retorna o atual valor do tamanho da caneta.
te: పెన్ సైజు బ్లాక్ ప్రస్తుత పెన్ పరిమాణం విలువను తరిస్తుంది.
tr: kalem boyutu bloğu geçerli kalem boyutu değerini döndürür
ur: قلم کا سائز بلاک موجودہ قلم کے سائز کی قدر لوٹاتا ہے۔
zh_cn: Pen size 块返回当前画笔大小的数值。

source: set font
es: fijar font
fr: définir la police
hi: फॉन्ट सेट करें
ja: フォントの設定
mr: फॉन्ट सेट करा
pt: definir fonte
te: ఫాంట్‌ను సెట్ చేయండి
tr: yazı tipini ayarla
ur: فونٹ سیٹ کریں
zh_cn: 设置字体

source: The Set font block sets the font used by the Show block.
es: El bloque fijar font establece el font utilizada por el bloque mostrar.
fr: Le bloc Définir la police définit la police utilisée par le bloc Afficher.
hi: सेट फॉन्ट ब्लॉक शो ब्लॉक द्वारा उपयोग किए जाने वाले फॉन्ट को सेट करता है।
mr: सेट फॉन्ट ब्लॉक शो ब्लॉकद्वारे वापरलेला फॉन्ट सेट करतो.
pt: O bloco Define fonte define a fonte usada pelo bloco Mostar.
te: సెట్ ఫాంట్ బ్లాక్ షో బ్లాక్ ఉపయోగిస్తున్న ఫాంట్‌ను సెట్ చేస్తుంది.
tr: set font bloğu show bloğu tarafından kullanılan yazı tipini ayarlar
ur: سیٹ فونٹ بلاک شو بلاک کے استعمال کردہ فونٹ کو سیٹ کرتا ہے۔
zh_cn: Set font 块设置 Show 块使用的字体。

source: The Background block sets the window background color.
es: El bloque Fondo establece el color de fondo de la ventana.
fr: Le bloc Fond définit la couleur de fond de la fenêtre.
hi: बैकग्राउंड ब्लॉक विंडो के पृष्ठभूमि का रंग सेट करता है।
ja: 背景ブロックは、カンバスの色をせっていする。
mr: बॅकग्राउंड ब्लॉक विंडो बॅकग्राउंड रंग सेट करतो.
te: బ్యాక్‌గ్రౌండ్ బ్లాక్ విండో బ్యాక్‌గ్రౌండ్ రంగును సెట్ చేస్తుంది.
tr: background bloğu pencere arka plan rengini ayarlar
ur: بیک گراؤنڈ بلاک ونڈو کے پس منظر کا رنگ سیٹ کرتا ہے۔
zh_cn: Background 块设置窗口背景颜色。

source: The Hollow line block creates a line with a hollow center.
es: El bloque de línea sin relleno crea una línea con un centro hueco.
fr: Le bloc Ligne creuse crée une ligne avec un centre creux.
hi: होलो लाइन ब्लॉक एक होलो केंद्र के साथ एक रेखा बनाता है।
mr: होलो लाइन ब्लॉक खोखळ्या केंद्रासह एक ओळ तयार करतो.
pt: O bloco linha Oca cria uma linha com um centro oco.
te: హాలో లైన్ బ్లాక్ హాలో సెంటర్ తో ఒక రేఖను సృష్టిస్తుంది.
tr: içi boş çizgi bloğu ortası boş bir çizgi oluşturur
ur: ہولو لائن بلاک کھوکھلی مرکز کے ساتھ ایک لائن بناتا ہے۔
zh_cn: Hollow line 块创建一条中空的线条。

source: hollow line
es: linea sin relleno
fr: ligne creuse
hi: होलो रेखा
ja: （中空の）線
pt: linha oca
te: హాలో లైన్
tr: içi boş çizgi
ur: کھوکھلی لائن
zh_cn: 中空线条

source: The Fill block fills in a shape with a color.
es: El bloque relleno rellena una forma con un color.
fr: Le bloc Remplissage remplit une forme avec une couleur.
hi: फिल ब्लॉक एक रंग के साथ एक आकृति को भरता है।
ja: <h2>ペンブロック</h2><br>ネズミがえがいた図形の内がわをぬりつぶす。
pt: O bloco de Preencher preenche uma forma com uma cor.
te: ఫిల్ బ్లాక్ రంగుతో ఒక ఆకారాన్ని భరిస్తుంది.
tr: dolgu bloğu bir şekli bir renkle doldurur
ur: فل بلاک رنگ کے ساتھ ایک شکل میں بھرتا ہے۔
zh_cn: Fill 块用颜色填充图形。

source: fill
es: relleno
fr: remplir
hi: भरें
ja: ぬりつぶす
pt: preencher
te: భరించు
tr: doldur
ur: بھرنا
zh_cn: 填充

source: pen up
es: subir pluma
fr: crayon levé
hi: पेन ऊपर
ja: ペンを上げる
mr: लोखणी वर करा
pt: levantar caneta
te: కలం పట్టుకొను
tr: kalem yukarı
ur: قلم اٹھاو
zh_cn: 提筆

source: The Pen-up block raises the pen so that it does not draw.
es: El bloque Subir pluma levanta la pluma para que no dibuje.
fr: Le bloc Crayon levé soulève le crayon pour qu'il ne dessine pas.
hi: पेन-अप ब्लॉक पेन को उठाता है ताकि यह ड्रा न करे।
ja: <h2>ペンブロック</h2><br>ネズミの動きに合わせて線をえがくことをやめる。
pt: O bloco Caneta-erquida levanta a caneta para que ela não desenhe.
te: పెన్-అప్ బ్లాక్ పెన్ను ఎగుపెడతాయి, అది దారిచేయడం లేదు.
ur: پین اپ بلاک قلم کو اٹھاتا ہے تاکہ یہ نہ کھینچے۔
zh_cn: Pen-up 块抬起画笔，使其不绘图。

source: pen down
es: bajar pluma
fr: crayon abaissé
hi: पेन नीचे
ja: ペンを下ろす
mr: लोखणी खाली ठेवा
pt: baixar caneta
te: కలం పక్కనపెట్టు
tr: kalem aşağı
ur: قلم نیچے
zh_cn: 落筆

source: The Pen-down block lowers the pen so that it draws.
es: El bloque de Haciar pluma abajo baja la pluma para que dibuje.
fr: Le bloc Crayon abaissé abaisse le crayon pour qu'il dessine.
hi: पेन-डाउन ब्लॉक पेन को नीचे ले जाता है ताकि यह ड्रा करे।
ja: <h2>ペンブロック</h2><br>ネズミの動きに合わせて線をえがく。
pt: O bloco Caneta-para-baixo abaixa a caneta para que ela desenhe.
te: పెన్-డౌన్ బ్లాక్ పెన్ను కలిగిస్తుంది, అది దారిచేయడంలేదు.
ur: پین-ڈاؤن بلاک قلم کو نیچے کرتا ہے تاکہ یہ کھینچے۔
zh_cn: Pen-down 块放下画笔，使其开始绘图。

source: set pen size
es: fijar pluma
fr: fixe l'épaisseur du crayon
hi: पेन आकार सेट करें
ja: 太さをせってい
mr: लोखणीचे आकार संच करा
pt: definir largura do traço da caneta
te: కలం పరిమాణాన్ని అమర్చు
tr: kalem boyutunu ayarla
ur: قلم کا سائز مقرر کریں
zh_cn: 設定畫筆大小

source: The Set-pen-size block changes the size of the pen.
es: El bloque Fijar tamaño de la pluma de ajuste cambia el tamaño de la pluma.
fr: Le bloc Définir la taille du crayon change la taille du crayon.
hi: सेट-पेन-साइज ब्लॉक पेन के आकार को बदलता है।
ja: <h2>ペンブロック</h2><br>ネズミがえがく線の太さをせっていする。太さには、0より大きいあたいを使う。
pt: O bloco Definir-largura-do-traço altera a largura do traço da caneta.
te: సెట్-పెన్-సైజ్ బ్లాక్ పెన్ పరిమాణం మార్చిపెడతాయి.
ur: سیٹ قلم کے سائز کا بلاک قلم کا سائز تبدیل کرتا ہے۔
zh_cn: Set-pen-size 块更改画笔的大小。

source: set translucency
es: fijar translucidez
fr: définir la translucidité
hi: पारदर्शिता सेट करें
ja: 透明度を設定
pt: definir transparência
te: పారదర్శకతను సెట్ చేయండి.
tr: yarı saydamlığı ayarla
ur: پارباسی مقرر کریں
zh_cn: 设置透明度

source: The Set translucency block changes the opacity of the pen.
es: El bloque fijar translucidez cambia la opacidad de la pluma.
fr: Le bloc Définir la translucidité change l'opacité du crayon.
hi: सेट ट्रांसलूसेंसी ब्लॉक पेन की अपारदर्शिता को बदलता है।
ja: <h2>ペンブロック</h2><br>ネズミがえがく線がどのくらいすきとおるかをせっていする。すうちが大きいほど、線がすきとおる。
pt: O bloco Definir translúcido altera a opacidade da caneta.
te: సెట్ పారదర్శకత బ్లాక్ పెన్ అస్పష్టతను మార్చిపెడతాయి.
tr: set translucency bloğu kalemin opaklığını değiştirir
ur: سیٹ ٹرانسلوسینسی بلاک قلم کی دھندلاپن کو تبدیل کرتا ہے۔
zh_cn: Set translucency 块更改画笔的不透明度。

source: set hue
es: fijar matiz
fr: fixer la teinte
hi: रंग सेट करें
ja: 色相を設定
pt: definir matiz
te: హ్యూ ను సెట్ చేయండి.
tr: renk tonu ayarla
ur: رنگ مقرر کریں
zh_cn: 设置色相

source: The Set hue block changes the color of the pen.
es: El bloque fijar matiz cambia la color de la pluma.
fr: Le bloc Définir la teinte change la couleur du crayon.
hi: सेट ह्यू ब्लॉक पेन का रंग बदलता है।
pt: O bloco Definir matiz altera a cor da caneta.
te: సెట్ హ్యూ బ్లాక్ పెన్ రంగును మార్చిపెడతాయి.
tr: set hue bloğu kalemin rengini değiştirir
ur: سیٹ ہیو بلاک قلم کا رنگ بدلتا ہے۔
zh_cn: Set hue 块改变画笔的颜色。

source: set shade
es: fijar sombra
fr: fixer l'ombre
hi: छाया सेट करें
ja: 色のこさをせってい
mr: रंगाचा दर्जा निश्चीत करा
pt: definir sombra
te: ఛాయను అమర్చు
tr: gölge ayarla
ur: سایہ مقرر کریں
zh_cn: 設定填滿顏色

source: The Set-shade block changes the pen color from dark to light.
es: El bloque Fijar sombra cambia el color de la pluma de oscuro a claro.
fr: Le bloc Définir l'ombre change la couleur du crayon du foncé au clair.
hi: सेट-शेड ब्लॉक पेन का रंग काले से लाइट में बदलता है।
ja: <h2>ペンブロック</h2><br>ネズミがえがく線の色のこさをせっていする。
pt: O bloco Definir-sombra muda a cor da caneta de escuro para claro.
te: సెట్-షేడ్ బ్లాక్ పెన్ రంగును అంగడానికి మార్చిపెడతాయి.
ur: سیٹ شیڈ بلاک قلم کے رنگ کو گہرے سے ہلکے میں بدل دیتا ہے۔
zh_cn: Set-shade 块改变画笔颜色的明暗度。

source: set grey
es: fijar gris
fr: fixer gris
hi: ग्रे सेट करें
ja: 灰色を設定
mr: राखाडी संच करा
pt: definir cinza
te: గ్రే ను సెట్ చేయండి.
tr: griyi ayarla
ur: سرمئی سیٹ کریں
zh_cn: 设置灰度

source: The Set grey block changes the vividness of the pen color.
es: El bloque fijar gris cambia la intensidad de la pluma.
fr: Le bloc Définir gris change la vivacité de la couleur du crayon.
hi: सेट ग्रे ब्लॉक पेन के रंग की चमक को बदलता है।
pt: O bloco Definir cinza altera a vivacidade da cor da caneta.
te: సెట్ గ్రే బ్లాక్ పెన్ రంగును బృహదరంగా మార్చిపెడతాయి.
tr: ayarlanan gri blok kalem renginin canlılığını değiştirir
ur: سیٹ گرے بلاک قلم کی رنگت کو بدل دیتا ہے۔
zh_cn: Set grey 块改变画笔颜色的鲜艳度。

source: set color
es: fijar color
fr: fixer la couleur
hi: रंग सेट करें
ja: 色をせってい
mr: रंग संच करणे
pt: definir cor
te: వర్ణాన్ని అమర్చు
tr: renk ayarla
ur: رنگ مقرر کریں
zh_cn: 設定線條顏色

source: The Set-color block changes the pen color.
es: El bloque fijar color cambia el color de la pluma.
fr: Le bloc Définir la couleur change la couleur du crayon.
hi: सेट-कलर ब्लॉक पेन का रंग बदलता है।
ja: <h2>ペンブロック</h2><br>ネズミがえがく線の色をせっていする。色は画面上で選ぶほか、それぞれすうちで決めることもできる。色は、0以上で、100より小さいあたいになる。
pt: O bloco Define-cor muda a cor da caneta.
te: సెట్-రంగు బ్లాక్ పెన్ రంగును మార్చిపెడతాయి.
ur: سیٹ کلر بلاک قلم کا رنگ بدلتا ہے۔
zh_cn: Set-color 块改变画笔颜色。

source: The Input block prompts for keyboard input.
es: El bloque de entrada solicita la entrada del teclado.
fr: Le bloc Entrée demande une entrée au clavier.
hi: इनपुट ब्लॉक कुंजीपटल इनपुट के लिए प्रॉम्प्ट करता है।
mr: इनपुट ब्लॉक कीबोर्ड इनपुटची विनंती करतो.
te: ఇన్‌పుట్ బ్లాక్ కీబోర్డ్ ఇన్‌పుట్ కోసం అడ్డం అంచనా ఇస్తుంది.
tr: giriş bloğu klavye girişi ister
ur: ان پٹ بلاک کی بورڈ ان پٹ کے لیے اشارہ کرتا ہے۔
zh_cn: Input 块提示键盘输入。

source: input
es: el input
fr: entrée
hi: इनपुट
ja: インプット
mr: इनपुट
te: ఇన్‌పుట్
tr: girdi
ur: ان پٹ
zh_cn: 输入

source: Input a value
es: ingrese un valor
fr: Saisir une valeur
hi: एक मूल्य इनपुट करें
ja: 価値をインプット
mr: किमत प्रविष्ट करा
te: ఒక విలువ నమోదు చేయండి
tr: bir değer girin
ur: ایک قدر درج کریں۔
zh_cn: 输入一个值

source: input value
es: valor de entrada
fr: valeur d'entrée
hi: इनपुट मूल्य
ja: インプットの価値
mr: इनपुट किमत
te: ఇన్‌పుట్ విలువ
tr: giriş değeri
ur: ان پٹ قدر
zh_cn: 输入值

source: The Input-value block stores the input.
es: El bloque de valor de entrada almacena la entrada.
fr: Le bloc Valeur d'entrée stocke l'entrée.
hi: इनपुट-मूल्य ब्लॉक इनपुट को संग्रहित करता है।
mr: इनपुट-मूल्य ब्लॉक इनपुट संग्रहित करतो.
te: ఇన్‌పుట్-విలువ బ్లాక్ ఇన్‌పుట్‌ను భండారిస్తుంది.
ur: ان پٹ ویلیو بلاک ان پٹ کو اسٹور کرتا ہے۔
zh_cn: Input-value 块存储输入内容。

source: loudness
es: volumen
fr: volume
hi: आवाज़ की उंचाई
ja: 音量
mr: जॊरत
pt: intensidade
te: అలాటే
tr: ses yüksekliği
ur: زور
zh_cn: 音量

source: The Loudness block returns the volume detected by the microphone.
es: El bloque Volumen devuelve el volumen detectado por el micrófono.
fr: Le bloc Volume renvoie le volume détecté par le microphone.
hi: ध्वनि माइक्रोफ़ोन द्वारा पहचाने गए आवाज़ को लौडनेस ब्लॉक द्वारा लौटाता है।
mr: लाऊडनेस ब्लॉक मायक्रोफोनद्वारे शोधलेला आवाज परतवतो.
pt: O bloco Sonoridade retorna o volume detectado pelo microfone.
te: లౌడ్నెస్ బ్లాక్ మైక్రోఫోన్ ద్వారా గుర్తించబడిన వాల్యూమ్‌ను తరపుచుకుపడిస్తుంది.
tr: loudness bloğu mikrofon tarafından algılanan ses seviyesini döndürür
ur: لاؤڈنیس بلاک مائیکروفون کے ذریعے پتہ چلا حجم واپس کرتا ہے۔
zh_cn: Loudness 块返回麦克风检测到的音量。

source: click
fr: clic
hi: क्लिक
ja: クリック
mr: क्लिक
pt: clique
te: క్లిక్
tr: klik
ur: کلک کریں
zh_cn: 点击

source: The Click block triggers an event if a mouse has been clicked.
es: El bloque Click activa un evento si se ha hecho clic en un ratón.
fr: Le bloc Clic déclenche un événement si une souris a été cliquée.
hi: क्लिक ब्लॉक एक घटना को ट्रिगर करता है अगर माउस पर क्लिक किया गया है।
mr: क्लिक ब्लॉक माऊस क्लिक झाल्यास एक इव्हेंट ट्रिगर करतो.
te: క్లిక్ బ్లాక్ మౌస్ పై క్లిక్ చేసినా ఒక ఈవెంట్‌ను తెరిచేస్తుంది.
tr: fare tıklandığında tıklama bloğu bir olayı tetikler
ur: کلک بلاک ایک ایونٹ کو متحرک کرتا ہے اگر ماؤس پر کلک کیا گیا ہو۔
zh_cn: Click 块在鼠标被点击时触发事件。

source: The Click block triggers an event if a turtle has been clicked.
es: El bloque Click activa un evento si se ha hecho clic en una tortuga.
fr: Le bloc Clic déclenche un événement si une tortue a été cliquée.
hi: क्लिक ब्लॉक एक घटना को ट्रिगर करता है अगर कछुआ पर क्लिक किया गया है।
mr: क्लिक ब्लॉक कासव क्लिक झाल्यास एक इव्हेंट ट्रिगर करतो.
te: క్లిక్ బ్లాక్ టర్టిల్ పై క్లిక్ చేసినా ఒక ఈవెంట్‌ను తెరిచేస్తుంది.
tr: bir kaplumbağa tıklandığında tıklama bloğu bir olayı tetikler
ur: کلک بلاک ایک ایونٹ کو متحرک کرتا ہے اگر کچھوے پر کلک کیا گیا ہے۔
zh_cn: Click 块在乌龟被点击时触发事件。

source: cursor over
es: cursor sobre
fr: curseur sur
hi: कर्सर ओवर
ja: カーソル（上）
mr: कर्सर ओवर
te: కర్సర్ మీద
tr: imleç üzerine
ur: کرسر ختم
zh_cn: 光标悬停

source: cursor out
es: cursor fuera
fr: curseur dehors
hi: कर्सर आउट
ja: カーソル（外）
mr: कर्सर बाहेर
te: కర్సర్ బయటకి
tr: imleç dışarı
ur: کرسر باہر
zh_cn: 光标移出

source: cursor button down
es: el botón presionado
fr: bouton du curseur enfoncé
hi: कर्सर बटन नीचे
ja: カーソルクリック（下）
mr: कर्सर बटण खाली
te: కర్సర్ బటన్ డౌన్
tr: imleç düğmesi aşağı
ur: کرسر بٹن نیچے
zh_cn: 光标按钮按下

source: cursor button up
es: el botón arriba
fr: bouton du curseur relâché
hi: कर्सर बटन ऊपर
ja: カーソルクリック（上）
mr: कर्सर बटण वर
te: కర్సర్ బటన్ అప్
tr: imleç düğmesi yukarı
ur: کرسر بٹن اوپر
zh_cn: 光标按钮抬起

source: The Get red block returns the red component of the pixel under the mouse.
es: El bloque Obtener rojo devuelve el componente rojo del píxel debajo del ratón.
fr: Le bloc Obtenir rouge renvoie la composante rouge du pixel sous la souris.
hi: गेट रेड ब्लॉक माउस के नीचे पिक्सेल का लाल घटक वापस करता है।
mr: गेट रेड ब्लॉक माऊसखालील पिक्सेलचा लाल घटक परतवतो.
pt: O bloco Obtenha vermelho retorna o componente vermelho do pixel sob o ratinho.
te: గెట్ రెడ్ బ్లాక్ మౌస్ కంపోజన్ట్‌ని తెరిచిపెట్టుతుంది.
tr: get red bloğu farenin altındaki pikselin kırmızı bileşenini döndürür
ur: گیٹ ریڈ بلاک ماؤس کے نیچے پکسل کے سرخ جز کو لوٹاتا ہے۔
zh_cn: Get red 块返回鼠标下像素的红色分量。

source: The Get red block returns the red component of the pixel under the turtle.
es: El bloque Obtener rojo devuelve el componente rojo del píxel debajo de la tortuga.
fr: Le bloc Obtenir rouge renvoie la composante rouge du pixel sous la tortue.
hi: गेट रेड ब्लॉक कछुआ के नीचे पिक्सेल का लाल घटक वापस करता है।
mr: गेट रेड ब्लॉक कासवाखालील पिक्सेलचा लाल घटक परतवतो.
te: గెట్ రెడ్ బ్లాక్ టర్టిల్ కంపోజన్ట్‌ని తెరిచిపెట్టుతుంది.
tr: get red bloğu kaplumbağanın altındaki pikselin kırmızı bileşenini döndürür
ur: گیٹ ریڈ بلاک کچھوے کے نیچے پکسل کا سرخ جزو لوٹاتا ہے۔
zh_cn: Get red 块返回乌龟下方像素的红色分量。

source: pixel color
es: color del pixel
fr: couleur du pixel
hi: पिक्सेल का रंग
ja: ピクセルの色
mr: पिक्सेल रंग
pt: cor do pixel
te: పిక్సెల్ రంగు
tr: piksel rengi
ur: پکسل کا رنگ
zh_cn: 像素颜色

source: The Get pixel block returns the color of the pixel under the mouse.
es: El bloque Obtener píxel devuelve el color del píxel debajo del ratón.
fr: Le bloc Obtenir pixel renvoie la couleur du pixel sous la souris.
hi: गेट पिक्सेल ब्लॉक माउस के नीचे पिक्सेल का रंग वापस करता है।
mr: गेट पिक्सेल ब्लॉक माऊसखालील पिक्सेलचा रंग परतवतो.
pt: O bloco Obtenha pixel retorna a cor do pixel sob o ratinho.
te: గెట్ పిక్సెల్ బ్లాక్ మౌస్ కంపోజన్ట్‌ని తెరిచిపెట్టుతుంది.
tr: get pixel bloğu farenin altındaki pikselin rengini döndürür
ur: پکسل کا رنگ
zh_cn: Get pixel 块返回鼠标下像素的颜色。

source: The Get pixel block returns the color of the pixel under the turtle.
es: El bloque Obtener píxel devuelve el color del píxel debajo de la tortuga.
fr: Le bloc Obtenir pixel renvoie la couleur du pixel sous la tortue.
hi: गेट पिक्सेल ब्लॉक कछुआ के नीचे पिक्सेल का रंग वापस करता है।
mr: गेट पिक्सेल ब्लॉक कासवाखालील पिक्सेलचा रंग परतवतो.
te: గెట్ పిక్సెల్ బ్లాక్ టర్టిల్ కంపోజన్ట్‌ని తెరిచిపెట్టుతుంది.
tr: get pixel bloğu kaplumbağanın altındaki pikselin rengini döndürür
ur: گیٹ پکسل بلاک کچھوے کے نیچے پکسل کا رنگ لوٹاتا ہے۔
zh_cn: Get pixel 块返回乌龟下像素的颜色。

source: time
es: tiempo
fr: temps
hi: समय
ja: 時間
mr: वेळ
pt: tempo
te: సమయం
tr: zaman
ur: وقت
zh_cn: 時間

source: cursor y
fr: curseur y
hi: कर्सर वाई
ja: yざひょうち（カーソル）
mr: कर्सर y
te: కర్సర్ Y
tr: imleç y
ur: کرسر y
zh_cn: 光标Y坐标

source: The Cursor Y block returns the vertical position of the mouse.
es: El bloque Cursor Y devuelve la posición vertical del cursor.
fr: Le bloc Curseur Y renvoie la position verticale de la souris.
hi: कर्सर वाई ब्लॉक माउस का उदाहरण दिखाता है।
ja: <h2>すうちブロック（カーソル）</h2><br>マウスカーソルのたて位置を表すｙざひょうち。<br>図の例は、ネズミを使って画面上に自由に線をえがけるプログラム。ネズミがパソコンのマウスカーソルの位置にいどうし続けつつ、マウスをおしているときだけペンをおろし、線をえがく。
mr: कर्सर Y ब्लॉक माऊसची उभी स्थिती परतवतो.
pt: O bloco Cursor Y retorna a posição vertical do ratinho.
te: కర్సర్ Y బ్లాక్ మౌస్ యొక్క కూడా స్థితిని తెరిచిపెట్టుతుంది.
tr: cursor y bloğu farenin dikey konumunu döndürür
ur: کرسر Y بلاک ماؤس کی عمودی پوزیشن کو لوٹاتا ہے۔
zh_cn: Cursor Y 块返回鼠标的垂直位置。

source: cursor x
fr: curseur x
hi: कर्सर एक्स
ja: xざひょうち（カーソル）
mr: कर्सर x
te: కర్సర్ X
tr: imleç x
ur: کرسر ایکس
zh_cn: 光标X坐标

source: The Cursor X block returns the horizontal position of the mouse.
es: El bloque Cursor X devuelve la posición horizontal del ratón.
fr: Le bloc Curseur X renvoie la position horizontale de la souris.
hi: कर्सर एक्स ब्लॉक माउस का क्षैतिज स्थान वापस करता है।
ja: <h2>すうちブロック（カーソル）</h2><br>マウスカーソルの横位置を表すｘざひょうち。<br>図の例は、ネズミを使って画面上に自由に線をえがけるプログラム。ネズミがパソコンのマウスカーソルの位置にいどうし続けつつ、マウスをおしているときだけペンをおろし、線をえがく。
mr: कर्सर X ब्लॉक माऊसची आडवी स्थिती परतवतो.
pt: O bloco Cursor X retorna a posição horizontal do ratinho.
te: కర్సర్ X బ్లాక్ మౌస్ యొక్క కూడా స్థితిని తెరిచిపెట్టుతుంది.
tr: cursor x bloğu farenin yatay konumunu döndürür
ur: کرسر ایکس بلاک ماؤس کی افقی پوزیشن واپس کرتا ہے۔
zh_cn: Cursor X 块返回鼠标的水平位置。

source: mouse button
es: botón del ratón
fr: bouton de la souris
hi: माउस बटन
ja: マウスボタン
mr: माऊस बटण
pt: botão do ratinho
te: మౌస్ బటన్
tr: fare düğmesi
ur: ماؤس بٹن
zh_cn: 鼠标按钮
