Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Default block is used inside of a Switch to define the default action.
es: El bloque predeterminado se usa dentro de un bloque de switch para definir la acción predeterminada.
fr: Le bloc Par défaut est utilisé à l'intérieur d'un Switch pour définir l'action par défaut.
hi: डिफ़ॉल्ट ब्लॉक स्विच के भीतर डिफ़ॉल्ट क्रिया को परिभाषित करने के लिए उपयोग किया जाता है।
mr: डिफॉल्ट ब्लॉक स्विचच्या आत डिफॉल्ट क्रिया परिभाषित करण्यासाठी वापरला जातो.
te: డిఫాల్ట్ బ్లాక్ స్విచ్లో డిఫాల్ట్ యాక్షన్‌ను నిర్వచించడానికి ఉపయోగిస్తారు.
tr: default bloğu
ur: پہلے سے طے شدہ کارروائی کی وضاحت کے لئے ڈیفالٹ بلاک سوئچ کے اندر استعمال ہوتا ہے۔
zh_cn: Default 块用于 Switch 内定义默认操作。

source: default
es: el caso de forma predeterminada
fr: par défaut
hi: डिफ़ॉल्ट
ja: ひょうじゅん
mr: मूलभूत
pt: padrão
te: డిఫాల్ట్
tr: varsayılan
ur: پہلے سے طے شدہ
zh_cn: 默认

source: The Case Block must be used inside of a Switch Block.
es: El bloque Caso debe utilizarse dentro de un bloque de switch.
fr: Le bloc Cas doit être utilisé à l'intérieur d'un bloc Switch.
hi: केस ब्लॉक स्विच ब्लॉक के भीतर ही उपयोग किया जाना चाहिए।
ja: ケースブロックはスイッチブロックの中にある必要があります。
mr: केस ब्लॉक स्विच ब्लॉकच्या आत वापरले पाहिजे.
pt: O Bloco de Casos deve ser usado dentro de um Bloco de Trocas
te: కేస్ బ్లాక్ స్విచ్ బ్లాక్ లో ఉపయోగించాలి.
tr: case bloğu bir switch bloğunun içinde kullanılmalıdır
ur: کیس بلاک کو سوئچ بلاک کے اندر استعمال کرنا چاہئے۔
zh_cn: Case 块必须在 Switch 块内使用。

source: The Case block is used inside of a Switch to define matches.
es: El bloque Caso se utiliza dentro de un interruptor para definir coincidencias.
fr: Le bloc Cas est utilisé à l'intérieur d'un Switch pour définir des correspondances.
hi: केस ब्लॉक स्विच के भीतर मैच को परिभाषित करने के लिए उपयोग किया जाता है।
mr: केस ब्लॉक स्विचच्या आत मॅचेस परिभाषित करण्यासाठी वापरला जातो.
pt: O bloco Caso é usado dentro de Trocar para definir correspondências.
te: కేస్ బ్లాక్ ఒక స్విచ్‌లో మ్యాచ్‌లను నిర్వచించడానికి ఉపయోగిస్తారు.
tr: case bloğu eşleşmeleri tanımlamak için bir anahtarın içinde kullanılır
ur: کیس بلاک میچوں کی وضاحت کے لئے سوئچ کے اندر استعمال ہوتا ہے۔
zh_cn: Case 块用于 Switch 内定义匹配项。

source: case
es: caso
fr: cas
hi: केस
ja: ケース
mr: केस
pt: capa
te: కేస్
ur: کیس
zh_cn: 情况

source: The Switch block will run the code in the matching Case.
es: El bloque Switch ejecutará el código en el caso correspondiente.
fr: Le bloc Switch exécutera le code dans le cas correspondant.
hi: स्विच ब्लॉक मैचिंग केस में कोड चलाएगा।
mr: स्विच ब्लॉक मॅचिंग केसमधील कोड चालवेल.
pt: O bloco Trocar executará o código no caso correspondente.
te: స్విచ్ బ్లాక్ అనుగుణమైన కేస్ లో కోడ్‌ను అమలు చేస్తుంది.
tr: switch bloğu kodu eşleşen durumda çalıştıracaktır
ur: سوئچ بلاک مماثل کیس میں کوڈ چلائے گا۔
zh_cn: Switch 块将运行匹配 Case 中的代码。

source: switch
hi: स्विच
ja: スイッチ
mr: स्विच
pt: trocar
te: స్విచ్
tr: anahtar
ur: سوئچ
zh_cn: 切换

source: The Stop block will stop a loop
es: El bloque Parar detendrá un bucle.
fr: Le bloc Arrêter arrêtera une boucle
hi: स्टॉप ब्लॉक एक लूप को रोक देगा
mr: स्टॉप ब्लॉक लूप थांबवेल
pt: O bloco Parar interromperá uma repetição
te: స్టాప్ బ్లాక్ లూప్‌ను నిలిపివేస్తుంది
tr: stop bloğu bir döngüyü durduracaktır
ur: اسٹاپ بلاک ایک لوپ روک دے گا
zh_cn: Stop 块将停止循环

source: Forever, Repeat, While, or Until.
es: Por siempre, Repetir, Mientras o Hasta.
fr: Toujours, Répéter, Tant que, ou Jusqu'à.
hi: हमेशा, दोहराएँ, जब तक, या जब तक नहीं।
mr: कायम, पुन्हा, ज्यावेळी, किंवा जोपर्यंत.
pt: Para sempre, Repetir, Enquanto ou Até.
te: ఎప్పటికీ, పునరావర్తనం, పరిస్థితి, లేదా అంతకుముందు.
tr: forever
ur: ہمیشہ کے لئے ، دہرائیں ، جبکہ ، یا تک۔
zh_cn: Forever、Repeat、While 或 Until。

source: The Waitfor block will wait until the condition is true.
es: El bloque Esperar esperará hasta que la condición sea verdadera.
fr: Le bloc Attendre jusqu'à attendra jusqu'à ce que la condition soit vraie.
hi: वेटफॉर ब्लॉक स्थिति सत्य होने तक प्रतीक्षा करेगा।
mr: वेटफॉर ब्लॉक स्थिती खरे होईपर्यंत थांबेल.
pt: O bloco Esperarpor esperará até o momento em que a condição seja verdadeira.
te: వేయిట్‌ఫార్ బ్లాక్ అవసరమైన స్థితి కి వేచికాదు.
tr: waitfor bloğu koşul doğru olana kadar bekleyecektir
ur: انتظار کا بلاک اس وقت تک انتظار کرے گا جب تک کہ حالت درست نہ ہو۔
zh_cn: Waitfor 块将等待直到条件为真。

source: wait for
es: esperar hasta
fr: attendre
hi: अज्ञात
ja: を待つ
mr: प्रतीक्षा करा
pt: esperar por
te: వేచికాడు
tr: bekle
ur: انتظار کریں
zh_cn: 等待

source: The Until block will repeat until the condition is true.
es: El bloque Hasta se repetirá hasta que la condición sea verdadera.
fr: Le bloc Jusqu'à répétera jusqu'à ce que la condition soit vraie.
hi: अंत तक स्थिति सत्य होने तक दोहराएगा।
mr: अनटिल ब्लॉक स्थिती खरे होईपर्यंत पुन्हा करेल.
pt: O bloco Até repetirá até o momento em que a condição seja verdadeira.
te: అంతకుముందు స్థితి నిజమేనంతలే పునరావృత్తి చేస్తుంది.
tr: until bloğu koşul doğru olana kadar tekrar edecektir
ur: جب تک کہ حالت درست نہ ہو تب تک بلاک دہرائے گا۔
zh_cn: Until 块将重复直到条件为真。

source: until
es: hasta
fr: jusqu'à
hi: जब तक
ja: までに
mr: जोपर्यंत
pt: até
te: అప్పటివరకు
ur: تک
zh_cn: 直到

source: do2
es: hacer
fr: faire2
hi: करें2
ja: ～する
mr: करा2
pt: fazer2
te: చేస్తాం2
ur: 2 کرو
zh_cn: 执行2

source: do
es: hacer
fr: faire
hi: करें
ja: アクション
mr: करा
pt: fazer
te: డూ
ur: کرو
zh_cn: 执行

source: The While block will repeat while the condition is true.
es: El bloque Mientras se repetirá mientras la condición sea verdadera.
fr: Le bloc Tant que répétera tant que la condition est vraie.
hi: जब तक शर्त सत्य है, तब तक व्हाइल ब्लॉक दोहराएगा।
mr: व्हाईल ब्लॉक स्थिती खरे असताना पुन्हा करेल.
pt: O bloco Enquanto repetirá enquanto a condição for verdadeira.
te: ఈ పరిస్థితి నిజమేనంతలే విరుపములను పునరావృత్తి చేస్తుంది.
tr: while bloğu koşul doğru olduğu sürece tekrar edecektir
ur: جبکہ بلاک دہرایا جائے گا جبکہ حالت درست ہے۔
zh_cn: While 块在条件为真时重复执行。

source: while
es: mientras
fr: tant que
hi: जबकि
ja: の間に
mr: ज्यावेळी
pt: enquanto
te: రాయు
ur: جبکہ
zh_cn: 同時間

source: In this example if the mouse button is pressed a snare drum will play.
es: En este ejemplo, si se presiona el botón del mouse, se reproducirá una caja.
fr: Dans cet exemple, si le bouton de la souris est enfoncé, une caisse claire jouera.
hi: इस उदाहरण में यदि माउस बटन दबाया जाता है तो एक स्नेयर ड्रम बजेगा।
ja: <br><br>図の例では、もし、パソコンのマウスを長おししていれば「キックドラム」ブロックをえんそうする。
mr: या उदाहरणात जर माउस बटण दाबले गेले तर एक स्नेर ड्रम वाजेल.
pt: Neste exemplo, se o botão do mouse for pressionado, uma batida de caixa será executada.
te: ఈ ఉదాహరణలో మౌస్ బటన్ నొక్కితే స్నేర్ డ్రమ్ ప్లే అవుతుంది.
tr: bu örnekte fare düğmesine basılırsa trampet çalacaktır
ur: اس مثال میں اگر ماؤس کے بٹن کو دبایا جاتا ہے تو ایک سنیئر ڈرم کھیلے گا۔
zh_cn: 在此示例中，如果按下鼠标按钮，将播放军鼓。

source: if
es: si
fr: si
hi: यदि
ja: もし
mr: जर
pt: se
te: ఒక వేళ
tr: eğer
ur: اگر
zh_cn: 若

source: then
es: entonces
fr: alors
hi: तब
ja: ならば
mr: नंतर
pt: então
te: అయితే
tr: o zaman
ur: پھر
zh_cn: 則

source: else
es: sino
fr: sinon
hi: अन्यथा
ja: でなければ
mr: इतर
pt: ou
ur: ورنہ
zh_cn: 否則

source: The Forever block will repeat the contained blocks forever.
es: El bloque Por siempre repetirá los bloques contenidos para siempre.
fr: Le bloc Toujours répétera les blocs contenus à l'infini.
hi: हमेशा के लिए फॉरएवर ब्लॉक निहित ब्लॉक्स को हमेशा के लिए दोहराएगा।
ja: <h2>実行ブロック（くり返し）</h2><br>「ずっとくり返す」のブロックは、実行を停止しないかぎり、はさまれているブロックをくり返し実行する。
mr: फॉरएव्हर ब्लॉक समाविष्ट केलेले ब्लॉक्स कायमच्या वेळकरिता पुन्हा करेल.
pt: O bloco Forever irá repetir os blocos contidos para sempre.
te: ఫారెవర్ బ్లాక్ అంతకుముందు ఉన్న బ్లాక్‌లను ఎప్పటికీ పునరావృత్తి చేస్తుంది.
tr: forever bloğu içerdiği blokları sonsuza kadar tekrarlayacaktır
ur: ہمیشہ کے لئے بلاک موجود بلاکس کو ہمیشہ کے لئے دہرائے گا۔
zh_cn: Forever 块将无限重复包含的块。

source: forever
es: por siempre
fr: toujours
hi: हमेशा के लिए
ja: ずっとくり返す
mr: कायमच
pt: para sempre
te: ఎప్పటికీ
tr: sonsuza kadar
ur: ہمیشہ کے لئے
zh_cn: 持續執行

source: The Repeat block will repeat the contained blocks.
es: El bloque Repetir repetirá los bloques contenidos.
fr: Le bloc Répéter répétera les blocs contenus.
hi: रीपीट ब्लॉक निहित ब्लॉक्स को दोहराएगा।
ja: <h2>実行ブロック（くり返し）</h2><br>はさまれているブロックのプログラムを、入力した回数だけくり返す。
mr: रीपीट ब्लॉक मध्ये असलेल्या ब्लॉकला पुन्हा पुन्हा चालवेल.
pt: O bloco Repetir repetirá os blocos contidos.
te: పునరావృత్తి బ్లాక్ పొందిన బ్లాక్‌లను పునరావృత్తిలో చేయి.
tr: tekrar bloğu içerdiği blokları tekrarlayacaktır
ur: ریپیٹ بلاک موجود بلاکس کو دہرائے گا۔
zh_cn: Repeat 块将重复包含的块。

source: In this example the note will be played 4 times.
es: En este ejemplo la nota se tocará 4 veces.
fr: Dans cet exemple, la note sera jouée 4 fois.
ja: <br><br>図の例では、「ソ」の音が４回えんそうされる。
mr: या उदाहरणात नोट ४ वेळा वाजवली जाईल.
pt: Neste exemplo, a nota será executada 4 vezes.
te: ఈ ఉదాహరణలో నోట్‌ను 4 సార్లు ప్లే చేయబడుతుంది.
tr: bu örnekte nota 4 kez çalınacaktır
ur: اس مثال میں نوٹ 4 بار کھیلا جائے گا۔
zh_cn: 在此示例中，该音符将播放 4 次。

source: repeat
es: repetir
fr: répéter
hi: दोहराएँ
ja: ～回くり返す
mr: पुन्हा
pt: repetir
te: మళ్ళీ చేయి
tr: tekrar
ur: دوبارہ دہرائیں
zh_cn: 重複

source: duplicate factor
es: duplicar factor
fr: facteur de
hi: प्रतिलिपि कारक
ja: 複製ファクター
mr: डुप्लिकेट फॅक्टर
pt: duplicar fator
te: ఎంపికలు ఏమిటి ఎంపిక చేసేందుకు ఉపయోగపడే అంశం
tr: yinelenen faktör
ur: ڈپلیکیٹ عنصر
zh_cn: 重复因子

source: current meter
es: meter actuale
fr: métrique actuelle
hi: वर्तमान मीटर
ja: 現代の拍子
pt: medidor atual
te: ప్రస్తుత మీటర్
tr: akım ölçer
ur: موجودہ میٹر
zh_cn: 当前拍号

source: beat factor
es: factor de ritmo
fr: facteur de battement
hi: बीट कारक
ja: 拍を～倍にするファクター
pt: fator da batida
te: బీట్ ఫ్యాక్టర్
tr: beat faktörü
ur: شکست عنصر
zh_cn: 节拍因子

source: The Beats per minute block returns the current beats per minute.
es: El bloque de latidos por minuto devuelve los latidos actuales por minuto.
fr: Le bloc Battements par minute renvoie le nombre actuel de battements par minute.
hi: बीट्स पर मिनट ब्लॉक वर्तमान मिनट प्रति बीट लौटाता है।
mr: बीट्स पर मिनिट ब्लॉक सध्याचे बीट्स प्रति मिनिट परत करतो.
pt: O bloco Batidas por minuto retorna as batidas atuais por minuto.
te: బీట్స్ పెర్ మినిట్ బ్లాక్ ప్రస్తుత బీట్స్ పెర్ మినిట్ ను తిరిగిస్తుంది.
tr: the beats per minute bloğu geçerli dakika başına atım sayısını döndürür
ur: بیٹس فی منٹ بلاک موجودہ دھڑکن کو فی منٹ لوٹاتا ہے۔
zh_cn: 每分钟节拍数块返回当前的每分钟节拍数。

source: beats per minute2
es: pulsaciones por minuto
fr: battements par minute2
hi: मिनट प्रति बीट
ja: １分当たりの拍の数
pt: batidas por minuto2
te: ప్రతి నిమిషం ప్రతి నిమిషం ప్రతి నిమిషం ప్రతి నిమిషం ప్రతి నిమిషం ప్రతి నిమిషం
tr: dakika başına atım2
ur: فی منٹ 2 دھڑکتا ہے
zh_cn: 每分钟节拍数2

source: beats per minute
es: pulsaciones por minuto
fr: battements par minute
hi: मिनट प्रति बीट
ja: スピードを決める
mr: बीट्स प्रति मिनिट
pt: batidas por minuto
te: మినిట్లో బీట్లు
tr: dakika başına vuruş
ur: فی منٹ دھڑکتا ہے
zh_cn: 每分钟节拍数

source: measure count
es: cuenta de medidas
fr: compte des mesures
hi: माप की गणना
ja: 小節の数
pt: contador de medida
te: మీటర్ లో ప్రస్తుత సంగీత మెజరు సంఖ్య
tr: hesaplama sayısı
ur: پیمائش گنتی
zh_cn: 小节数

source: The Measure count block returns the current measure.
es: El bloque de conteo de medidas devuelve la medida actual.
fr: Le bloc Compte des mesures renvoie la mesure actuelle.
hi: मेजर काउंट ब्लॉक वर्तमान माप को लौटाता है।
mr: मेजर काउंट ब्लॉक सध्याचे मापन परत करतो.
pt: O bloco Medidor retorna a contagem atual.
te: మీజర్ కౌంట్ బ్లాక్ ప్రస్తుత మీజర్ను తిరిగిస్తుంది.
tr: hesaplama sayımı bloğu geçerli hesaplamayı döndürür
ur: پیمائش گنتی بلاک موجودہ اقدام کو واپس کرتا ہے۔
zh_cn: 小节数块返回当前小节。

source: beat count
es: cuenta de latidos
fr: compte des battements
hi: बीट काउंट
ja: 拍の位置
mr: बीट संख्या
pt: contador de batidas
te: మీటర్ లో ప్రస్తుత బీట్ సంఖ్య
tr: vuruş sayısı
ur: بیٹ گنتی
zh_cn: 节拍计数

source: The Beat count block is the number of the current beat,
es: El bloque Conteo de tiempos es el número del tiempo actual,
fr: Le bloc Compte des battements est le nombre de battements actuels,
hi: बीट काउंट ब्लॉक वर्तमान बीट की संख्या है,
ja: <h2>拍（はく）の位置ブロック</h2><br>小節の中で何拍（はく）目かをあらわす数。たとえば、各小節の３拍（はく）めに何かアクション・イベントを起こしたいときなどに使う。
mr: बीट संख्या ब्लॉक हे वर्तमान बीटची संख्या आहे,
pt: O bloco contagem de Batidas é o número da batida atual,
te: బీట్ కౌంట్ బ్లాక్ ప్రస్తుత బీట్ యొక్క సంఖ్య ఉంది,
tr: vuruş sayısı bloğu geçerli vuruşun sayısıdır
ur: بیٹ گنتی بلاک موجودہ شکست کی تعداد ہے ،
zh_cn: 节拍计数块表示当前节拍数，

source: eg 1, 2, 3, or 4.
es: por ejemplo, 1, 2, 3, o 4.
fr: par exemple 1, 2, 3 ou 4.
hi: उदाहरण के लिए 1, 2, 3, या 4।
ja: <br>図の例では、それぞれの小節の１拍（ぱく）目に、特定のアクション・イベントを起こしている。
mr: उदा 1, 2, 3, किंवा 4.
pt: por exemplo 1, 2, 3, 4.
te: ఉదాహరణగా, 1, 2, 3, లేదా 4.
tr: örn
ur: جیسے 1 ، 2 ، 3 ، یا 4۔
zh_cn: 例如 1、2、3 或 4。

source: sum note values
es: cuenta las notas
fr: somme des valeurs de notes
hi: नोट मूल्यों की गणना
ja: 音の長さを足す
mr: नोट्सच्या मूल्यांची बेरीज
te: గానా విలువల సంఖ్య గణించండి
tr: nota değerlerini topla
ur: مجموعہ نوٹ کی اقدار
zh_cn: 音符值总和

source: The Note counter block can be used to count the number of contained notes.
es: El bloque Contador de notas se puede usar para contar el número de notas contenidas.
fr: Le bloc Compteur de notes peut être utilisé pour compter le nombre de notes contenues.
hi: नोट काउंटर ब्लॉक का उपयोग शामिल नोट्स की संख्या को गिनने के लिए किया जा सकता है।
mr: नोट काउंटर ब्लॉकचा वापर समाविष्ट नोट्सची संख्या मोजण्यासाठी केला जाऊ शकतो.
pt: O bloco Contador de notas pode ser usado para contar o número de notas.
te: గానా కౌంటర్ బ్లాక్ విలువలను కంటులో గణించడానికి ఉపయోగించవచ్చు.
tr: nota sayacı bloğu
ur: نوٹ کاؤنٹر بلاک پر مشتمل نوٹ کی تعداد گننے کے لئے استعمال کیا جاسکتا ہے۔
zh_cn: 音符计数器块可用于计算包含的音符数量。

source: note counter
es: cuenta las notas
fr: compteur de notes
hi: नोट काउंटर
ja: 音符の合計数
mr: नोट काउंटर
pt: contador de notas
te: గానా కౌంటర్
tr: not sayacı
ur: نوٹ کاؤنٹر
zh_cn: 音符计数器

source: whole notes played
es: notas completa jugadas
fr: notes entières jouées
hi: पूरे नोट बजे
ja: さいせいされた全音符の数
mr: पूर्ण नोट्स प्ले केल्या
pt: todas as notas tocadas
tr: çalınan tüm notalar
ur: پورے نوٹ کھیلے گئے
zh_cn: 演奏的全音符数

source: The Whole notes played block returns the total number of whole notes played.
es: El bloque Nota completa reproducidas devuelve el número total de notas completas reproducidas.
fr: Le bloc Notes entières jouées renvoie le nombre total de notes entières jouées.
hi: व्होल नोट्स प्लेड ब्लॉक प्लेड हुई संपूर्ण नोट्स की कुल संख्या लौटाता है।
mr: पूर्ण नोट्स प्ले केलेल्या ब्लॉकमध्ये पूर्ण नोट्सची एकूण संख्या परतवली जाते.
pt: O bloco Inteiro de notas tocadas retorna o número total de notas inteiras tocadas.
te: హోల్ నోట్లు ప్రారంభించబడిన ఆదాయంను తరచుకుపెడతాయి.
tr: the whole notes played bloğu çalınan tam notaların toplam sayısını döndürür
ur: پورے نوٹ کھیلے گئے بلاک نے کھیلے گئے پورے نوٹ کی کل تعداد واپس کردی۔
zh_cn: 全音符演奏块返回演奏的全音符总数。

source: notes played
es: notas jugadas
fr: notes jouées
hi: नोट्स बजे
ja: 全体の拍の数
mr: नोट्स प्ले केल्या
pt: notas tocadas
tr: çalınan notalar
ur: نوٹ کھیلے گئے
zh_cn: 演奏的音符数

source: The No clock block decouples the notes from the master clock.
es: El bloque Sin reloj desacopla las notas del reloj maestro.
fr: Le bloc Pas d'horloge découple les notes de l'horloge principale.
hi: नो क्लॉक ब्लॉक नोट्स को मास्टर क्लॉक से अलग करता है।
ja: <em>クロックなし</em>ブロックはそれぞれの動作の順番をリズムより優先します。
mr: नो क्लॉक ब्लॉक नोट्स मास्टर क्लॉकपासून वेगळ्या करतो.
pt: O bloco Sem-relógio desacopla as notas do relógio principal.
te: నో క్లాక్ బ్లాక్ నోట్లను మాస్టర్ క్లాక్ నుంచి విరామం చేస్తుంది.
tr: saat yok bloğu notaları ana saatten ayırır
ur: کوئی گھڑی بلاک ماسٹر گھڑی سے نوٹ کو ڈوپل نہیں کرتا ہے۔
zh_cn: 无时钟块将音符与主时钟解耦。

source: no clock
es: sin reloj
fr: pas d'horloge
hi: कोई घड़ी नहीं
ja: クロックなし
mr: नो क्लॉक
pt: sem relógio
te: మాస్టర్ క్లాక్కు గానాలను లాక్ చేయాలేదు
tr: saat yok
ur: کوئی گھڑی نہیں
zh_cn: 无时钟

source: on weak beat do
es: en latido débil hacer
fr: sur battement faible faire
hi: कमजोर बीट पर करें
ja: 弱拍に～する
mr: कमकुवत बीटवर करा
te: బలహీన బీట్పై చర్య చేయండి
tr: zayıf vuruşta do
ur: کمزور بیٹ پر
zh_cn: 在弱拍执行

source: The On-weak-beat block lets you specify actions to take on weak (off) beats.
es: El bloque En-latido-débil-hacer te permite especificar acciones a realizar en latido débiles.
fr: Le bloc Sur battement faible vous permet de spécifier des actions à effectuer sur les battements faibles (décalés).
mr: ऑन-वीक-बीट ब्लॉक तुम्हाला कमकुवत (ऑफ) बीटवर घेण्याच्या कृती निर्दिष्ट करण्याची परवानगी देतो.
ur: کمزور (آف) دھڑکنے کے ل The آپ کو کمزور (آف) دھڑکنے کے ل actions اقدامات کی وضاحت کرنے دیتا ہے۔
zh_cn: 弱拍块允许您指定在弱拍（弱拍）上执行的操作。

source: on strong beat
es: en latido fuerte hacer
fr: sur battement fort
hi: मजबूत बीट पर
ja: 強拍に
mr: मजबूत बीटवर
pt: em batida forte
te: బలమైన బీట్పై
tr: güçlü vuruşta
ur: مضبوط شکست پر
zh_cn: 在强拍执行

source: The On-strong-beat block lets you specify actions to take on specified beats.
es: El bloque En-latido-fuerte-hacer le permite especificar acciones a realizar en latido específicos.
fr: Le bloc Sur battement fort vous permet de spécifier des actions à effectuer sur des battements spécifiques.
mr: ऑन-स्ट्राँग-बीट ब्लॉक तुम्हाला निर्दिष्ट बीट्सवर घेण्याच्या कृती निर्दिष्ट करण्याची परवानगी देतो.
ur: آن-مضبوط-بیٹ بلاک آپ کو مخصوص دھڑکنوں پر لینے کے لیے کارروائیوں کی وضاحت کرنے دیتا ہے۔
zh_cn: 强拍块允许您指定在特定强拍上执行的操作。

source: beat
es: latidos
fr: battement
hi: बीट
ja: 拍子
mr: बीट
pt: batida
te: బీట్
tr: vuruş
ur: مارو
zh_cn: 节拍

source: do1
es: do
fr: faire1
ja: アクション実行
pt: fazer1
te: డూ1
ur: 1 کرو
zh_cn: 做1

source: on every beat do
es: en cado latodo hacer
fr: sur chaque battement faire
hi: प्रत्येक बीट पर करें
ja: 全ての拍子にアクション実行
mr: प्रत्येक बीटवर करा
te: ప్రతి బీట్పై చర్య చేయండి
tr: her vuruşta
ur: ہر بیٹ پر کرو
zh_cn: 在每个拍子执行

source: The On-every-beat block lets you specify actions to take on every beat.
es: El bloque En-cado-latido-hacer le permite especificar acciones a realizar en cado latado.
fr: Le bloc Sur chaque battement vous permet de spécifier des actions à effectuer sur chaque battement.
mr: ऑन-एव्हरी-बीट ब्लॉक तुम्हाला प्रत्येक बीटवर घेण्याच्या कृती निर्दिष्ट करण्याची परवानगी देतो.
ur: آن-ایری-بیٹ بلاک آپ کو ہر بیٹ پر کرنے کے لیے کارروائیوں کی وضاحت کرنے دیتا ہے۔
zh_cn: 每拍块允许您指定在每个拍子上执行的操作。

source: on every note do
es: en cada nota hacer
fr: sur chaque note faire
hi: प्रत्येक नोट पर करें
ja: 全ての音符にアクション実行
mr: प्रत्येक नोटवर करा
pt: em cada nota feita
te: ప్రతి గానాను పైన చేయండి
tr: her notada do
ur: ہر نوٹ پر کرتے ہیں
zh_cn: 在每个音符执行

source: The On-every-note block lets you specify actions to take on every note.
es: El bloque En-cada-nota-hacer le permite especificar acciones a realizar en cada nota.
fr: Le bloc Sur chaque note vous permet de spécifier des actions à effectuer sur chaque note.
mr: ऑन-एव्हरी-नोट ब्लॉक तुम्हाला प्रत्येक नोटवर घेण्याच्या कृती निर्दिष्ट करण्याची परवानगी देतो.
ur: آن-ایوری-نوٹ بلاک آپ کو ہر نوٹ پر لینے کے لیے کارروائیوں کی وضاحت کرنے دیتا ہے۔
zh_cn: 每音符块允许您指定在每个音符上执行的操作。

source: master beats per minute
es: latidos por minuto de dominar
fr: battements par minute maître
hi: मास्टर बीट्स प्रति मिनट
ja: 全体のスピードを決める
mr: मास्टर बीट्स पर मिनिट
pt: batida mestre por minuto
te: మాస్టర్ బీట్స్ పర్ మినిట్
tr: dakika başına ana vuruş
ur: ماسٹر بیٹس فی منٹ
zh_cn: 主节拍每分钟数

source: bpm
es: lpm
hi: बीपीएम
ja: １分あたりの拍の数
mr: बीपीएम
te: బీపిఎమ్
ur: بی پی ایم
zh_cn: 每分钟节拍数

source: beat value
es: valor de latidos
fr: valeur de battement
hi: बीट मूल्य
ja: １拍
mr: बीट मूल्य
pt: valor da batida
te: బీట్ విలువ
tr: beat değeri
ur: بیٹ ویلیو
zh_cn: 节拍值

source: Beats per minute must be > 30.
es: Latidos por minuto debe ser > 30.
fr: Les battements par minute doivent être > 30.
hi: मिनट प्रति बीट 30 से अधिक होना चाहिए।
ja: １分あたりの拍の数には、３０より大きいあたいをせっていしてください。
mr: बीट्स पर मिनिट > 30 असणे आवश्यक आहे.
pt: Batidas por minuto devem ser> 30.
te: బీట్స్ పర్ మినిట్ కనీసం 30 ఉండాలి.
tr: dakika başına atım sayısı &gt
ur: دھڑکن فی منٹ 30 سے ​​زیادہ ہونی چاہیے۔
zh_cn: 每分钟节拍数必须大于30。

source: Maximum beats per minute is 1000.
es: Los latidos por minuto como máximo es de 1000.
fr: Le maximum de battements par minute est de 1000.
hi: अधिकतम मिनट प्रति बीट 1000 है।
ja: 1分あたりの拍の数は、最大1000です。
mr: कमाल बीट्स पर मिनिट 1000 आहे.
pt: Máximo de batidas por minuto é de 1.000.
te: అత్యధిక బీట్స్ పర్ మినిట్ 1000.
tr: Dakikadaki maksimum atım sayısı 1000'dir
ur: زیادہ سے زیادہ دھڑکن فی منٹ 1000 ہے۔
zh_cn: 最大每分钟节拍数为1000。

source: The Beats per minute block sets the number of 1/4 notes per minute.
es: El bloque Pulsaciones por minuto establece el número de 1/4 notas por minuto.
fr: Le bloc Battements par minute définit le nombre de notes de 1/4 par minute.
hi: प्रति मिनट 1/4 नोट्स की संख्या सेट करने के लिए बीट्स प्रति मिनट ब्लॉक।
ja: <h2>スピードを決めるブロック</h2><br>１分あたりの拍（はく）の数をせっていすることで、曲のスピードを決める。ひょうじゅんは４分音符（おんぷ）９０こ。<br><br>★拍（はく）とは<br>くり返されるリズムのこと。
mr: बीट्स पर मिनिट ब्लॉक मिनिटात 1/4 नोट्सची संख्या सेट करतो.
pt: O bloco Batidas por minuto define o número de 1/4 notas por minuto.
te: ప్రతిసారి నోటుకు 1/4 నోటుల సంఖ్యను మినిట్ కోసం మార్చేస్తుంది.
tr: dakika başına vuruş bloğu dakika başına 1/4 nota sayısını belirler
ur: بیٹس فی منٹ بلاک 1/4 نوٹ فی منٹ کی تعداد مقرر کرتا ہے۔
zh_cn: 节拍每分钟块设置每分钟四分音符的数量。

source: pickup
fr: levée
hi: पिकअप
ja: ピックアップ
mr: पिकअप
pt: pegar
te: పికప్
ur: اٹھاؤ
zh_cn: 前奏拍

source: number of beats
es: número de latidos
fr: nombre de battements
hi: बीट्स की संख्या
ja: 拍の数
mr: बीट्सची संख्या
pt: número de batidas
te: బీట్స్ సంఖ్య
tr: atım sayısı
ur: دھڑکنوں کی تعداد
zh_cn: 拍数

source: transposition
es: transposición
hi: स्वर स्थानांतरण
ja: 移調
mr: स्थानांतर
pt: transposição
te: స్వరాను సరిగా చేయడానికి సవరాను
tr: transpozisyon
ur: منتقلی
zh_cn: 移调

source: scalar step down
es: escalar bajar
fr: descente scalaire
hi: स्केलर स्टेप डाउन
ja: 音階内で~度下がる:
mr: स्केलर स्टेप डाउन
pt: degrau escalar de baixo
te: ప్రస్తుత సంగీత స్కేల్‌లో ఒక నోట్ క్రిందకి ఒక అంశం తగ్గిస్తుంది
tr: skaler aşağı adım
ur: اسکیلر قدم نیچے
zh_cn: 音阶下行

source: The Scalar step down block returns the number of semi-tones down to the previous note in the current key and mode.
es: El bloque Escalar bajar devuelve el número de semitonos a la nota anterior en la tecla y modo actuales.
fr: Le bloc Descente scalaire renvoie le nombre de demi-tons vers la note précédente dans la tonalité et le mode actuels.
hi: स्केलर स्टेप डाउन ब्लॉक वर्तमान कुंजी और मोड में पिछले नोट तक की सेमी-टोन की संख्या लौटाता है।
mr: स्केलर स्टेप डाउन ब्लॉक वर्तमान की आणि मोडमध्ये मागील नोटपर्यंत अर्ध-स्वरांची संख्या परतवतो.
pt: O bloco Escalar redutor retorna o número de semitons reduzidos até a nota anterior na tecla atual e modo.
te: స్కేల్‌లో మునుపటి గానంకి డౌన్ చేసే సెమీ-టోన్స్ సంఖ్యను తరిచేస్తుంది.
ur: اسکیلر اسٹیپ ڈاؤن بلاک موجودہ کلید اور موڈ میں پچھلے نوٹ پر نیم ٹونز کی تعداد کو واپس کرتا ہے۔
zh_cn: 音阶下行块返回当前调式中与前一个音符之间的半音数。

source: scalar step up
es: escalar aumentar
fr: montée scalaire
hi: स्केलर स्टेप अप
ja: 音階内で~度上がる:
mr: स्केलर स्टेप अप
pt: degrau escalar de cima
te: ప్రస్తుత సంగీత స్కేల్‌లో ఒక నోట్ పెరిగిపోయి ఉంచిస్తుంది
tr: skaler adım yukarı
ur: اسکیلر قدم بڑھائیں
zh_cn: 音阶上行

source: The Scalar step up block returns the number of semi-tones up to the next note in the current key and mode.
es: El bloque Escalar aumentar devuelve el número de semitonos hasta la siguiente nota en la tecla y modo actuales.
fr: Le bloc Montée scalaire renvoie le nombre de demi-tons vers la note suivante dans la tonalité et le mode actuels.
hi: स्केलर स्टेप अप ब्लॉक वर्तमान कुंजी और मोड में अगले नोट तक की सेमी-टोन की संख्या लौटाता है।
mr: स्केलर स्टेप अप ब्लॉक वर्तमान की आणि मोडमध्ये पुढील नोटपर्यंत अर्ध-स्वरांची संख्या परतवतो.
pt: O bloco Escalar progressivo retorna o número de semitons até a próxima nota na tecla atual e modo.
te: స్కేల్‌లో తరిగిన గానంకి డబ్బుల సంఖ్యను తరిచేస్తుంది.
ur: اسکیلر اسٹیپ اپ بلاک موجودہ کلید اور موڈ میں اگلے نوٹ تک سیمی ٹونز کی تعداد لوٹاتا ہے۔
zh_cn: 音阶上行块返回当前调式中与下一个音符之间的半音数。
