Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Y block returns the vertical position of the turtle.
es: El bloque Y devuelve la posición horizontal de la tortuga.
fr: Le bloc Y renvoie la position verticale de la tortue.
mr: वाय ब्लॉक कासवाची उभ्या स्थिती परत करतो.
te: Y బ్లాక్ టర్టిల్ యొక్క ఉండికని తిరిగి తేలుతుంది.
tr: y bloğu kaplumbağanın dikey konumunu döndürür
ur: Y بلاک کچھوے کی عمودی پوزیشن کو لوٹاتا ہے۔
zh_cn: Y 块返回乌龟的垂直位置。

source: The X block returns the horizontal position of the mouse.
es: El bloque X devuelve la posición horizontal del ratón.
fr: Le bloc X renvoie la position horizontale de la souris.
ja: <h2>すうちブロック</h2><br>ネズミのｘざひょう（よこ方向の位置）を表すすうちブロック。<br><br>★ざひょうとは<br>物の位置を表すためのすうちのこと。ミュージック・ブロックスでは、２つ１組みのすうち（ざひょう）を使う。画面上のネズミの位置は、ほうがん用紙のマス目のように、よこ方向の目もり（xざひょう）とたて方向の目もり（ｙざひょう）を使って表す。
mr: एक्स ब्लॉक माऊसची आडवी स्थिती परत करतो.
pt: O bloco X retorna a posição horizontal do mouse.
te: X బ్లాక్ మౌస్ యొక్క కంటిని తిరిగి తేలుతుంది.
tr: x bloğu farenin yatay konumunu döndürür
ur: ایکس بلاک ماؤس کی افقی پوزیشن واپس کرتا ہے۔
zh_cn: X 块返回老鼠的水平位置。

source: The X block returns the horizontal position of the turtle.
es: El bloque X devuelve la posición horizontal de la tortuga.
fr: Le bloc X renvoie la position horizontale de la tortue.
mr: एक्स ब्लॉक कासवाची आडवी स्थिती परत करतो.
te: X బ్లాక్ టర్టిల్ యొక్క కంటిని తిరిగి తేలుతుంది.
tr: x bloğu kaplumbağanın yatay konumunu döndürür
ur: ایکس بلاک کچھوے کی افقی پوزیشن کو لوٹاتا ہے۔
zh_cn: X 块返回乌龟的水平位置。

source: scroll xy
es: desplazar xy
fr: défiler xy
ja: カンバスを動かす
pt: rolar xy
te: స్క్రోల్ XY
tr: kaydırma xy
ur: اسکرول xy
zh_cn: 滚动 xy 块标签

source: The Scroll XY block moves the canvas.
es: El bloque Desplazar XY mueve el lienzo.
fr: Le bloc Défilement XY déplace la toile.
ja: <h2>いどうブロック（カンバス）</h2><br>カンバスを上下左右にいどうさせる。カンバスだけがいどうするので結果的に、画面上のすべてのネズミが同時にいどうするように見える。カンバスを右（プラス）にいどうするとネズミは左へ、左（マイナス）にいどうするとネズミは右に動いて見える。同じく、カンバスを上（プラス）にいどうするとネズミは下へ、下（マイナス）にいどうするとネズミは上に動いて見える。
mr: स्क्रोल एक्सवाय ब्लॉक कॅनव्हासला हलवतो.
pt: O bloco Rolar XY move a tela.
te: స్క్రోల్ XY బ్లాక్ క్యాన్వాస్‌ను చలింపుగా చేస్తుంది.
tr: scroll xy bloğu tuvali hareket ettirir
ur: اسکرول XY بلاک کینوس کو حرکت دیتا ہے۔
zh_cn: Scroll XY 块移动画布。

source: The Control-point 2 block sets the second control point for the Bezier curve.
es: El bloque Control-point 2 establece el segundo punto de control para la curva Bezier.
fr: Le bloc Point de contrôle 2 définit le deuxième point de contrôle pour la courbe de Bezier.
mr: कंट्रोल-पॉइंट २ ब्लॉक बेजियर कर्वसाठी दुसरा कंट्रोल पॉइंट सेट करतो.
pt: O bloco Ponto-de-controle 2 define o segundo ponto de controle para uma curva Bezier.
te: కంట్రోల్-పాయింట్ 2 బ్లాక్ బేజియర్ కర్వ్ కోసం రెండవ నియంత్రణ పాయింట్‌ను సెట్ చేస్తుంది.
ur: کنٹرول پوائنٹ 2 بلاک بیزیئر وکر کے لیے دوسرا کنٹرول پوائنٹ سیٹ کرتا ہے۔
zh_cn: Control-point 2 块设置贝塞尔曲线的第二个控制点。

source: control point 2
es: punto de control 2
fr: point de contrôle 2
ja: コントロール点２
mr: कंट्रोल पॉइंट २
pt: ponto de controle 2
te: కంట్రోల్ పాయింట్ 2
tr: kontrol noktası 2
ur: کنٹرول پوائنٹ 2
zh_cn: 图形控制点 2 的标签

source: The Control-point 1 block sets the first control point for the Bezier curve.
es: El bloque Control-point 1 establece el segundo punto de control para la curva Bezier.
fr: Le bloc Point de contrôle 1 définit le premier point de contrôle pour la courbe de Bezier.
mr: कंट्रोल-पॉइंट १ ब्लॉक बेजियर कर्वसाठी पहिला कंट्रोल पॉइंट सेट करतो.
pt: O bloco Ponto-de-controle 1 define o primeiro ponto de controle para uma curva Bezier.
te: కంట్రోల్-పాయింట్ 1 బ్లాక్ బేజియర్ కర్వ్ కోసం మొదటి నియంత్రణ పాయింట్‌ను సెట్ చేస్తుంది.
ur: کنٹرول پوائنٹ 1 بلاک بیزیئر وکر کے لیے پہلا کنٹرول پوائنٹ سیٹ کرتا ہے۔
zh_cn: Control-point 1 块设置贝塞尔曲线的第一个控制点。

source: control point 1
es: punto de control 1
fr: point de contrôle 1
ja: コントロール点１
mr: कंट्रोल पॉइंट १
pt: ponto de controle 1
te: కంట్రోల్ పాయింట్ 1
tr: kontrol noktası 1
ur: کنٹرول پوائنٹ 1
zh_cn: 图形控制点 1 的标签

source: The Bezier block draws a Bezier curve.
es: El bloque bezier dibuja una curva bezier.
fr: Le bloc Bezier dessine une courbe de Bezier.
mr: बेजियर ब्लॉक बेजियर कर्व काढतो.
pt: O bloco Bezier desenha uma curva Bezier.
te: బేజియర్ బ్లాక్ బేజియర్ కర్వ్ నమోదు చేస్తుంది.
tr: bezier bloğu bir bezier eğrisi çizer
ur: بیزیئر بلاک ایک بیزیئر وکر کھینچتا ہے۔
zh_cn: Bezier 块绘制贝塞尔曲线。

source: The Arc block moves the turtle in an arc.
es: El bloque Arco mueve la tortuga en un arco.
fr: Le bloc Arc déplace la tortue en arc.
mr: आर्क ब्लॉक कासवाला आर्कमध्ये हलवतो.
tr: yay bloğu kaplumbağayı bir yay içinde hareket ettirir
ur: آرک بلاک کچھوے کو آرک میں منتقل کرتا ہے۔
zh_cn: Arc 块以弧形移动乌龟。

source: arc
es: arco
hi: चाप
ja: 円をえがいていどう
mr: कंस
te: జ్యా
tr: yay
ur: قوس
zh_cn: 弧度

source: angle
es: ángulo
hi: कोण
ja: 角度
mr: कोन
pt: ângulo
te: కోణం
tr: açı
ur: زاویہ
zh_cn: 角度

source: radius
es: radio
fr: rayon
hi: त्रिज्या
ja: 半径
mr: त्रिज्या
pt: raio
te: వ్యాసార్ధం
tr: yarıçap
ur: رداس
zh_cn: 半徑

source: Value must be within -5000 to 5000 when Wrap Mode is off.
es: El valor debe estar entre -5000 y 5000 cuando el modo Wrap está desactivado.
fr: La valeur doit être comprise entre -5000 et 5000 lorsque le mode Enveloppement est désactivé.
ur: ریپ موڈ آف ہونے پر ویلیو -5000 سے 5000 کے اندر ہونی چاہیے۔
zh_cn: 当 Wrap Mode 关闭时，值必须在 -5000 到 5000 之间。

source: Value must be within -20000 to 20000 when Wrap Mode is on.
es: El valor debe estar entre -20000 y 20000 cuando el modo Wrap está activado.
fr: La valeur doit être comprise entre -20000 et 20000 lorsque le mode Enveloppement est activé.
ur: ریپ موڈ آن ہونے پر ویلیو -20000 سے 20000 کے اندر ہونی چاہیے۔
zh_cn: 当 Wrap Mode 开启时，值必须在 -20000 到 20000 之间。

source: set heading
es: fijar rumbo
fr: fixer le cap
hi: शीर्षक सेट करें
ja: 向きを変える
mr: शीर्षक संच करा
pt: definir rumo
te: సెట్ హెడింగ్
tr: başlığı ayarla
ur: سرخی مقرر کریں
zh_cn: 設定標頭

source: The Set heading block sets the heading of the turtle.
es: El bloque fijar rumbo establece el rumbo de la tortuga.
fr: Le bloc Fixer le cap définit le cap de la tortue.
ja: <h2>いどうブロック</h2><br>タートルの向きを、指定したすうちの角度に変える。
mr: सेट हेडिंग ब्लॉक कासवाचे शीर्षक सेट करतो.
te: సెట్ హెడింగ్ బ్లాక్ టర్టిల్ యొక్క హెడింగ్‌ను సెట్ చేస్తుంది.
tr: set heading bloğu kaplumbağanın yönünü ayarlar
ur: سیٹ ہیڈنگ بلاک کچھوے کی سرخی کا تعین کرتا ہے۔
zh_cn: Set heading 块设置乌龟的朝向。

source: The Set XY block moves the mouse to a specific position on the screen.
es: El bloque Fijar XY mueve el ratón a una posición específica en la pantalla.
fr: Le bloc Fixer XY déplace la souris à une position spécifique sur l'écran.
ja: <h2>いどうブロック</h2><br>ネズミの位置を、指定したざひょうにいどうさせる。<br><br>★ざひょうとは<br>物の位置を表すためのすうちのこと。ミュージック・ブロックスでは、２つ１組みのすうち（ざひょう）を使う。画面上のネズミの位置は、ほうがん用紙のマス目のように、よこ方向の目もり（xざひょう）とたて方向の目もり（ｙざひょう）を使って表す。
mr: सेट एक्सवाय ब्लॉक माऊसला स्क्रीनवरील विशिष्ट स्थानी हलवतो.
pt: O bloco Estabeleça XY move o ratinho para uma posição específica na tela.
te: సెట్ XY బ్లాక్ మౌస్‌ను స్క్రీన్ పైన ఒక నిర్దిష్ట స్థానంకు తరలించేది.
tr: set xy bloğu fareyi ekranda belirli bir konuma taşır
ur: سیٹ XY بلاک ماؤس کو اسکرین پر ایک مخصوص پوزیشن پر لے جاتا ہے۔
zh_cn: Set XY 块将鼠标移动到屏幕上的指定位置。

source: The Set XY block moves the turtle to a specific position on the screen.
es: El bloque Fijar XY mueve la tortuga a una posición específica en la pantalla.
fr: Le bloc Fixer XY déplace la tortue à une position spécifique sur l'écran.
ja: <h2>いどうブロック</h2><br>タートルの位置を、指定したざひょうにいどうさせる。<br><br>★ざひょうとは<br>物の位置を表すためのすうちのこと。ミュージック・ブロックスでは、２つ１組みのすうち（ざひょう）を使う。画面上のタートルの位置は、ほうがん用紙のマス目のように、よこ方向の目もり（xざひょう）とたて方向の目もり（ｙざひょう）を使って表す。
mr: सेट एक्सवाय ब्लॉक कासवाला स्क्रीनवरील विशिष्ट स्थानी हलवतो.
te: సెట్ XY బ్లాక్ టర్టిల్‌ను స్క్రీన్ పైన ఒక నిర్దిష్ట స్థానంకు తరలించేది.
tr: set xy bloğu kaplumbağayı ekranda belirli bir konuma taşır
ur: سیٹ XY بلاک کچھوے کو اسکرین پر ایک مخصوص پوزیشن پر لے جاتا ہے۔
zh_cn: Set XY 块将乌龟移动到屏幕上的指定位置。

source: set xy
es: fijar xy
fr: fixer xy
hi: xy सेट करें
ja: 指定ざひょうにいどう
mr: संच xy
pt: definir xy
te: xy లను అమర్చు
tr: xy'yi ayarla
ur: xy سیٹ کریں۔
zh_cn: 指定座標

source: The Right block turns the mouse to the right.
es: El bloque Derecha gira el ratón hacia la derecha.
fr: Le bloc Droite tourne la souris vers la droite.
ja: <h2>いどうブロック</h2><br>ネズミの向きを、指定したすうちの角度で右回りに回転させる。
mr: राइट ब्लॉक माऊसला उजवीकडे वळवतो.
pt: O bloco Direita gira o ratinho para a direita.
te: రైట్ బ్లాక్ మౌస్‌ను కుడికి తరలుతుంది.
tr: sağ blok fareyi sağa döndürür
ur: دائیں بلاک ماؤس کو دائیں طرف موڑ دیتا ہے۔
zh_cn: Right 块将鼠标向右转。

source: The Right block turns the turtle to the right.
es: El bloque Derecha gira la tortuga hacia la derecha.
fr: Le bloc Droite tourne la tortue vers la droite.
ja: <h2>いどうブロック</h2><br>タートルの向きを、指定したすうちの角度で右回りに回転させる。
mr: राइट ब्लॉक कासवाला उजवीकडे वळवतो.
te: రైట్ బ్లాక్ టర్టిల్‌ను కుడికి తరలుతుంది.
tr: sağ blok kaplumbağayı sağa döndürür
ur: دائیں بلاک کچھوے کو دائیں طرف موڑ دیتا ہے۔
zh_cn: Right 块将乌龟向右转。

source: right1
es: derecha
fr: droite1
ja: 右を向く
pt: direita1
te: రైట్1
ur: دائیں 1
zh_cn: 右1

source: right
es: derecha
fr: droite
hi: दायाँ
ja: ざひょうち（右）
mr: उजव्या
pt: direita
te: రైట్
tr: sağ
ur: دائیں
zh_cn: 右轉

source: The Left block turns the mouse to the left.
es: El bloque izquierdo gira el ratón hacia la izquierda.
fr: Le bloc Gauche tourne la souris vers la gauche.
ja: <h2>いどうブロック</h2><br>ネズミの向きを、指定したすうちの角度で左回りに回転させる。
mr: लेफ्ट ब्लॉक माऊसला डावीकडे वळवतो.
pt: O bloco Esquerda gira o ratinho para a esquerda.
te: లెఫ్ట్ బ్లాక్ మౌస్‌ను ఎడమకు తరలుతుంది.
tr: sol blok fareyi sola döndürür
ur: بائیں بلاک ماؤس کو بائیں طرف موڑ دیتا ہے۔
zh_cn: Left 块将鼠标向左转。

source: The Left block turns the turtle to the left.
es: El bloque izquierdo gira la tortuga hacia la izquierda.
fr: Le bloc Gauche tourne la tortue vers la gauche.
ja: <h2>いどうブロック</h2><br>タートルの向きを、指定したすうちの角度で左回りに回転させる。
mr: लेफ्ट ब्लॉक कासवाला डावीकडे वळवतो.
te: లెఫ్ట్ బ్లాక్ టర్టిల్‌ను ఎడమకు తరలుతుంది.
tr: sol blok kaplumbağayı sola döndürür
ur: بائیں بلاک کچھوے کو بائیں طرف موڑ دیتا ہے۔
zh_cn: Left 块将乌龟向左转。

source: left1
es: izquierda
fr: gauche1
ja: 左を向く
pt: esquerda1
te: లెఫ్ట్1
tr: sol1
ur: بائیں 1
zh_cn: 左1

source: left
es: izquierda
fr: gauche
hi: बायाँ
ja: ざひょうち（左）
mr: डाव्या
pt: esquerda
te: లెఫ్ట్
tr: sol
ur: بائیں
zh_cn: 左轉

source: back
es: atrás
fr: recule
hi: पीछे
ja: 後ろへ進む
mr: परत
pt: voltar
te: వెనుక
tr: geri
ur: واپس
zh_cn: 後退

source: The Back block moves the mouse backward.
es: El bloque Atrás mueve el ratón hacia atrás.
fr: Le bloc Recule déplace la souris vers l'arrière.
ja: <h2>いどうブロック</h2><br>指定したすうち分、ネズミを後ろにもどす。体の向きは変えない。
mr: बॅक ब्लॉक माऊसला मागे हलवतो.
pt: O bloco Retornar move o ratinho para trás.
te: బ్యాక్ బ్లాక్ మౌస్‌ను వెనుకకు తరలుతుంది.
tr: geri bloğu fareyi geriye doğru hareket ettirir
ur: بیک بلاک ماؤس کو پیچھے کی طرف لے جاتا ہے۔
zh_cn: Back 块使鼠标向后移动。

source: The Back block moves the turtle backward.
es: El bloque Atrás mueve la tortuga hacia atrás.
fr: Le bloc Recule déplace la tortue vers l'arrière.
ja: <h2>いどうブロック</h2><br>指定したすうち分、タートルを後ろにもどす。体の向きは変えない。
mr: बॅक ब्लॉक कासवाला मागे हलवतो.
te: బ్యాక్ బ్లాక్ టర్టిల్‌ను వెనుకకు తరలుతుంది.
tr: arka blok kaplumbağayı geriye doğru hareket ettirir
ur: بیک بلاک کچھوے کو پیچھے کی طرف لے جاتا ہے۔
zh_cn: Back 块使乌龟向后移动。

source: forward
es: adelante
fr: avance
hi: आगे
ja: 前へ進む
mr: पुढे
pt: para frente
te: ముందుకు
tr: ileri
ur: آگے
zh_cn: 前進

source: The Forward block moves the mouse forward.
es: El bloque Adelante mueve el ratón hacia adelante.
fr: Le bloc Avance déplace la souris vers l'avant.
ja: <h2>いどうブロック</h2><br>指定したすうち分、ネズミを前に進める。
mr: फॉरवर्ड ब्लॉक माऊसला पुढे हलवतो.
pt: O bloco Avançar move o ratinho para frente.
te: ఫార్వర్డ్ బ్లాక్ మౌస్‌ను ముందుకు తరలుతుంది.
tr: ileri bloğu fareyi ileri doğru hareket ettirir
ur: فارورڈ بلاک ماؤس کو آگے بڑھاتا ہے۔
zh_cn: Forward 块使鼠标向前移动。

source: The Forward block moves the turtle forward.
es: El bloque Adelante mueve la tortuga hacia adelante.
fr: Le bloc Avance déplace la tortue vers l'avant.
ja: <h2>いどうブロック</h2><br>指定したすうち分、タートルを前に進める。
mr: फॉरवर्ड ब्लॉक कासवाला पुढे हलवतो.
te: ఫార్వర్డ్ బ్లాక్ టర్టిల్‌ను ముందుకు తరలుతుంది.
tr: ileri bloğu kaplumbağayı ileri taşır
ur: فارورڈ بلاک کچھوے کو آگے بڑھاتا ہے۔
zh_cn: Forward 块使乌龟向前移动。

source: wrap
es: envolver
fr: envelopper
ja: 巻きつける
te: ర్యాప్
tr: sarma
ur: لپیٹ
zh_cn: 环绕

source: right (screen)
es: derecha
fr: droite (écran)
hi: दाएं (स्क्रीन)
ja: ざひょうち（右）
pt: direita (tela)
te: డిక్షన్ (స్క్రీన్)
tr: sağ (ekran) (Bağlam
ur: دائیں (اسکرین)
zh_cn: 右侧（屏幕）

source: The Right block returns the position of the right of the canvas.
es: El bloque Derecha devuelve la posición de la derecha del lienzo.
fr: Le bloc Droite renvoie la position de la droite de la toile.
hi: राइट ब्लॉक कैनवास के दाएं की स्थिति लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスの右のｘざひょうち。プラスのすうち。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、ざひょうち（上）、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: राइट ब्लॉक कॅनव्हासच्या उजव्या बाजूची स्थिती परत करतो.
pt: O bloco Direita retorna a posição da direita da tela.
te: రైట్ బ్లాక్ క్యానవాస్ యొక్క కూడా స్థానాన్ని తరిస్తుంది.
tr: the right bloğu tuvalin sağının konumunu döndürür
ur: دائیں بلاک کینوس کے دائیں کی پوزیشن لوٹاتا ہے۔
zh_cn: Right 块返回画布右侧的位置。

source: left (screen)
es: izquierdo
fr: gauche (écran)
hi: बाएं (स्क्रीन)
ja: ざひょうち（左）
pt: esquerda
te: ఎడా (స్క్రీన్)
tr: sol (ekran) (Bağlam
ur: بائیں (اسکرین)
zh_cn: 左侧（屏幕）

source: The Left block returns the position of the left of the canvas.
es: El bloque Izquierdo devuelve la posición de la izquierda del lienzo.
fr: Le bloc Gauche renvoie la position de la gauche de la toile.
hi: लेफ्ट ब्लॉक कैनवास के बाएं की स्थिति लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスの左のｘざひょうち。マイナスのすうち。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、ざひょうち（上））、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: लेफ्ट ब्लॉक कॅनव्हासच्या डाव्या बाजूची स्थिती परत करतो.
pt: O bloco Esquerda retorna a posição da esquerda da tela.
te: ఎడా బ్లాక్ క్యానవాస్ యొక్క ఎడాన్ని తరిస్తుంది.
tr: the left bloğu tuvalin solunun konumunu döndürür
ur: بائیں بلاک کینوس کے بائیں کی پوزیشن لوٹاتا ہے۔
zh_cn: Left 块返回画布左侧的位置。

source: top (screen)
es: superior
fr: haut (écran)
hi: शीर्ष (स्क्रीन)
ja: ざひょうち（上）
pt: topo (tela)
te: ముక్క (స్క్రీన్)
tr: üst (ekran) (Bağlam
ur: اوپر (اسکرین)
zh_cn: 顶部（屏幕）

source: The Top block returns the position of the top of the canvas.
es: El bloque superior devuelve la posición de la parte superior del lienzo.
fr: Le bloc Haut renvoie la position du haut de la toile.
hi: टॉप ब्लॉक कैनवास के शीर्ष की स्थिति लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスの上のｙざひょうち。プラスのすうち。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、上（y座標）、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: टॉप ब्लॉक कॅनव्हासच्या वरच्या बाजूची स्थिती परत करतो.
pt: O bloco Topo retorna a posição do topo da tela.
te: టాప్ బ్లాక్ క్యానవాస్ యొక్క ముక్కను తరిస్తుంది.
tr: the top bloğu tuvalin üst kısmının konumunu döndürür
ur: ٹاپ بلاک کینوس کے اوپری حصے کی پوزیشن لوٹاتا ہے۔
zh_cn: Top 块返回画布顶部的位置。

source: bottom (screen)
es: inferior
fr: bas (écran)
hi: नीचे (स्क्रीन)
ja: ざひょうち（下）
pt: rodapé (tela)
te: దిగువ (స్క్రీన్)
tr: alt (ekran) (Bağlam
ur: نیچے (اسکرین)
zh_cn: 底部（屏幕）

source: The Bottom block returns the position of the bottom of the canvas.
es: El bloque Inferior devuelve la posición de la parte inferior del lienzo.
fr: Le bloc Bas renvoie la position du bas de la toile.
hi: बॉटम ब्लॉक कैनवास के नीचे की स्थिति लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスの下のｙざひょうち。マイナスのすうち。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、ざひょうち（上）、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: बॉटम ब्लॉक कॅनव्हासच्या खालच्या बाजूची स्थिती परत करतो.
pt: O bloco Rodapé retorna a posição da parte inferior da tela.
te: బాటమ్ బ్లాక్ క్యానవాస్ యొక్క కొనసాగిన స్థానాన్ని తరిస్తుంది.
tr: the bottom bloğu tuvalin alt kısmının konumunu döndürür
ur: نیچے کا بلاک کینوس کے نیچے کی پوزیشن لوٹاتا ہے۔
zh_cn: Bottom 块返回画布底部的位置。

source: width
es: anchura
fr: largeur
hi: चौड़ाई
ja: カンバスのよこはば
pt: largura
te: వెడల్పు
tr: genişlik
ur: چوڑائی
zh_cn: 宽度

source: The Width block returns the width of the canvas.
es: El bloque ancho devuelve el ancho del lienzo.
fr: Le bloc Largeur renvoie la largeur de la toile.
hi: विड्थ ब्लॉक कैनवास की चौड़ाई लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスのたてはばのすうちを表す。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、ざひょうち（上）、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: विथ ब्लॉक कॅनव्हासची रुंदी परत करतो.
pt: O bloco Largura retorna a largura da tela.
te: వెడల్పు బ్లాక్ క్యానవాస్ యొక్క వెడల్పును తరిస్తుంది.
tr: width bloğu tuvalin genişliğini döndürür
ur: چوڑائی کا بلاک کینوس کی چوڑائی لوٹاتا ہے۔
zh_cn: Width 块返回画布的宽度。

source: height
es: altura
fr: hauteur
hi: ऊचाई
ja: カンバスのたてはば
pt: altura
te: ఎత్తు
tr: yükseklik
ur: اونچائی
zh_cn: 高度

source: The Height block returns the height of the canvas.
es: El bloque altura devuelve la altura del lienzo.
fr: Le bloc Hauteur renvoie la hauteur de la toile.
hi: हाइट ब्लॉक कैनवास की ऊचाई लौटाता है।
ja: <h2>すうちブロック（カンバス）</h2><br>カンバスのたてはばのすうちを表す。カンバスのじょうほうを持つすうちブロックは、カンバスのたてはば、よこはば、ざひょうち（上）、ざひょうち（下）、ざひょうち（左）、ざひょうち（右）などの６種類がある。
mr: हाइट ब्लॉक कॅनव्हासची उंची परत करतो.
pt: O bloco Altura retorna a altura da tela.
te: ఎత్తు బ్లాక్ క్యానవాస్ యొక్క ఎత్తను తరిస్తుంది.
tr: height bloğu tuvalin yüksekliğini döndürür
ur: اونچائی کا بلاک کینوس کی اونچائی لوٹاتا ہے۔
zh_cn: Height 块返回画布的高度。

source: stop play
es: detener
fr: arrêter la lecture
hi: रुको प्ले
ja: 再生を停止
mr: खेळणे / चालणे थांबवा
pt: parar de tocar
te: ప్లే నిలిపివేయి
tr: oyunu durdur
ur: کھیل بند کرو
zh_cn: 停止播放

source: erase media
es: borrar medios
fr: effacer les médias
hi: मीडिया मिटाओ
ja: メディアを消す
mr: मीडिया मिटवा
te: చిత్రాలు మరియు వచనాలను తొలగించు
tr: medyayı sil
ur: میڈیا کو مٹا دیں
zh_cn: 清除媒体

source: The Erase Media block erases text and images.
es: El bloque Erase Media borra texto e imágenes.
fr: Le bloc Effacer les médias efface le texte et les images.
hi: इरेस मीडिया ब्लॉक टेक्स्ट और छवियाँ मिटाता है।
ja: 「メディアを消す」のブロックは文字と画像を消します。
mr: इरेज मीडिया ब्लॉक मजकूर आणि प्रतिमा मिटवतो.
te: ఎరేస్ మీడియా బ్లాక్ వచనాలు మరియు చిత్రాలను తొలగించిపెట్టింది.
tr: medya silme bloğu metin ve görüntüleri siler
ur: ایریز میڈیا بلاک متن اور تصاویر کو مٹا دیتا ہے۔
zh_cn: Erase Media 块会清除文本和图像。

source: play back
es: reproducir
fr: lecture
hi: प्ले बैक
ja: プレーバック
pt: tocar de fundo
te: ప్లే బ్యాక్
tr: geri oynat
ur: واپس کھیلیں
zh_cn: 回放

source: speak
es: hablar
fr: parler
hi: बोलो
ja: しゃべる
mr: बोलणे
pt: falar
te: మాట్లాడు
tr: konuşmak
ur: بولو
zh_cn: 聽我說

source: The Speak block outputs to the text-to-speech synthesizer
es: El bloque Habla emite al sintetizador de texto a voz.
fr: Le bloc Parler envoie la sortie au synthétiseur de texte en parole
hi: स्पीक ब्लॉक टेक्स्ट-टू-स्पीच सिंथेसाइज़र को आउटपुट करता है।
ja: <h2>音声ブロック</h2><br>打ち込んだ文字を、機械音声で読み上げる。
mr: स्पीक ब्लॉक मजकूर-ते-बोलणे सिंथेसायझरला आउटपुट करतो
pt: O bloco Falar executa o sintetizador de texto para fala
te: దాని విషయంగా, సాక్షరిక మాధ్యమ సింథిసైజర్‌కు ఆఉట్‌పుట్ చేస్తుంది
ur: اسپیک بلاک ٹیکسٹ ٹو اسپیچ سنتھیسائزر کو آؤٹ پٹ کرتا ہے۔
zh_cn: Speak 块输出到文本转语音合成器。

source: camera
fr: caméra
hi: कैमरा
ja: カメラ
te: క్యామెరా
tr: kamera
ur: کیمرے
zh_cn: 摄像头

source: The Camera block connects a webcam to the Show block.
es: El bloque cámara conecta una cámara web al bloque mostrar.
fr: Le bloc Caméra connecte une webcam au bloc Afficher.
mr: कॅमेरा ब्लॉक शो ब्लॉकला वेबकॅम जोडतो.
pt: O bloco Câmera conecta a câmera web com o bloco Mostar.
te: క్యామెరా బ్లాక్ వెబ్‌క్యామ్‌ను షో బ్లాక్‌కు కలిపిస్తుంది.
tr: kamera bloğu bir web kamerasını gösteri bloğuna bağlar
ur: کیمرہ بلاک ایک ویب کیم کو شو بلاک سے جوڑتا ہے۔
zh_cn: Camera 块将摄像头连接到 Show 块。

source: video
fr: vidéo
ja: ビデオ
te: వీడియో
ur: ویڈیو
zh_cn: 视频

source: The Video block selects video for use with the Show block.
es: El bloque video selecciona video para al bloque mostrar.
fr: Le bloc Vidéo sélectionne la vidéo à utiliser avec le bloc Afficher.
mr: व्हिडिओ ब्लॉक शो ब्लॉकसाठी व्हिडिओ निवडतो.
pt: O bloco Vídeo seleciona vídeo para usar com o bloco Mostrar.
te: వీడియో బ్లాక్ షో బ్లాక్‌తో ఉపయోగించాల్సిన వీడియోను ఎంచుకుంది.
tr: video bloğu
ur: ویڈیو بلاک شو بلاک کے ساتھ استعمال کے لیے ویڈیو کا انتخاب کرتا ہے۔
zh_cn: Video 块选择用于 Show 块的视频。

source: The Open file block opens a file for use with the Show block.
es: El bloque Abrir archivo abre un archivo para usar con el bloque Mostrar.
fr: Le bloc Ouvrir un fichier ouvre un fichier à utiliser avec le bloc Afficher.
mr: ओपन फाइल ब्लॉक शो ब्लॉकसाठी फाइल उघडतो.
pt: O bloco Abrir arquivo abre um arquivo para usar com o bloco Mostrar.
te: ఓపెన్ ఫైల్ బ్లాక్ ఫైల్‌ను షో బ్లాక్‌తో ఉపయోగించడానికి తెరవిస్తుంది.
tr: open file bloğu show bloğu ile kullanılmak üzere bir dosya açar
ur: اوپن فائل بلاک شو بلاک کے ساتھ استعمال کے لیے ایک فائل کھولتا ہے۔
zh_cn: Open file 块打开一个用于 Show 块的文件。

source: stop media
es: detener medios
fr: arrêter les médias
hi: मीडिया रोक
ja: メデイアを停止
mr: मीडिया थांबवा
pt: parar mídia
te: మీడియా ఆపరేషన్ ఆపు
tr: medyayı durdur
ur: میڈیا بند کرو
zh_cn: 停止媒体

source: The Stop media block stops audio or video playback.
es: El bloque detener medios detiene la reproducción de audio o video.
fr: Le bloc Arrêter les médias arrête la lecture audio ou vidéo.
mr: स्टॉप मीडिया ब्लॉक ऑडिओ किंवा व्हिडिओ प्लेबॅक थांबवतो.
pt: O bloco Parar mídia para o áudio ou o vídeo sendo executado.
te: స్టాప్ మీడియా బ్లాక్ ఆడియో లేదా వీడియో ప్లేబ్యాక్‌ను ఆపుకుంది.
tr: stop media bloğu ses veya video oynatmayı durdurur
ur: اسٹاپ میڈیا بلاک آڈیو یا ویڈیو پلے بیک کو روکتا ہے۔
zh_cn: Stop media 块停止音频或视频的播放。

source: frequency
es: frecuencia
fr: fréquence
hi: आवृत्ति
ja: 周波数
pt: frequência
te: సంవర్ధన"
tr: frekans
ur: تعدد
zh_cn: 频率

source: duration (MS)
fr: durée (MS)
tr: duration (ms) (Bağlam
ur: تعدد
zh_cn: 持续时间（毫秒）

source: note to frequency
es: nota a frecuencia
fr: note en fréquence
ja: 音符の高さを周波数表示へ
pt: nota para frequência
te: గానాను హర్ట్జ్‌కు అనువదించండి, ఉదాహరణ A4 -> 440HZ
tr: frekansa not
ur: تعدد کو نوٹ کریں۔
zh_cn: 音符转频率

source: The To frequency block converts a pitch name and octave to Hertz.
es: El bloque A frecuencia convierte un nombre de tono y una octava a Hertz.
fr: Le bloc En fréquence convertit un nom de hauteur et une octave en hertz.
mr: टू फ्रिक्वेंसी ब्लॉक पिच नाव आणि सप्तक हर्ट्झमध्ये रूपांतरित करतो.
pt: O bloco frequência converte o nome de um tom e de uma oitava em Hertz.
te: టు ఫ్రిక్వెన్సీ బ్లాక్ పిచ్ పేరు మరియు ఆక్టావ్‌ను హర్ట్జ్‌కు మార్చిపెడతాం.
tr: to frequency bloğu bir perde adını ve oktavı hertz'e dönüştürür
ur: ٹو فریکوئنسی بلاک پچ کا نام اور آکٹیو کو ہرٹز میں تبدیل کرتا ہے۔
zh_cn: To frequency 块将音高名称和音阶转换为赫兹。

source: The Avatar block is used to change the appearance of the mouse.
es: El bloque Avatar se usa para cambiar la apariencia del ratón.
fr: Le bloc Avatar est utilisé pour changer l'apparence de la souris.
mr: अवतार ब्लॉक माऊसचा देखावा बदलण्यासाठी वापरला जातो.
te: ఆవతార్ బ్లాక్ మౌస్ యొక్క ప్రదర్శనను మార్చడానికి ఉపయోగిస్తారు.
tr: avatar bloğu farenin görünümünü değiştirmek için kullanılır
ur: اوتار بلاک کا استعمال ماؤس کی ظاہری شکل کو تبدیل کرنے کے لیے کیا جاتا ہے۔
zh_cn: Avatar 块用于更改鼠标的外观。

source: The Avatar block is used to change the appearance of the turtle.
es: El bloque Avatar se usa para cambiar la apariencia de la tortuga.
fr: Le bloc Avatar est utilisé pour changer l'apparence de la tortue.
mr: अवतार ब्लॉक कासवाचा देखावा बदलण्यासाठी वापरला जातो.
te: ఆవతార్ బ్లాక్ టర్టిల్ యొక్క ప్రదర్శనను మార్చడానికి ఉపయోగిస్తారు.
tr: avatar bloğu kaplumbağanın görünümünü değiştirmek için kullanılır
ur: اوتار بلاک کو کچھوے کی شکل بدلنے کے لیے استعمال کیا جاتا ہے۔
zh_cn: Avatar 块用于更改乌龟的外观。

source: size
es: tamaño
fr: taille
hi: आकार
ja: 大きさ
mr: आकार
pt: tamanho
te: పరిమాణం
tr: boyut
ur: سائز
zh_cn: 大小

source: image
es: imagen
hi: फोटो
ja: がぞうそざい
mr: प्रतिमा
pt: imagem
te: చిత్రం
tr: görüntü
ur: تصویر
zh_cn: 圖片
