Repository: sugarlabs/musicblocks
Catalog: po/*.po
Languages: es, fr, hi, ja, mr, pt, te, tr, ur, zh_cn

source: The Mouse elapse notes block returns the number of notes played by the specified mouse.
es: El bloque de notas jugadas del ratón devuelve el número de notas tocadas por el ratón especificado.
fr: Le bloc Notes jouées par la souris renvoie le nombre de notes jouées par la souris spécifiée.
hi: माउस इलैप्स स्वर ब्लॉक निर्दिष्ट माउस द्वारा बजाए गए स्वरों की संख्या वापस करता है।
mr: माऊस एलेप्स नोट्स ब्लॉक निर्दिष्ट माऊसद्वारे वाजवलेल्या नोट्सची संख्या परतवतो.
pt: O bloco de notas de passagem do Ratinho retorna o número de notas executadas pelo ratinho especificado.
te: నిర్దిష్టమైన మౌస్ కోసం Elapse చేసిన నోట్ల సంఖ్యను తరిస్తుంది.
tr: mouse elapse notes bloğu belirtilen fare tarafından çalınan notaların sayısını döndürür
ur: ماؤس ایلپس نوٹ بلاک مخصوص ماؤس کے ذریعے چلائے گئے نوٹوں کی تعداد لوٹاتا ہے۔
zh_cn: 鼠标经过音符块返回指定鼠标已弹奏的音符数量。

source: turtle notes played
es: notas jugadas de tortuga
fr: notes jouées par la tortue
hi: कछुआ बजाए गए स्वर
ja: タートルの演奏した音符の数
mr: कासवाने वाजवलेल्या नोट्स
te: టర్టిల్ ప్లే చేసిన నోట్లు
tr: kaplumbağa notaları çalındı
ur: کچھی کے نوٹ کھیلے گئے۔
zh_cn: 乌龟已弹奏的音符数

source: The Turtle elapse notes block returns the number of notes played by the specified turtle.
es: El bloque de notas jugadas de la tortuga devuelve el número de notas tocadas por la tortuga especificado.
fr: Le bloc Notes de la tortue renvoie le nombre de notes jouées par la tortue spécifiée.
hi: कछुआ इलैप्स स्वर ब्लॉक निर्दिष्ट कछुए द्वारा बजाए गए स्वरों की संख्या वापस करता है।
mr: कासव एलेप्स नोट्स ब्लॉक निर्दिष्ट कासवद्वारे वाजवलेल्या नोट्सची संख्या परतवतो.
te: నిర్దిష్టమైన టర్టిల్ కోసం Elapse చేసిన నోట్ల సంఖ్యను తరిస్తుంది.
tr: turtle elapse notes bloğu belirtilen kaplumbağa tarafından çalınan nota sayısını döndürür
ur: ٹرٹل ایلپس نوٹ بلاک مخصوص کچھوے کے ذریعے چلائے گئے نوٹوں کی تعداد لوٹاتا ہے۔
zh_cn: 乌龟经过音符块返回指定乌龟已弹奏的音符数量。

source: mouse pitch number
es: número de tono de ratón
fr: numéro de hauteur de la souris
hi: माउस पिच नंबर
ja: ネズミの音高数字
mr: माउस पिच क्रमांक
pt: número de tom do ratinho
te: మౌస్ పిచ్ సంఖ్య
tr: fare adım numarası
ur: ماؤس پچ نمبر
zh_cn: 鼠标音高编号

source: The Mouse pitch block returns the current pitch number being played by the specified mouse.
es: El bloque de tono del ratón devuelve el número de tono actual que está reproduciendo el ratón especificado.
fr: Le bloc Hauteur de la souris renvoie le numéro de hauteur actuellement joué par la souris spécifiée.
hi: माउस पिच ब्लॉक विशिष्ट माउस द्वारा बजाए जा रहे वर्तमान पिच नंबर को वापस करता है।
mr: माउस पिच ब्लॉक निर्दिष्ट माउसद्वारे वाजवलेला वर्तमान पिच क्रमांक परत करतो.
pt: O bloco tom do Ratinho retorna o tom atual sendo executado pelo ratinho especificado.
te: నిర్దిష్టమైన మౌస్ కోసం ప్రస్తుత పిచ్ సంఖ్యను తరిస్తుంది.
tr: fare perdesi bloğu
ur: ماؤس پچ بلاک مخصوص ماؤس کے ذریعہ چلائے جانے والے موجودہ پچ نمبر کو لوٹاتا ہے۔
zh_cn: 鼠标音高块返回指定鼠标当前演奏的音高编号。

source: turtle pitch number
es: número de tono de tortuga
fr: numéro de hauteur de la tortue
hi: कछुआ पिच नंबर
ja: タートルの音高数字
mr: टर्टल पिच क्रमांक
te: టర్టిల్ పిచ్ సంఖ్య
tr: kaplumbağa adım numarası
ur: کچھی پچ نمبر
zh_cn: 乌龟音高编号

source: The Turtle pitch block returns the current pitch number being played by the specified turtle.
es: El bloque de tono de la tortuga devuelve el número de tono actual que está reproduciendo la tortuga especificado.
fr: Le bloc Hauteur de la tortue renvoie le numéro de hauteur actuellement joué par la tortue spécifiée.
hi: टर्टल पिच ब्लॉक विशिष्ट कछुआ द्वारा बजाए जा रहे वर्तमान पिच नंबर को वापस करता है।
mr: टर्टल पिच ब्लॉक निर्दिष्ट टर्टलद्वारे वाजवलेला वर्तमान पिच क्रमांक परत करतो.
tr: the turtle pitch bloğu belirtilen kaplumbağa tarafından çalınmakta olan geçerli perde numarasını döndürür
ur: ٹرٹل پچ بلاک مخصوص کچھوے کے ذریعہ چلائے جانے والے موجودہ پچ نمبر کو لوٹاتا ہے۔
zh_cn: 乌龟音高块返回指定乌龟当前演奏的音高编号。

source: mouse note value
es: valor de la nota del ratón
fr: valeur de note de la souris
hi: माउस नोट मूल्य
ja: ネズミの音価
mr: माउस नोट मूल्य
pt: valor da nota do ratinho
te: మౌస్ నోట్ విల్యూ
tr: fare nota değeri
ur: ماؤس نوٹ کی قدر
zh_cn: 鼠标音符时值

source: turtle note value
es: valor de la nota de la tortuga
fr: valeur de note de la tortue
hi: कछुआ नोट मूल्य
ja: タートルの音価
mr: टर्टल नोट मूल्य
te: టర్టిల్ నోట్ విల్యూ
tr: kaplumbağa nota değeri
ur: کچھی نوٹ کی قیمت
zh_cn: 乌龟音符时值

source: mouse sync
es: sincronizar
fr: synchronisation de la souris
hi: माउस सिंक
ja: ネズミを同期させる
mr: माउस सिंक
pt: sincronizar ratinho
te: మౌస్ సింక్
tr: fare senkronizasyonu
ur: ماؤس کی مطابقت پذیری
zh_cn: 鼠标同步

source: The Mouse sync block aligns the beat count between mice.
es: El bloque sincronizar alinea el conteo de latidos entre ratones.
fr: Le bloc Synchronisation de la souris aligne le compte des battements entre les souris.
hi: माउस सिंक ब्लॉक माउस के बीट गिनती को समरेखित करता है।
mr: माउस सिंक ब्लॉक माउस दरम्यान बीट गणना संरेखित करतो.
pt: O bloco de sincronização do Ratinho alinha a contagem de batimentos entre os ratinho.
te: మౌస్ సింక్ బ్లాక్ మౌస్ల మధ్య బీట్ కౌంటును అమర్చుకుంది.
tr: fare senkronizasyon bloğu fareler arasındaki vuruş sayısını hizalar
ur: ماؤس سنک بلاک چوہوں کے درمیان بیٹ گنتی کو سیدھ میں کرتا ہے۔
zh_cn: 鼠标同步块用于对齐鼠标之间的节拍计数。

source: turtle sync
es: sincronizar
fr: synchronisation de la tortue
hi: कछुआ सिंक
ja: タートルを同期させる
mr: टर्टल सिंक
te: టర్టిల్ సింక్
tr: kaplumbağa senkronizasyonu
ur: کچھی مطابقت پذیری
zh_cn: 乌龟同步

source: The Turtle sync block aligns the beat count between turtles.
es: El bloque sincronizar alinea el conteo de latidos entre tortugas.
fr: Le bloc Synchronisation de la tortue aligne le compte des battements entre les tortues.
hi: टर्टल सिंक ब्लॉक कछुओं के बीट गिनती को समरेखित करता है।
mr: टर्टल सिंक ब्लॉक टर्टल दरम्यान बीट गणना संरेखित करतो.
te: టర్టిల్ సింక్ బ్లాక్ టర్టిల్ల మధ్య బీట్ కౌంటును అమర్చుకుంది.
tr: turtle sync bloğu kaplumbağalar arasındaki vuruş sayısını hizalar
ur: ٹرٹل سنک بلاک کچھوؤں کے درمیان بیٹ کی گنتی کو سیدھ میں کرتا ہے۔
zh_cn: 乌龟同步块用于对齐乌龟之间的节拍计数。

source: The Found mouse block will return true if the specified mouse can be found.
es: El bloque de ratón encontrado devolverá verdadero si se puede encontrar el ratón especificado.
fr: Le bloc Souris trouvée renverra vrai si la souris spécifiée peut être trouvée.
hi: फाउंड माउस ब्लॉक विशिष्ट माउस को पहचाना जा सकता है तो सत्य वापस करेगा।
mr: फाउंड माउस ब्लॉक निर्दिष्ट माउस सापडल्यास खरे परत करेल.
pt: O bloco Encontrar do mouse retornará verdadeiro se o ratinho especificado for encontrado.
te: నిర్దిష్టమైన మౌస్ కనబడినట్లు ఆపని తరిస్తుంది.
tr: belirtilen fare bulunabiliyorsa fare bulundu bloğu true değerini döndürür
ur: فاؤنڈ ماؤس بلاک درست ہو جائے گا اگر مخصوص ماؤس مل جائے۔
zh_cn: 找到鼠标块在指定鼠标被找到时返回真。

source: found mouse
es: encontré el raton
fr: souris trouvée
hi: मिला हुआ माउस
ja: ネズミを見つけた
mr: सापडलेला माउस
pt: encontrar ratinho
te: కనిపించిన మౌస్
tr: fare bulundu
ur: ماؤس ملا
zh_cn: 找到鼠标

source: The Found turtle block will return true if the specified turtle can be found.
es: El bloque de tortuga encontrado devolverá verdadero si se puede encontrar el tortuga especificado.
fr: Le bloc Tortue trouvée renverra vrai si la tortue spécifiée peut être trouvée.
hi: फाउंड टर्टल ब्लॉक विशिष्ट कछुआ को पहचाना जा सकता है तो सत्य वापस करेगा।
mr: फाउंड टर्टल ब्लॉक निर्दिष्ट टर्टल सापडल्यास खरे परत करेल.
te: నిర్దిష్టమైన టర్టిల్ కనబడినట్లు ఆపని తరిస్తుంది.
tr: belirtilen kaplumbağa bulunabiliyorsa found turtle bloğu true değerini döndürür
ur: ملا ٹرٹل بلاک درست ہو جائے گا اگر مخصوص کچھوا مل جائے۔
zh_cn: 找到乌龟块在指定乌龟被找到时返回真。

source: found turtle
es: encontré la tortuga
fr: tortue trouvée
hi: मिला हुआ कछुआ
ja: タートル見つかった
mr: सापडलेला टर्टल
te: కనిపించిన టర్టిల్
tr: kaplumbağa bulundu
ur: کچھی ملا
zh_cn: 找到乌龟

source: new mouse
es: nuevo ratón
fr: nouvelle souris
hi: नया माउस
ja: 新しいネズミ
mr: नवीन माउस
pt: novo ratinho
te: కొత్త మౌస్
tr: yeni fare
ur: نیا ماؤس
zh_cn: 新鼠标

source: The New mouse block will create a new mouse.
es: El bloque nuevo ratón crea un nuevo ratón.
fr: Le bloc Nouvelle souris créera une nouvelle souris.
hi: नया माउस ब्लॉक नया माउस बनाएगा।
mr: नवीन माउस ब्लॉक नवीन माउस तयार करेल.
pt: O bloco Novo mouse criará um novo ratinho.
te: కొత్త మౌస్ రూపొందిస్తుంది.
tr: yeni fare bloğu yeni bir fare oluşturacaktır
ur: نیا ماؤس بلاک ایک نیا ماؤس بنائے گا۔
zh_cn: 新鼠标块将创建一个新的鼠标。

source: new turtle
es: nuevo tortuga
fr: nouvelle tortue
hi: नया कछुआ
ja: 新しいタートル
mr: नवीन टर्टल
te: కొత్త టర్టిల్
tr: yeni kaplumbağa
ur: نیا کچھی
zh_cn: 新乌龟

source: The New turtle block will create a new turtle.
es: El bloque nuevo ratón crea un nuevo tortuga.
fr: Le bloc Nouvelle tortue créera une nouvelle tortue.
hi: नया टर्टल ब्लॉक नया कछुआ बनाएगा।
mr: नवीन टर्टल ब्लॉक नवीन टर्टल तयार करेल.
te: కొత్త టర్టిల్ రూపొందిస్తుంది.
tr: yeni kaplumbağa bloğu yeni bir kaplumbağa oluşturacaktır
ur: نیا کچھی بلاک ایک نیا کچھی بنائے گا۔
zh_cn: 新乌龟块将创建一个新的乌龟。

source: set mouse color
es: fijar color del ratón
fr: régler la couleur de la souris
hi: माउस का रंग सेट करें
ja: ネズミ色を設定
mr: माउस रंग सेट करा
te: మౌస్ రంగు సెట్ చేయి
tr: fare rengini ayarla
ur: ماؤس کا رنگ مقرر کریں
zh_cn: 设置鼠标颜色

source: The Set-mouse-color block is used to set the color of a mouse.
es: El bloque fijar color del ratón se usa para fijar el color de un ratón.
fr: Le bloc Régler la couleur de la souris est utilisé pour régler la couleur d'une souris.
hi: सेट-माउस-कलर ब्लॉक का उपयोग माउस के रंग को सेट करने के लिए किया जाता है।
ja: 「ネズミ色を設定」ブロックは ネズミの色を選ぶことに使います。
mr: सेट-माउस-रंग ब्लॉक माउसचा रंग सेट करण्यासाठी वापरला जातो.
te: మౌస్ యొక్క రంగును సెట్ చేయడానికి ఉపయోగిస్తారు.
ur: ماؤس کا رنگ سیٹ کرنے کے لیے سیٹ ماؤس کلر بلاک استعمال کیا جاتا ہے۔
zh_cn: 设置鼠标颜色块用于设置鼠标的颜色。

source: set turtle color
es: fijar color de la tortuga
fr: régler la couleur de la tortue
hi: कछुआ का रंग सेट करें
ja: タートル色を設定
mr: टर्टल रंग सेट करा
te: టర్టిల్ రంగు సెట్ చేయి
tr: kaplumbağa rengini ayarla
ur: کچھی کا رنگ مقرر کریں
zh_cn: 设置乌龟颜色

source: The Set-turtle-color block is used to set the color of a turtle.
es: El bloque fijar color de la tortuga se usa para fijar el color de una tortuga.
fr: Le bloc Régler la couleur de la tortue est utilisé pour régler la couleur d'une tortue.
hi: सेट-टर्टल-कलर ब्लॉक का उपयोग कछुआ के रंग को सेट करने के लिए किया जाता है।
mr: सेट-टर्टल-रंग ब्लॉक टर्टलचा रंग सेट करण्यासाठी वापरला जातो.
te: టర్టిల్ యొక్క రంగును సెట్ చేయడానికి ఉపయోగిస్తారు.
ur: سیٹ ٹرٹل کلر بلاک کچھوے کا رنگ سیٹ کرنے کے لیے استعمال ہوتا ہے۔
zh_cn: 设置乌龟颜色块用于设置乌龟的颜色。

source: The Mouse-name block returns the name of a mouse.
es: El bloque Nombre del ratón devuelve el nombre de un ratón.
fr: Le bloc Nom de la souris renvoie le nom d'une souris.
hi: माउस-नेम ब्लॉक एक माउस का नाम वापस करता है।
ja: <h2>文字ブロック</h2><br>このプログラムを実行しているネズミの名前（文字列）を表す。
mr: माउस-नाव ब्लॉक माउसचे नाव परत करतो.
pt: O bloco Nome-do-ratinho retorna o nome de um ratinho.
te: మౌస్-పేరు బ్లాక్ మౌస్ పేరును తరిస్తుంది.
ur: ماؤس نام کا بلاک ماؤس کا نام لوٹاتا ہے۔
zh_cn: 鼠标名称块返回鼠标的名称。

source: The Turtle-name block returns the name of a turtle.
es: El bloque Nombre de la tortuga devuelve el nombre de una tortuga.
fr: Le bloc Nom de la tortue renvoie le nom d'une tortue.
hi: टर्टल-नेम ब्लॉक एक कछुआ का नाम वापस करता है।
mr: टर्टल-नाव ब्लॉक टर्टलचे नाव परत करतो.
te: టర్టిల్-పేరు బ్లాక్ టర్టిల్ పేరును తరిస్తుంది.
ur: ٹرٹل نام کا بلاک کچھوے کا نام لوٹاتا ہے۔
zh_cn: 乌龟名称块返回乌龟的名称。

source: mouse count
es: recuento de ratones
fr: compte des souris
hi: माउस गणना
ja: 何匹のネズミ
mr: माउस संख्या
te: మౌస్ సంఖ్య
tr: fare sayısı
ur: ماؤس کی گنتی
zh_cn: 鼠标数量

source: The Mouse-count block returns the number of mice.
es: El bloque recuento de ratones devuelve el número de ratones.
fr: Le bloc Compte des souris renvoie le nombre de souris.
hi: माउस-काउंट ब्लॉक माउस की संख्या वापस करता है।
ja: 「何匹のネズミ」のブロックはネズミを数えって数字を表す。
mr: माउस-संख्या ब्लॉक माउसांची संख्या परत करतो.
te: మౌస్-కౌంట్ బ్లాక్ మౌస్ సంఖ్యను తరిస్తుంది.
ur: ماؤس کاؤنٹ بلاک چوہوں کی تعداد لوٹاتا ہے۔
zh_cn: 鼠标计数块返回鼠标的数量。

source: turtle count
es: recuento de tortuga
fr: compte des tortues
hi: कछुआ गणना
ja: 何匹のタートル
mr: टर्टल संख्या
te: టర్టిల్ సంఖ్య
tr: kaplumbağa sayımı
ur: کچھوے کی گنتی
zh_cn: 乌龟数量

source: The Turtle-count block returns the number of turtles.
es: El bloque recuento de tortugas devuelve el número de tortugas.
fr: Le bloc Compte des tortues renvoie le nombre de tortues.
hi: टर्टल-काउंट ब्लॉक कछुओं की संख्या वापस करता है।
mr: टर्टल-संख्या ब्लॉक टर्टलची संख्या परत करतो.
te: టర్టిల్-కౌంట్ బ్లాక్ టర్టిల్ల సంఖ్యను తరిస్తుంది.
ur: ٹرٹل کاؤنٹ بلاک کچھووں کی تعداد لوٹاتا ہے۔
zh_cn: Turtle-count 块返回乌龟的数量。

source: nth mouse name
es: nombre de nth ratón
fr: nom de la n-ième souris
hi: एनथ माउस नाम
ja: 何匹目のネズミの名前
mr: एनथ माउसचे नाव
te: ఎన్తసారి మౌస్ పేరు
tr: n'inci fare adı
ur: نویں ماؤس کا نام
zh_cn: 表示老鼠名称的音乐元素标签

source: The Nth-Mouse name block returns the name of the nth mouse.
es: El bloque de nombre Nth-ratón devuelve el nombre del enésimo ratón.
fr: Le bloc Nom de la n-ième souris renvoie le nom de la n-ième souris.
hi: एनथ-माउस-नेम ब्लॉक एनथ माउस का नाम वापस करता है।
mr: एनथ-माउस नाव ब्लॉक एनथ माउसचे नाव परत करतो.
te: Nth-Mouse పేరు బ్లాక్ Nth మౌస్ పేరును తరిస్తుంది.
ur: نویں ماؤس کا نام بلاک نویں ماؤس کا نام لوٹاتا ہے۔
zh_cn: Nth-Mouse 名称块返回第n只老鼠的名称。

source: nth turtle name
es: nombre de nth tortuga
fr: nom de la n-ième tortue
hi: एनथ कछुआ नाम
ja: 何匹目のタートルの名前
mr: एनथ टर्टलचे नाव
te: ఎన్తసారి టర్టిల్ పేరు
tr: n'inci kaplumbağa adı
ur: نویں کچھوے کا نام
zh_cn: 用于识别乐队中特定乌龟的块标签

source: The Nth-Turtle name block returns the name of the nth turtle.
es: El bloque de nombre Nth-tortuga devuelve el nombre del enésimo tortuga.
fr: Le bloc Nom de la n-ième tortue renvoie le nom de la n-ième tortue.
hi: एनथ-टर्टल-नेम ब्लॉक एनथ कछुआ का नाम वापस करता है।
mr: एनथ-टर्टल नाव ब्लॉक एनथ टर्टलचे नाव परत करतो.
te: Nth-Turtle పేరు బ్లాక్ Nth టర్టిల్ పేరును తరిస్తుంది.
ur: Nth-Turtle نام کا بلاک نویں کچھوے کا نام لوٹاتا ہے۔
zh_cn: Nth-Turtle 名称块返回第n只乌龟的名称。

source: set name
es: fijar nombre
fr: régler le nom
hi: नाम सेट करें
ja: ネズミに名前をつける
mr: नाव सेट करा
pt: Definir nome
te: పేరు సెట్ చేయి
tr: set adı
ur: نام مقرر کریں
zh_cn: 设置音乐元素或实体名称的块标签

source: source
es: origen
hi: स्रोत
ja: ソース
mr: स्रोत
pt: fonte
te: మూలం
tr: kaynak
ur: ذریعہ
zh_cn: 来源

source: target
es: destino
fr: cible
hi: लक्ष्य
ja: ターゲット
mr: लक्ष्य
pt: alvo
te: లక్ష్యం
tr: hedef
ur: ہدف
zh_cn: 目标

source: The Set-name block is used to name a mouse.
es: El bloque Fijar nombre se usa para nombrar un ratón.
fr: Le bloc Régler le nom est utilisé pour nommer une souris.
hi: सेट-नेम ब्लॉक का उपयोग माउस का नाम रखने के लिए किया जाता है।
ja: <h2>文字ブロック</h2><br>ネズミに指定した名前をつけることができる。
mr: सेट-नाव ब्लॉक माउसला नाव देण्यासाठी वापरला जातो.
pt: O bloco Definir-nome é usado para nomear um ratinho.
te: Set-name బ్లాక్ ఒక మౌస్ని పేరు చేయడానికి ఉపయోగిస్తారు.
ur: Set-name بلاک کو ماؤس کا نام دینے کے لیے استعمال کیا جاتا ہے۔
zh_cn: Set-name 块用于命名一只老鼠。

source: The Set-name block is used to name a turtle.
es: El bloque Fijar nombre se usa para nombrar una tortuga.
fr: Le bloc Régler le nom est utilisé pour nommer une tortue.
hi: सेट-नेम ब्लॉक का उपयोग कछुआ का नाम रखने के लिए किया जाता है।
ja: <h2>文字ブロック</h2><br>タートルに指定した名前をつけることができる。
mr: सेट-नाव ब्लॉक टर्टलला नाव देण्यासाठी वापरला जातो.
te: Set-name బ్లాక్ ఒక టర్టిల్ని పేరు చేయడానికి ఉపయోగిస్తారు.
ur: سیٹ نام کا بلاک کچھوے کے نام کے لیے استعمال ہوتا ہے۔
zh_cn: Set-name 块用于命名一只乌龟。

source: fraction
es: fracción
hi: अंश
ja: 分数
mr: अपुऱ्या
te: భాగం
tr: kesir
ur: حصہ
zh_cn: 分数

source: Convert a float to a fraction
es: convertir un número racional en fracción
fr: Convertir un flottant en fraction
hi: एक फ़्लोट को एक अंश में परिवर्तित करें
ja: 小数から分数
mr: फ्लोटला अपुऱ्यात रूपांतरित करा
te: ఫ్లోట్ను భాగంగా మార్చు
tr: floatı kesre dönüştürme
ur: فلوٹ کو کسر میں تبدیل کریں۔
zh_cn: 将浮动数转换为分数的工具提示标签

source: save as ABC
es: guardar como ABC
fr: enregistrer en ABC
hi: ABC के रूप में सहेजें
ja: ABCでほぞん
mr: ABC म्हणून जतन करा
pt: salvar como ABC
te: ABC రూపంలో భద్రపరచు
tr: abc olarak kaydet
ur: ABC کے بطور محفوظ کریں۔
zh_cn: 保存为 ABC 的块标签

source: title
es: título
fr: titre
hi: शीर्षक
ja: 名
mr: शीर्षक
pt: título
te: శీర్షిక
tr: başlık
ur: عنوان
zh_cn: 标题

source: save as Lilypond
es: guardar como Lilypond
fr: enregistrer en Lilypond
hi: Lilypond के रूप में सहेजें
ja: Lilypondのフォーマットでほぞん
mr: लिलीपॉंड म्हणून जतन करा
pt: Salvar como Lilypond
te: లిలీపాండ్ రూపంలో భద్రపరచు
tr: lilypond olarak kaydet
ur: Lilypond کے طور پر محفوظ کریں
zh_cn: 保存为 LilyPond 的块标签

source: save as SVG
es: guardar como SVG
fr: enregistrer en SVG
hi: SVG के रूप में सहेजें
ja: SVGでほぞん
mr: SVG म्हणून जतन करा
pt: salvar como SVG
te: SVG రూపంలో భద్రపరచు
tr: svg olarak kaydet
ur: SVG کے بطور محفوظ کریں۔
zh_cn: 保存为 SVG 的块标签

source: no background
es: sin fondo
fr: pas de fond
hi: कोई पृष्ठभूमि नहीं
ja: バックグラウンドなし
mr: कोणताही पार्श्वभूमी नाही
pt: sem plano de fundo
te: ఎన్నికలేదు నేను
tr: arka plan yok
ur: کوئی پس منظر نہیں
zh_cn: 移除背景的块标签

source: The No background block eliminates the background from the saved SVG output.
es: El bloque Sin fondo elimina el fondo de la salida SVG guardada.
fr: Le bloc Pas de fond élimine le fond de la sortie SVG enregistrée.
hi: नो बैकग्राउंड ब्लॉक निर्बाध एसवीजी आउटपुट से पृष्ठभूमि को हटा देता है।
mr: नो बॅकग्राउंड ब्लॉक जतन केलेल्या SVG आउटपुटमधून पार्श्वभूमी काढून टाकतो.
pt: O bloco Sem plano de fundo elimina o plano de fundo de uma saida SVG salva.
te: నో బ్యాక్గ్రౌండ్ బ్లాక్ సేవ్ చేసిన SVG ఔట్‌పుట్ నుండి బ్యాక్గ్రౌండ్‌ను తొలగిస్తుంది.
tr: no background bloğu kaydedilen svg çıktısından arka planı kaldırır
ur: کوئی بیک گراؤنڈ بلاک محفوظ کردہ SVG آؤٹ پٹ سے پس منظر کو ختم کرتا ہے۔
zh_cn: No background 块将从保存的 SVG 输出中移除背景。

source: show blocks
es: mostrar bloques
fr: montrer les blocs
hi: पिण्ड दिखाएँ
ja: ブロックを表示
mr: ब्लॉक्स दाखवा
pt: mostrar blocos
te: భాగాలను చూపు
tr: blokları göster
ur: بلاکس دکھائیں
zh_cn: 顯示區塊

source: The Show blocks block shows the blocks.
es: El bloque mostrar bloques muestra los bloques.
fr: Le bloc Montrer les blocs montre les blocs.
hi: शो ब्लॉक्स ब्लॉक ब्लॉक्स दिखाता है।
mr: शो ब्लॉक्स ब्लॉक ब्लॉक्स दाखवतो.
pt: O bloco Mostar blocos mostra os blocos.
te: షో బ్లాక్స్ బ్లాక్ భాగాలను చూపుతుంది.
tr: blokları göster bloğu blokları gösterir
ur: شو بلاکس بلاک بلاکس کو ظاہر کرتا ہے۔
zh_cn: Show blocks 块显示其他块。

source: The Hide blocks block hides the blocks.
es: El bloque ocultar esconde los bloques.
fr: Le bloc Cacher les blocs cache les blocs.
hi: हाइड ब्लॉक्स ब्लॉक ब्लॉक्स छुपा देता है।
mr: हाईड ब्लॉक्स ब्लॉक ब्लॉक्स लपवतो.
pt: O bloco Ocultar blocos esconde os blocos.
te: హైడ్ బ్లాక్స్ బ్లాక్ భాగాలను దాచుతుంది.
tr: blokları gizle bloğu blokları gizler
ur: Hide بلاکس بلاک بلاکس کو چھپاتا ہے۔
zh_cn: Hide blocks 块隐藏其他块。

source: The Space block is used to add space between blocks.
es: El bloque Espacio se utiliza para agregar espacio entre bloques.
fr: Le bloc Espace est utilisé pour ajouter de l'espace entre les blocs.
hi: स्थान ब्लॉक ब्लॉक्स के बीच स्थान जोड़ने के लिए उपयोग किया जाता है।
ja: <h2>スペースブロック</h2><br>ブロックとブロックの間にスペースを入れたいときに使う。
mr: स्पेस ब्लॉक ब्लॉक्स दरम्यान जागा जोडण्यासाठी वापरला जातो.
pt: O bloco Espaço é usado para adicionar espaço entre dois blocos.
te: స్పేస్ బ్లాక్ భాగాల మధ్యలో స్థానాన్ని జోడించడానికి ఉపయోగించబడుతుంది.
tr: boşluk bloğu bloklar arasına boşluk eklemek için kullanılır
ur: اسپیس بلاک کو بلاکس کے درمیان جگہ شامل کرنے کے لیے استعمال کیا جاتا ہے۔
zh_cn: Space 块用于在块之间添加空格。

source: wait
es: esperar
fr: attendre
hi: इंतजार करें
ja: 待つ
mr: थांबा
pt: espere
te: వేచి ఉండు
tr: bekleme
ur: انتظار کرو
zh_cn: 等待

source: The Wait block pauses the program for a specified number of seconds.
es: El bloque Espera detiene el programa durante un número específico de segundos.
fr: Le bloc Attendre met le programme en pause pour un nombre de secondes spécifié.
hi: वेट ब्लॉक निर्दिष्ट सेकंड के लिए कार्यक्रम को रोक देता है।
mr: वेट ब्लॉक प्रोग्रामला निर्दिष्ट केलेल्या सेकंदांकरिता थांबवतो.
pt: O bloco Esperar pausa o programa por um número de segundos especificado.
te: వేచి ఉండు బ్లాక్ ప్రోగ్రామ్‌ను ప్రతిసారి నిర్దిష్టమైన సెకన్ల కోసం విరామిస్తుంది.
tr: bekleme bloğu programı belirli bir saniye boyunca duraklatır
ur: انتظار بلاک پروگرام کو مخصوص سیکنڈوں کے لیے روکتا ہے۔
zh_cn: Wait 块使程序暂停指定的秒数。

source: comment
es: comentar
fr: commentaire
hi: टिप्पणी
ja: コメント
mr: टिप्पणी
pt: comentar
te: వ్యాఖ్య
tr: yorum
ur: تبصرہ
zh_cn: 註記

source: print
es: imprimir
fr: imprimer
hi: छापें
ja: 結果を表示
mr: छापणे
pt: imprimir
te: ముద్రణ
ur: تبصرہ
zh_cn: 顯示

source: The Print block displays text at the top of the screen.
es: El bloque Imprimir muestra texto en la parte superior de la pantalla.
fr: Le bloc Imprimer affiche du texte en haut de l'écran.
hi: प्रिंट ब्लॉक स्क्रीन के शीर्ष पर पाठ दिखाता है।
ja: <h2>表示ブロック（結果）</h2><br>画面の上部に、指定した実行結果のすうちや文字を表示する。表示したテキストはクリックすると消すことができる。どこでプログラムがまちがっているかをかくにんする際（デバグ）などによく用いられる。
mr: प्रिंट ब्लॉक स्क्रीनच्या शीर्षस्थानी मजकूर प्रदर्शित करतो.
pt: O bloco Exibir exibe o texto na parte superior da tela.
te: ప్రింట్ బ్లాక్ స్క్రీన్ చోటకు వచ్చిన టెక్స్ట్‌ను ప్రదర్శిస్తుంది.
tr: yazdırma bloğu ekranın üst kısmında metin görüntüler
ur: پرنٹ بلاک اسکرین کے اوپری حصے میں متن دکھاتا ہے۔
zh_cn: Print 块在屏幕顶部显示文本。

source: display grid
es: mostrar cuadrícula
fr: afficher la grille
hi: ग्रिड दिखाएँ
ja: グリッドを表示
mr: ग्रिड दाखवा
te: గ్రిడ్ ప్రదర్శించు
tr: ızgarayı göster
ur: ڈسپلے گرڈ
zh_cn: 显示网格的块标签

source: The Display Grid Block changes the grid type
es: Mostrar el bloque de cuadrícula cambia el tipo de cuadrícula
fr: Le bloc Afficher la grille change le type de grille
hi: डिस्प्ले ग्रिड ब्लॉक ग्रिड प्रकार बदलता है
ja: 表示グリッド ブロックのグリッド タイプの変更
mr: डिस्प्ले ग्रिड ब्लॉक ग्रिड प्रकार बदलतो
te: డిస్ప్లే గ్రిడ్ బ్లాక్ గ్రిడ్ రకాన్ని మార్చుతుంది.
tr: ekran ızgara bloğu ızgara türünü değiştirir
ur: ڈسپلے گرڈ بلاک گرڈ کی قسم کو تبدیل کرتا ہے۔
zh_cn: Display Grid 块更改网格类型

source: unknown
es: desconocido
fr: inconnu
hi: अज्ञात
ja: 不明
mr: अज्ञात
pt: desconhecido
tr: bilinmeyen
ur: نامعلوم
zh_cn: 未知

source: heading
es: rumbo
fr: le cap
hi: शीर्षक
ja: 向き（ネズミ）
mr: शिर्षक
pt: rumo
te: పీఠిక
tr: başlık
ur: سرخی
zh_cn: 方向

source: The Heading block returns the orientation of the mouse.
es: El bloque rumbo devuelve la orientación del ratón.
fr: Le bloc Cap renvoie l'orientation de la souris.
ja: <h2>すうちブロック</h2><br>ネズミの向いている角度を表すすうちブロック。向きの値は、０以上で、３６０より小さい値になり、プラスだと右回り、マイナスだと左回りに変化する。
mr: हेडिंग ब्लॉक माऊसची दिशा परत करतो.
pt: O bloco Rumo retorna a orientação do ratinho.
te: హెడింగ్ బ్లాక్ మౌస్ యొక్క ఒకరిని తిరిగి తేలుతుంది.
tr: heading bloğu farenin yönünü döndürür
ur: ہیڈنگ بلاک ماؤس کی واقفیت واپس کرتا ہے۔
zh_cn: Heading 块返回老鼠的朝向。

source: The Heading block returns the orientation of the turtle.
es: El bloque rumbo devuelve la orientación de la tortuga.
fr: Le bloc Cap renvoie l'orientation de la tortue.
mr: हेडिंग ब्लॉक कासवाची दिशा परत करतो.
te: హెడింగ్ బ్లాక్ టర్టిల్ యొక్క ఒకరిని తిరిగి తేలుతుంది.
tr: heading bloğu kaplumbağanın yönünü döndürür
ur: ہیڈنگ بلاک کچھوے کی واقفیت واپس کرتا ہے۔
zh_cn: Heading 块返回乌龟的朝向。

source: The Y block returns the vertical position of the mouse.
es: El bloque Y devuelve la posición horizontal del ratón.
fr: Le bloc Y renvoie la position verticale de la souris.
ja: <h2>すうちブロック</h2><br>ネズミのｙざひょう（たて方向の位置）を表すすうちブロック。<br><br>★ざひょうとは<br>物の位置を表すためのすうちのこと。ミュージック・ブロックスでは、２つ１組みのすうち（ざひょう）を使う。画面上のネズミの位置は、ほうがん用紙のマス目のように、よこ方向の目もり（xざひょう）とたて方向の目もり（ｙざひょう）を使って表す。
mr: वाय ब्लॉक माऊसची उभ्या स्थिती परत करतो.
pt: O bloco Y retorna a posição vertical do ratinho.
te: Y బ్లాక్ మౌస్ యొక్క ఉండికని తిరిగి తేలుతుంది.
tr: y bloğu farenin dikey konumunu döndürür
ur: Y بلاک ماؤس کی عمودی پوزیشن کو لوٹاتا ہے۔
zh_cn: Y 块返回老鼠的垂直位置。
